       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID.      SABGP380.                                               
       AUTHOR.          SHERRY ELIZABETH BAKER.                                 
       INSTALLATION.    MICHELIN AMERICA'S SERVICES.                            
       DATE-WRITTEN.    19 MARCH 1993.                                          
       DATE-COMPILED.   TODAY.                                                  
                                                                                
      *****************************************************************         
      *   PURPOSE:    DC ONLINE TO CREATE INVOICE.                    *         
      *                                                               *         
      *               THIS PROGRAM WILL BE CALLED VIA WICS/WMS        *         
      *               PRINTBOL PROCESSING, OR ORDER ENTRY 'FINISH'    *         
      *               PROCESSING.  ORDER ENTRY FINISH CALL IS VIA     *         
      *               AOBGD299.  PROGRAM WILL CREATE INVOICE LINES,   *         
      *               THEN CALL SABGP390 TO CREATE INVOICE HEADER.    *         
      *               THIS PROGRAM IS A CLONE OF SABGP080, AND        *         
      *               REPLACES DIALOG AOBGD300 (COEDUIV0).            *         
      *                                                               *         
      *   =====>      BEFORE PROMOTING THIS PROGRAM, DO "FIND" ON     *         
      *               PCV6, AND VERIFY THAT ALL 'X' PROGRAM NAMES     *         
      *               HAVE BEEN CHANGED TO 'P'.                       *         
      *                                                               *         
      *   =====>      CHANGES TO THIS PROGRAM MUST ALSO BE APPLIED TO *         
      *               BATCH CLONE SABGP080.                           *         
      *                                                               *         
      *                                                               *         
      *****************************************************************         
      *                                                               *         
      *                      MODIFICATION HISTORY                     *         
      *                                                               *         
      *  STAMP      DATE     WHO             EXPLANATION              *         
      * ------------------------------------------------------------- *         
      * 2IV170/ 01/12/00 IMR  PASS RECORDS LOAD,MESSAGE-TYPE,MESSAGE    IM000112
      * RFS037                DATA,INVXREF-RGRP AND INVXREF-INVOICE TO  IM000112
      *                       SABGP390                                  IM000112
      *                                                                         
      * 2IV814/ 03/20/00 IMR  ADDED 'NR' TRANSACTION TYPE.THIS WILL BE  IM000320
      * RFS050                PROCESSED LIKE 'DR'.                      IM000320
      * 2SP160  04/30/01 IMR  XB80 MESSAGE-TYPE-931 & MESSAGE-DATA      IM010430
      *                       BEING CREATED FOR CROSS-BORDER INVOICES   IM010430
      * 2SP350  08/01/02 CGI  INCLUDED CODE FOR INTEGRATING MRT WITH SDSCG020801
      *                       CODE CHANGED FOR CALCULATING AND STORING  CG020801
      *                       THE UNIT-PRICE ON THE AR-INVOICE-ITEM.    CG020801
      *                       CHANGES TAGGED AS CG020801                CG020801
      *                       CHANGES INCLUDE CALCULATING AND STORING   CG020801
      *                       THE AR-INVOICE-ITEM'S UNIT-PRICE, BASED   CG020801
      *                       ON THE NUMBER OF ROLLS, SO THAT NORMAL    CG020801
      *                       INVOICING CALCULATIONS BASED ON THE       CG020801
      *                       QUANTITY FIELD (IN THIS CASE, ROLLS) CAN  CG020801
      *                       BE KEPT INTACT.                           CG020801
      *                       RELEASE : 2SP350    TAG : CG020801        CG020801
      * 2SP530  08/21/02 CGI  CHANGES TO BE MADE TO CREATE INVOICES     CG020821
      *                       FOR MTP PRODUCTS. TAGGED AS CG020821.     CG020821
      * 504880  10/29/02 CGI  CUSTEXT RECORD REMOVED FROM LINKAGE       CG021029
      *                       SECTION.                                  CG021029
      * 546489  03/12/03 CGI  MODIFIED CODE TO 'ADD' A CLOSE-READER     CG030312
      *                       STATEMENT, TO INDICATE COMPLETION OF      CG030312
      *                       INTERNAL JCL READS.  TAG : CG030312       CG030312
      * 2XM003  04/10/03 CGI  MODIFIED PROGRAM TO DETERMINE TAX         CG030410
      *                       EXEMPTION BY COMPARING WITH 5-DIGIT       CG030410
      *                       ZIP-CODE INSTEAD OF 9-DIGIT.              CG030410
      *                       TAG : CG030410                            CG030410
      * 620090  08/06/03 CGI  MODIFIED CODE, TO TRIGGER OFF INTERNAL    CG030806
      *                       JCL BASED ON THE 1ST BYTE OF THE CUSTOMER CG030806
      *                       NUMBER. TAG : CG030806  TICKET : 620090   CG030806
      * 2XM014  07/17/03 CGI  THE PROGRAM IS MODIFIED TO UPDATE LAST    CG030717
      *                       ACTIVITY DATE AND TIME ON SALES-ORDER-    CG030717
      *                       LINE RECORD. TAGGED AS CG030717.          CG030717
      * 2XM047  11/18/03 CGI  PROGRAM MODIFIED TO STORE                 CG031118
      *                       RETREAD-TAX-FLAG IN AR-INVOICE-ITEM       CG031118
      *                       RECORD AND MOVE EITHER 'Y' OR 'N' TO      CG031118
      *                       AVP-RETREAD-TAX-FLAG OF AVP-TAX-RECORD    CG031118
      *                       AFTER CHECKING THE NEW RETREAD-TAX-FLAG   CG031118
      *                       -3503 FROM THE SALES-ORDER-LINE RECORD.   CG031118
      *                       IF THE RETREAD-TAX-FLAG IN SALES-ORDER    CG031118
      *                       -LINE IS 'Y', THE RETREAD-TAX-FLAG-2714   CG031118
      *                       AND AVP-RETREAD-TAX-FLAG WILL BE TURNED   CG031118
      *                       TO 'Y', TO INDICATE A DIFFERENT METHOD OF CG031118
      *                       TAX CALCULATION.                          CG031118
      *                       SIMILAR CHANGES HAVE NOT BEEN CARRIED OUT CG031118
      *                       FOR SABGP080 AS COEBUAVP IS NOT IMPACTED. CG031118
      *                       RELEASE : 2XM047    TAG : CG031118        CG031118
      * 663761  01/29/04 CGI  MODIFIED CODE TO CALL SABGD307 & SABGD308 CG040129
      *                       INSTEAD OF SABGD301 & SABGD302. THIS HAS  CG040129
      *                       BEEN DONE, TO ENSURE ISA GETS CALLED IN   CG040129
      *                       CASE OF ANY ABENDS IN SABGD301 & SABGD302 CG040129
      *                       TICKET: 663761    TAG: CG040129           CG040129
      *SA701537 03/24/04 CGI  PROGRAM MODIFIED ALLOW USE OF THE FORM-  *CG040324
      *                       DATE FOR FET CALCULATIONS FOR TRANSACTION*CG040324
      *                       TYPE 'OS.  CHANGES TAGGED AS CG040324.   *CG040324
      * 2XM091  03/12/04 CGI  THE CODE HAS BEEN MODIFIED TO AVOID      *CG040318
      *                       INVOICE LINES WHICH HAVE ULTRA-SHIP-     *CG040318
      *                       FLAG-3503 AS 'F' FROM HEADER DISCOUNT    *CG040318
      *                       CALCULATION.THIS APPLIES TO INVOICES     *CG040318
      *                       WHICH HAVE HEADER DISCOUNT CODE AS       *CG040318
      *                       'SPCFRT' AND 'STGFRT' ONLY.              *CG040318
      *                       TAG : CG040318.                          *CG040318
      * 2XM174  01/19/05 CGI  THE CODE HAS BEEN MODIFIED TO PRICE THE  *CG050119
      *                       SALES ORDER LINE FOR THE CUSTOMERS IN    *CG050119
      *                       'PRCSHPCUS' TABLE SETUP USING SHIP DATE. *CG050119
      *                       UPDATE THE ORDER LINE AND INVOICE LINE   *CG050119
      *                       WITH NEW PRICE DETAILS. TAG: CG050119    *CG050119
      *SA823828 04/11/05 CGI  THE CODE HAS BEEN MODIFIED TO AVOID THE  *CG050411
      *                       INVOICE STATUS BEING UPDATED AS          *CG050411
      *                       INCOMPLETE, WHEN TAXWARE MODULE RETURNS  *CG050411
      *                       UNSUCCESSFUL AVP-COMPL-CODE. CODE HAS    *CG050411
      *                       BEEN REMOVED AND NO TAG EXISTS.          *CG050411
      * 2XM192  05/18/05 CGI  MODIFIED CODE TO CONVERT APPROPRIATE     *CG050602
      *                       AMOUNTS INTO USD FOR CUSTOMERS WHOSE     *CG050602
      *                       CURRENCY IS DEFINED AS USD IN CANADA.    *CG050602
      *                       TAG: CG050602                            *CG050602
      * 394134   06/13/05 CGI MODIFIED CODE TO CONSIDER ONLY NON       *CG050613
      *                       '3001' CATEGORY CUSTOMERS FOR CURRENCY   *CG050613
      *                       CONVERSION FOR 2XM192                    *CG050613
      *                       TAG: CG050613                            *CG050613
      * 433145   06/22/05 CGI MODIFIED CODE TO CONSIDER CASES WHERE    *CG050622
      *                       WASTE-TAX CALCULATIONS DO NOT POPULATE   *CG050622
      *                       REGULAR INTERNAL TABLES FOR SALES-TAX    *CG050622
      *                       CALCULATIONS.   TAG : CG050622           *CG050622
      * 487990   07/18/05 CGI MODIFIED CODE TO AVOID MODIFYING SALES   *CG050718
      *                       ORDER RECORD. THE SALES ORDER IS BEING   *CG050718
      *                       MODIFIED IN THE CALLING MODULE.          *CG050718
      *                       TAG:CG050718                             *CG050718
      * 2XM231   08/01/05 CGI MODIFIED CODE TO CHANGE THE DEFAULT ZIP- *CG050801
      *                       CODE TO 87124 AND GEO-CODE TO '01' FOR   *CG050801
      *                       TAXABLE CUSTOMERS IN NEW MEXICO TO CHARGE*CG050801
      *                       WITH RIO-RANCHO LOCAL TAX, SANDOVAL      *CG050801
      *                       COUNTY TAX AND NEW MEXICO STATE TAX      *CG050801
      *                       RELAESE: 2XM231  TAG : CG050801          *CG050801
      * 2XM229   08/12/05 CGI MODIFIED CODE TO CALCULATE CITY TIRE-FEE *CG050812
      *                       FOR ELIGIBLE CUSTOMERS.                  *CG050812
      *                       TAG : CG050812                           *CG050812
      * MN794174 09/19/05 CGI MODIFIED CODE TO PASS WASTE TAX EXEMPTION*CG050919
      *                       FLAG TO WASTE TAX CALCULATION MODULE.    *CG050919
      *                       TAG : CG050919                           *CG050919
      * 2XM276   01/24/06 CGI MODIFIED CODE TO PRICE THE ORDER LINE    *CG060124
      *                       FOR AFFILIATE CUSTOMERS USING SHIP DATE. *CG060124
      *                       TICKET: 2XM276    TAG: CG060124          *CG060124
      * 2XM706   07/03/06 CGI MODIFIED CODE TO USE FORM-DATE AS TAX    *CG060703
      *                       DATE FOR 'OT' TRANSACTIONS SIMILAR TO    *CG060703
      *                       'OS' TRANSACTIONS.                       *CG060703
      *                       RELEASE: 2XM706   TAG: CG060703          *CG060703
      * M3709753 08/24/06 CGI COMMENTED CODE TO PREVENT PASSING PRICE  *CG060824
      *                       PARAMETERS FROM ORDER-ENTRY LINES TO THE *CG060824
      *                       PRICING MODULE. THIS HAS BEEN DONE TO    *CG060824
      *                       FORCE THE PRICING MODULE TO EXTRACT THE  *CG060824
      *                       PRICE INFORMATION BASED ON THE DATE      *CG060824
      *                       PASSED TO IT.   TAG : CG060824           *CG060824
      *2IV101206 10/09/06 CGI MODIFIED CODE TO INCLUDE PUERTO RICO FOR *CG061009
      *                       TAX CALCULATIONS                         *CG061009
      *                       TAG : CG061009                           *CG061009
      *M8800070  06/27/07 CGI MODIFIED CODE TO ACCEPT THE DB-KEY       *CG070627
      *                       PROPERLY FROM THE RECORD COE-PLT-CONTROL.*CG070627
      *                       TAG : CG070627                           *CG070627
      *XM358     09/14/07 CGI MODIFIED CODE TO REMOVE THE DISCOUNT     *CG070914
      *                       'SPCFRT' AT THE TIME OF INVOICING,WHEN   *CG070914
      *                       ORDERS ARE SHIPPED VIA 'LTL' OR 'TL'.    *CG070914
      *                       TAG : CG070914                           *CG070914
      *IV780     09/21/07 CGI MODIFIED CODE TO PASS THE ZIP CODE TO THE*CG070921
      *                       TAX CALCULATION MODULE SABGP310 AS       *CG070921
      *                       1. 91761 IF THE TIRES ARE SHIPPED FROM   *CG070921
      *                          U06 ONTARIO DC TO A TAXABLE CUSTOMER  *CG070921
      *                          CALIFORNIA.                           *CG070921
      *                       2. 92374 IF THE TIRES ARE SHIPPED FROM   *CG070921
      *                          U11 REDLANDS DC TO A TAXABLE CUSTOMER *CG070921
      *                          CALIFORNIA.                           *CG070921
      *                       TAG : CG070921                           *CG070921
      *19354522  09/20/04 CGI MODIFIED CODE TO INITIALIZE SECONDARY    *CG090420
      *                       COUNTY CODE BEFORE CALLING TAX MODULE.   *CG090420
      *                       TAG : CG090420                           *CG090420
      *20535941  06/24/09 CGI MODIFIED CODE TO MATCH THE LOGIC OF      *CG090624
      *                       PROVINCE CODE VALIDATION WITH SABGP080   *CG090624
      *                       TAG : CG090624                           *CG090624
      *6IV270    20/05/10 CGI CODE MODIFIED TO CALCULATE HST FOR THE   *CG100520
      *ER. NO.   NAMSP-1172   INVOICES BELONGING TO ONTARIO (ON) AND   *CG100520
      *BR  NO.   NAMSP-1017   BRITISH COLUMBIA (BC).                   *CG100520
      *                       TAGGED AS CG100520.                      *CG100520
      *26115905  06/30/10 CGI MODIFIED CODE TO PASS THE LOCAL NAME     *CG100630
      *                       TO THE TAXWARE MODULE INORDER TO RETREIVE*CG100630
      *                       THE ACTUAL TAX RATES INSTEAD OF DEFAULT  *CG100630
      *                       TAX RATES. TAG : CG100630                *CG100630
      *8IV030    30/06/10 CGI CODE MODIFIED TO PASS THE COUNTY CODE    *CG100715
      *                       VALUE FROM THE ADDRESS RECORD TO THE     *CG100715
      *                       TAX CALCULATION MODULE (SABGP310) BASED  *CG100715
      *                       ON TAX-USING-IND VALUE FOR COUNTY TAX    *CG100715
      *                       CALCULATION.TAGGED AS CG100715.          *CG100715
      *TICKET#   17/09/10 CGI CODE MODIFIED AS PART OF TICKET CHANGES  *CG100917
      *27101073           CGI TAGGING DONE AS CG100917                 *CG100917
      *6IV660   08/23/12 CGI  MODIFIED CODE NOT TO CHANGE THE DEFAULT  *CG120823
      *                       ZIP-CODE TO 87124 AND GEO-CODE TO '01'   *CG120823
      *                       FOR TAXABLE CUSTOMERS IN NEW MEXICO IF   *CG120823
      *                       THE SHIPMENT IS FROM OUTSIDE NEW MEXICO  *CG120823
      *                       BR-NAMSP-2777 ER-NAMSP-2693              *CG120823
      * 15AUG13 NAMSP-3266 CGI   CODE MODIFIED TO FIX THE LINKAGE SECTI*CG130815
      *           6IV760         -ON FOR THE SABGP011 CALL.             CG130815
      *                          CHANGES ARE TAGGED TO - CG130815.      CG130815
      *8OR760    09/07/17 CGI ADDED NEW DATA ELEMNETS FOR WHEEL        *CG170910
      *                       POSITION. TAGGED AS CG170910             *CG170910
      *EVGN-2678    CGI         CODE MODIFIED TO IMPLEMENT COLORADO    *CG220726
      *                         DELIVERY FEES.                         *CG220726
      *                         TAG: CG220726                          *CG220726
      *EVGN-4794    CGI         CODE MODIFIED TO PREVENT NEGATIVE AMT  *CG240501
      *                         CREATION FOR DEBIT.                    *CG240501
      *                         TAG: CG240501                          *CG240501
      *EVGN-4871    CGI         CODE MODIFIED NOT TO CALCULATE DISCOUNT*CG240531
      *                         CHARGES FOR SPECIAL DISCOUNT ADDED FOR *CG240531
      *                         MANAGING PRICE IN FOP                  *CG240531
      *                         TAG: CG240531                          *CG240531
      ******************************************************************        
      *                                                                         
      *         CHANGES TO THIS PROGRAM MUST BE COORDINATED WITH                
      *                         SABGP080                                        
      *                                                                         
      ******************************************************************        
                                                                                
       ENVIRONMENT DIVISION.                                                    
       INPUT-OUTPUT SECTION.                                                    
       FILE-CONTROL.                                                            
       IDMS-CONTROL SECTION.                                                    
       PROTOCOL. MODE IS IDMS-DC DEBUG                                          
                 IDMS-RECORDS MANUAL.                                           
       DATA DIVISION.                                                           
       SCHEMA SECTION.                                                          
       DB SSBGU008 WITHIN CASSCHEM.                                     CG100715
       FILE SECTION.                                                            
       EJECT                                                                    
       WORKING-STORAGE SECTION.                                                 
       01  FILLER  PIC X(32)                                            CG030806
                   VALUE 'SABGP380 : START WORKING STORAGE'.            CG030806
                                                                        CG030806
       01  Y2K-WK-CUTOFF-YR-X               PIC X(2) VALUE '60'.                
      *                                                                         
       01  Y2K-WK-DATE1-X.                                                      
           05  Y2K-WK-DATE1-X-CC            PIC X(2).                           
           05  Y2K-WK-DATE1-X-YYMMDD        PIC X(6).                           
           05  Y2K-WK-DATE1R-X-YYMMDD REDEFINES Y2K-WK-DATE1-X-YYMMDD.          
               10  Y2K-WK-DATE1R-X-YY       PIC X(2).                           
               10  Y2K-WK-DATE1R-X-MM       PIC X(2).                           
               10  Y2K-WK-DATE1R-X-DD       PIC X(2).                           
      *                                                                         
       01  Y2K-WK-DATE2-X.                                                      
           05  Y2K-WK-DATE2-X-CC            PIC X(2).                           
           05  Y2K-WK-DATE2-X-YYMMDD        PIC X(6).                           
           05  Y2K-WK-DATE2R-X-YYMMDD REDEFINES Y2K-WK-DATE2-X-YYMMDD.          
               10  Y2K-WK-DATE2R-X-YY       PIC X(2).                           
               10  Y2K-WK-DATE2R-X-MM       PIC X(2).                           
               10  Y2K-WK-DATE2R-X-DD       PIC X(2).                           
      *                                                                         
       01  PREV-PROGRAM-NAME         PIC X(8)    VALUE SPACES.          NEWPGM  
                                                                        NEWPGM  
       01  WS-WORK-AREA.                                                        
           05 WS-DROP-TO-ST-COUNTY     PIC X(03) VALUE SPACES.          CG100715
           05  WS-KIND-OF-TRANSACTION                                   CG100715
                                       PIC X(01) VALUE SPACES.          CG100715
               88  SPECIAL-TRANSACTION                                  CG100715
                                              VALUE 'S'.                CG100715
               88  NORMAL-TRANSACTION                                   CG100715
                                              VALUE 'N'.                CG100715
           05  WS-ORIG-INV-NBR.                                         CG100715
               10  WS-ORIG-PREFIX      PIC X(02) VALUE SPACES.          CG100715
               10  FILLER              PIC X(10) VALUE SPACES.          CG100715
           05  WS-NEW-ORD-NBR.                                          CG100917
               10  WS-NEW-PREFIX       PIC X(01) VALUE SPACES.          CG100917
               10  FILLER              PIC X(08) VALUE SPACES.          CG100917
           05  WS-TEXT-KEY             PIC X(28) VALUE SPACES.          CG100917
           05  WS-TEXT-HEADER.                                          CG100715
               10  WS-TEXT-TAX-USING   PIC X(01) VALUE SPACES.          CG100715
               10  WS-TEXT-STATE-CODE                                   CG100715
                                       PIC X(02) VALUE SPACES.          CG100715
               10  WS-TEXT-COUNTY-CODE                                  CG100715
                                       PIC X(03) VALUE SPACES.          CG100715
               10  WS-TEXT-ZIP-CODE    PIC X(09) VALUE SPACES.          CG100715
               10  WS-TEXT-USER-ST     PIC X(10) VALUE SPACES.          CG100715
               10  WS-TEXT-DLR-ST      PIC X(10) VALUE SPACES.          CG100715
               10  WS-TEXT-TRANS-TYPE                                   CG100715
                                       PIC X(02) VALUE SPACES.          CG100715
               10 WS-TEXT-ST-CHANGE-FLAG                                CG100715
                                       PIC X(01) VALUE SPACES.          CG100715
               10 WS-TEXT-NEW-SHP-TO   PIC X(10) VALUE SPACES.          CG100715
           05  ABORT-RC                   PIC S9(4) COMP                CG050812
                                                    VALUE ZEROS.        CG050812
           05 WS-JCL-LINE                 PIC X(80) VALUE SPACES.       CG020821
           05 WS-END-OF-JCL               PIC X(01) VALUE 'N'.                  
              88 END-OF-JCL                         VALUE 'Y'.                  
           05  WS-CALC-DELIVERY-FEE        PIC X   VALUE 'N'.           CG220726
              88 DO-NOT-CALC-DELIVERY-FEE          VALUE 'N'.           CG220726
              88 CALCULATE-DELIVERY-FEE            VALUE 'Y'.           CG220726
           05  WK-COUNTRY.                                                      
               10  WK-COUNTRY-1ST-2BYTES      PIC X(02) VALUE SPACES.           
               10  FILLER                     PIC X(18) VALUE SPACES.           
           05  WK-FORM-DATE.                                                    
               10  FILLER                     PIC X(02) VALUE SPACES.           
               10  WK-FORM-DATE-LAST6         PIC X(06) VALUE SPACES.           
           05  WK-FET-DATE.                                               52845 
               10  WK-FET-CN                  PIC X(02) VALUE SPACES.     52845 
               10  WK-FET-YMD                 PIC X(06) VALUE SPACES.     52845 
           05  WK-CUST-NBR.                                                     
               10  WK-CUST-COUNTRY            PIC X(01) VALUE SPACES.           
                   88  USA-CUSTOMER                     VALUE '1'.        CANTAX
                   88  CANADIAN-CUSTOMER                VALUE '0'.        CANTAX
                   88  HOUSTON-CUSTOMER                 VALUE '9'.        CANTAX
               10  FILLER                     PIC X(09) VALUE SPACES.           
           05  WK-CITY-TAX-EXEMPT-IND         PIC X     VALUE 'N'.      CG050812
           05  WK-CITY                        PIC X(20) VALUE SPACES.   CG050812
           05  AVP-STATE-NOT-FOUND-SW         PIC X(01) VALUE 'N'.              
               88  AVP-STATE-NOT-FOUND                  VALUE 'Y'.              
           05  SUB1                           PIC 9     VALUE ZEROS.    SDMUD866
           05  WS-SUB                         PIC 9(02) VALUE ZEROS.    CG050119
           05  WS-HST-CUST                    PIC X(01) VALUE 'N'.      C03338  
           05  WS-GST-HST                     PIC X(01) VALUE 'N'.      C03338  
           05  WS-HST-CUSTOMER                PIC X(01) VALUE 'N'.      C03338  
           05  WS-REGROUP-CUST                PIC X     VALUE 'N'.      C02062  
               88  REGROUP-CUSTOMER                     VALUE 'Y'.      C02062  
           05  WS-EDIT-CODE            PIC 9(2)V9(2) VALUE ZEROS.       C00003  
           05  WS-EDIT-CODE-ALPH       PIC 99.99     VALUE ZEROS.       C00003  
           05  WS-SEAT-DESC            PIC 9(3)      VALUE ZEROS.       C00003  
           05  FET-CALC-IND                   PIC X     VALUE SPACES.   MKTEXCIS
               88  FET-CALCULATED                       VALUE 'Y'.      MKTEXCIS
           05  WK-COE-PLT-CNTL-DBKEY  PIC S9(08)      VALUE ZERO        CG050119
                                      USAGE COMP.                       CG050119
           05  WS-CONV-DTLS.                                            CG050602
               10  WS-CONVERT             PIC X(01)      VALUE 'N'.     CG050602
               10  WS-CURR-FACTOR         PIC S9(07)V9(08).             CG050602
               10  FILLER                 PIC X(100).                   CG050602
           05  WS-UNIT-PRICE          PIC S9(09)V9(02).                 CG050613
           05  WS-1-BYTE              PIC X(01)      VALUE SPACES.      CG050602
           05  WS-DATE.                                                 CG050602
               10 WS-CC               PIC X(02)      VALUE '20'.        CG050602
               10 WS-YYMM             PIC X(04)      VALUE SPACES.      CG050602
               10 WS-DD               PIC X(02)      VALUE '01'.        CG050602
           05  WS-SALES-TAX-AMT       PIC S9(11)V99  COMP-3                     
                                                     VALUE ZEROS.               
           05  WS-DELIVERY-FEE-LC-TAX PIC S9(11)V99  COMP-3             CG220726
                                                     VALUE ZEROS.       CG220726
           05  WS-SALES-ORD-AMT       PIC S9(13)V99  COMP-3             CG050718
                                                     VALUE ZEROS.       CG050718
           05  WS-QC-TAXDATE          PIC X(6)    VALUE SPACES.         IM980324
           05  WS-MRT-PRODUCT         PIC X(01)   VALUE SPACES.         CG020801
           05  WS-MTP-PRODUCT         PIC X(01)   VALUE SPACES.         CG020801
           05  WS-INSTANT-PRINT       PIC X(01)   VALUE SPACES.         CG020801
           05  WS-QC-WASTE-TAX-DATE   PIC X(6)    VALUE SPACES.         IM991124
           05  WS-CURRENT-DATE-TIME.                                    IM990707
               10 WS-CURRENT-DATE-CCYYMMDD.                             IM990707
                  15 WS-CURRENT-DATE-CC      PIC X(02) VALUE SPACES.    IM990707
                  15 WS-CURRENT-DATE-YYMMDD  PIC X(06) VALUE SPACES.    IM990707
               10 WS-CURRENT-TIME            PIC X(06) VALUE SPACES.    IM990707
           05  WS-SHIP-DATE-PRICE            PIC X(01) VALUE SPACES.    CG060124
           05  WS-CAI-PRICE-LIST.                                       CG060124
               10 WS-CAI-AFFIL-PRICE-GROUP   PIC X(06) VALUE SPACES.    CG060124
               10 FILLER                     PIC X(04) VALUE SPACES.    CG060124
           05  WS-CUSTOMER-DBKEY             PIC S9(08) VALUE ZERO      CG060124
                                                       USAGE COMP.      CG060124
           05 WS-ORG-ID                    PIC X(03) VALUE SPACES.      CG071204
              88  OLIVER-CUSTOMER VALUES 'OLU' 'OLC' 'OLF' 'OLN'.       CG071204
                                                                        CG071204
       01  COEDUIV0-WORK9-RECORD.                                       CG071204
           05  WK9-ORDER-NUMBER             PIC X(09).                  CG071204
           05  WK9-SHIPMENT-NUMBER          PIC 9(03).                  CG071204
           05  WK9-INVOICE-NUMBER           PIC X(12).                  CG071204
           05  WK9-ORDER-TYPE               PIC X(01).                  CG071204
           05  WK9-RECEIVABLE-ITEM-TYPE     PIC X(01).                  CG071204
           05  WK9-CURRENT-DATE-TIME.                                   CG071204
               10  WK9-CURRENT-DATE         PIC X(08).                  CG071204
               10  WK9-CURRENT-TIME         PIC X(06).                  CG071204
           05  FILLER                       PIC X(02).                  CG071204
           05  WK9-USER-ID                  PIC X(08).                  CG071204
           05  WK9-WICS-FLAG                PIC X(01).                  CG071204
                                                                                
       01  WS-HST-CALCULATE-VARIABLES.                                  CG100520
           05  WS-CONV-DATE-SHIPPED-YYMMDD                              CG100520
                                       PIC 9(06) VALUE ZEROES.          CG100520
           05  WS-REFERENCE-DATE       PIC 9(08) VALUE ZEROES.          CG100520
           05  WS-CHECK-BYTE           PIC X(01) VALUE SPACES.          CG100520
           05  WS-COMPARE-DATE         PIC 9(08) VALUE ZEROES.          CG100520
           05  WS-NO-OF-DAYS           PIC S9(05) VALUE ZEROES.         CG100520
           05  WS-CALC-HST-FLAG        PIC X(01) VALUE 'N'.             CG100520
               88 WS-PROVINCE-ELIGIBILE-FOR-HST  VALUE 'Y'.             CG100520
       01  WORK-FIELDS.                                                 C00889  
           05  WK-ERROR-STATUS         PIC X(5).                        C00889  
           05  WK-ERROR-REC            PIC X(17).                       C00889  
           05  WK-ERROR-AREA           PIC X(17).                       C00889  
           05  WK-ERROR-SET-NAME       PIC X(17).                       C00889  
           05  WK-ERROR-REC-NAME       PIC X(17).                       C00889  
           05  WK-ERROR-AREA-NAME      PIC X(17).                       C00889  
           05  WK-ERROR-PGM-NAME       PIC X(18).                       C00889  
           05  WK-ERROR-DML-SEQ        PIC X(5).                        C00889  
           05  WK-ERROR-DB-NAME        PIC X(10).                       C00889  
           05  WK-COUNT-DIS            PIC 9(01) VALUE ZEROS.           CG070914
           05  WK-SPCL-COUNT           PIC 9(01) VALUE ZEROS.           CG240531
      ******************************************************************        
       COPY IDMS RECORD AOBGW004.                                               
       COPY IDMS RECORD WASTE-TAX-RECORD.                               CG050919
       COPY IDMS RECORD MISC-HDR-CHARGE.                                CG220726
       COPY IDMS RECORD AOBGD135-WORK1-RECORD.                          IM990707
       COPY IDMS RECORD COEDUIV0-WORKM-RECORD.                                  
      *COPY IDMS RECORD COEDUIV0-WORK9-RECORD.        CG071204                  
       COPY IDMS RECORD COEDUIV1-WORK-RECORD.                                   
       COPY IDMS RECORD APPLICATION-REFERENCE-RECORD.                           
       COPY IDMS RECORD CAS-NUMBER-RECORD.                                      
       COPY IDMS RECORD CARPRIDB-WORK-RECORD.                                   
       COPY IDMS RECORD CARPRIDB-WORK1-RECORD.                                  
       COPY IDMS RECORD CASPUOM0-CONVERSION-RECORD.                             
       COPY IDMS RECORD AVP-TAX-RECORD.                                         
       COPY IDMS RECORD AVP-TAXSEL-PARAMETERS.                                  
       COPY IDMS RECORD AVP-TAXJURIS-PARAMETERS.                                
       COPY IDMS RECORD ADDRSS-OPTION-WORK-RECORD                               
       COPY IDMS RECORD ORDER-HEADER-WORK-RECORD                                
       COPY IDMS RECORD AR-INVOICE-HDR-WORK-RECORD                              
       COPY IDMS RECORD CAS-SYSTEM-RECORD.                                      
       COPY IDMS RECORD ADSO-APPLICATION-GLOBAL-RECORD.                         
       EJECT                                                                    
       COPY IDMS SUBSCHEMA-NAMES.                                               
       EJECT                                                                    
       COPY IDMS RECORD ADDRSS-OPTION.                                          
       COPY IDMS RECORD AR-DEFINITION.                                          
       COPY IDMS RECORD AR-DISTRIBUTION.                                        
       COPY IDMS RECORD AR-GROUP.                                               
       COPY IDMS RECORD AR-INV-BATCH.                                           
       COPY IDMS RECORD AR-INVOICE-ITEM.                                        
       COPY IDMS RECORD AR-ORG.                                                 
       COPY IDMS RECORD AVP-PROV-ZIP.                                           
       COPY IDMS RECORD AVP-STATE-CODE.                                         
       COPY IDMS RECORD CAR-AUDIT.                                              
       COPY IDMS RECORD DISCOUNT.                                               
       COPY IDMS RECORD FED-EXCISE-TAX.                                 MKTEXCIS
       COPY IDMS RECORD INVXREF-INVOICE.                                        
       COPY IDMS RECORD MISC-ITEM-CHARGE.                                       
       COPY IDMS RECORD MULT-DISCOUNTS.                                         
       COPY IDMS RECORD ORG-ID.                                                 
       COPY IDMS RECORD PRODUCT-CODE.                                           
       COPY IDMS RECORD REASON-CODE.                                            
       COPY IDMS RECORD RECEIVABLE-ITEM.                                        
       COPY IDMS RECORD RI-NEST.                                                
       COPY IDMS RECORD STANDARD-ACCOUNT.                                       
       COPY IDMS RECORD TAX.                                                    
       COPY IDMS RECORD TAX-AUDIT.                                              
       COPY IDMS RECORD TAX-EXEMPTION.                                          
       COPY IDMS RECORD WASTE-TAX.                                              
       COPY IDMS RECORD WASTE-TAX-CUST.                                         
       COPY IDMS RECORD WASTE-TAX-HDR.                                          
       COPY IDMS RECORD WASTE-TAX-PROD.                                         
       COPY IDMS RECORD INVEXT-HEADER.                                  CG100715
       COPY IDMS RECORD INVEXT-LINE.                                    CG100715
       01  WS-DATE-CARD.                                                        
           05  SYSTEM-RUN-DATE       PIC X(6).                                  
       01  IDMS-TIME                 PIC X(6).                                  
       COPY IDMS RECORD WBSB-INVOICE-HDR.                               C02104  
       COPY IDMS RECORD WBSB-CORR-MASTER.                               C02104  
       COPY IDMS RECORD INVXREF-RGRP.                                           
       COPY IDMS RECORD CUSTEXT.                                        CG021029
       COPY IDMS RECORD SAPIP200-PARM-RECORD.                           CG050119
       COPY IDMS RECORD SAPIP200-PRICE-RECORD.                          CG050119
       EJECT                                                                    
       01  FILLER  PIC X(32)                                            CG030806
                   VALUE 'SABGP380 :END OF WORKING STORAGE'.            CG030806
                                                                                
      *************************************************                         
      *  L  I  N  K  A  G  E      S  E  C  T  I  O  N                           
      *************************************************                         
                                                                                
       LINKAGE SECTION.                                                         
       COPY IDMS SUBSCHEMA-CTRL.                                                
       COPY IDMS RECORD AOBGW380.                                       P84943  
       COPY IDMS RECORD ADDRSS.                                                 
       COPY IDMS RECORD ADDRSS-ID.                                              
       COPY IDMS RECORD AR-INVOICE-HDR.                                         
       COPY IDMS RECORD BUSINESS.                                               
       COPY IDMS RECORD CAS-DEFINITION.                                         
       COPY IDMS RECORD COE-DEFINITION.                                         
       COPY IDMS RECORD COE-PLT-CONTROL.                                        
       COPY IDMS RECORD CUSTOMER.                                               
       COPY IDMS RECORD CUSTOMER-TERMS.                                         
       COPY IDMS RECORD DISC-BY-REMISE.                                         
       COPY IDMS RECORD LOAD.                                           SDUUD111
       COPY IDMS RECORD MESSAGE-DATA.                                           
       COPY IDMS RECORD MESSAGE-TYPE.                                           
       COPY IDMS RECORD MKT-PART.                                               
       COPY IDMS RECORD MKT-PLANT.                                              
       COPY IDMS RECORD NUMBER-MASK.                                            
       COPY IDMS RECORD ORDER-HEADER.                                           
       COPY IDMS RECORD PREFIX-MASK.                                            
       COPY IDMS RECORD SALES-ORDER.                                            
       COPY IDMS RECORD SALES-ORDER-LINE.                                       
       COPY IDMS RECORD SHIPMENT-HEADER.                                        
       COPY IDMS RECORD SHIPMENT-LINE.                                          
       COPY IDMS RECORD SOHEXT.                                                 
       COPY IDMS RECORD SOLEXT.                                         P70878  
       COPY IDMS RECORD SO-LINE-SCHEDULE.                               SDUUD111
       COPY IDMS RECORD STBDNAR.                                        C00003  
       COPY IDMS RECORD TEXT-HEADER.                                    RGRPENH 
       COPY IDMS RECORD TEXT-LINE.                                      RGRPENH 
       COPY IDMS RECORD UOM-FACTOR.                                             
       COPY IDMS RECORD UOM-OOAK.                                               
       COPY IDMS RECORD VALID-UOM.                                              
       COPY IDMS RECORD TABLE-HDR.                                      CG031118
       COPY IDMS RECORD TABLE-DETAIL.                                   CG031118
       COPY IDMS RECORD MKT-PART-PRICE.                                 CG050119
       COPY IDMS RECORD MKT-PART-JOINT.                                 CG050119
       COPY IDMS RECORD MKT-PLANT-PRICE.                                CG050119
       COPY IDMS RECORD MKT-PLANT-JOINT.                                CG050119
       COPY IDMS RECORD PRICE-TABLE.                                    CG050119
       COPY IDMS RECORD PRICE-EFFECTIVE.                                CG050119
       COPY IDMS RECORD PRICE-FACTOR.                                   CG050119
       COPY IDMS RECORD PRICE-DEFINITION.                               CG050119
       COPY IDMS RECORD PLANT-MASTER.                                   CG050119
       COPY IDMS RECORD BASE-PRICE-HSTRY.                               CG050119
       COPY IDMS RECORD CURRENCY-CONV.                                  CG050119
       COPY IDMS RECORD CURRENCY-FACTOR.                                CG050119
       COPY IDMS RECORD CUSTOMER-OPTION.                                CG050119
       COPY IDMS RECORD COEDUIV0-WORK3-RECORD.                                  
                                                                                
       EJECT                                                                    
                                                                                
       PROCEDURE DIVISION USING SUBSCHEMA-CTRL                                  
                                AOBGW380                                P84943  
                                ADDRSS                                          
                                ADDRSS-ID                                       
                                AR-INVOICE-HDR                                  
                                BUSINESS                                        
                                CAS-DEFINITION                                  
                                COE-DEFINITION                                  
                                COE-PLT-CONTROL                                 
                                CUSTOMER                                        
                                CUSTOMER-TERMS                                  
                                DISC-BY-REMISE                                  
                                LOAD                                    SDUUD111
                                MESSAGE-DATA                                    
                                MESSAGE-TYPE                                    
                                MKT-PART                                        
                                MKT-PLANT                                       
                                NUMBER-MASK                                     
                                ORDER-HEADER                                    
                                PREFIX-MASK                                     
                                SALES-ORDER                                     
                                SALES-ORDER-LINE                                
                                SHIPMENT-HEADER                                 
                                SHIPMENT-LINE                                   
                                SOHEXT                                          
                                SOLEXT                                  P70878  
                                SO-LINE-SCHEDULE                        SDUUD111
                                STBDNAR                                 C00003  
                                TEXT-HEADER                                     
                                TEXT-LINE                                       
                                UOM-FACTOR                                      
                                UOM-OOAK                                        
                                VALID-UOM                                       
                                TABLE-HDR                               CG031118
                                TABLE-DETAIL                            CG031118
                                MKT-PART-PRICE                          CG050119
                                MKT-PART-JOINT                          CG050119
                                MKT-PLANT-PRICE                         CG050119
                                MKT-PLANT-JOINT                         CG050119
                                PRICE-TABLE                             CG050119
                                PRICE-EFFECTIVE                         CG050119
                                PRICE-FACTOR                            CG050119
                                PRICE-DEFINITION                        CG050119
                                PLANT-MASTER                            CG050119
                                BASE-PRICE-HSTRY                        CG050119
                                CURRENCY-CONV                           CG050119
                                CURRENCY-FACTOR                         CG050119
                                CUSTOMER-OPTION                         CG050119
                                COEDUIV0-WORK3-RECORD.                          
                                                                                
                                                                                
       0000-MAINLINE.                                                           
                                                                                
      ******************************************************************        
      * WK3-DB-KEY CONTAINS DB KEYS FOR PARTICULAR DATABASES AS FOLLOWS:        
      *  OCCURANCE 1: UNKNOWN         OCCURANCE 6: RECEIVABLE-ITEM              
      *  OCCURANCE 2: SHIPMENT HDR    OCCURANCE 7: SHIP TO CUSTOMER             
      *  OCCURANCE 3: AR-INVOICE-HDR  OCCURANCE 8: SHIPMENT LINE                
      *  OCCURANCE 4: AR-INVOICE-ITEM OCCURANCE 9: UNKNOWN                      
      *  OCCURANCE 5: BILL TO CUST    OCCURANCE 10: UNKNOWN                     
      ******************************************************************        
      * WK-DB-KEY CONTAINS DB KEY FOR BILL-TO OR SHIP-TO CUSTOMER               
      *  - WHICHEVER CUSTOMER WAS CHOSEN FOR TAX EXEMPTION PROCESSING.          
      ******************************************************************        
                                                                                
           MOVE PROGRAM-NAME           TO PREV-PROGRAM-NAME.            NEWPGM  
           MOVE 'SABGP380'             TO PROGRAM-NAME.                 NEWPGM  
           MOVE SPACES     TO WS-MRT-PRODUCT.                           CG020801
           MOVE SPACES     TO WS-MTP-PRODUCT.                           CG020821
           MOVE SPACES     TO WS-INSTANT-PRINT.                         CG020821
           MOVE SPACES     TO WS-ORG-ID.                                CG071204
                                                                        NEWPGM  
           PERFORM HSEKPG01.                                                    
                                                                                
           PERFORM ADDHDR10.                                                    
                                                                        PASSERR 
      *    FOR PCV6 PROMOTIONS SABGP390 SHOULD BE EXECUTED.                     
      *    FOR TCV8/CCV5 DEVELOPMENT DICTIONARIES SABGX390 SHOULD BE            
      *    EXECUTED.                                                            
                                                                                
           IF STATUS-CODE-W380 = '00'                                   P84943  
           TRANSFER 'SABGP390' LINK USING                                       
                                    SUBSCHEMA-CTRL                              
                                    AOBGW380                            P84943  
                                    AR-DEFINITION                               
                                    AR-DISTRIBUTION                             
                                    AR-GROUP                                    
                                    AR-INV-BATCH                                
                                    AR-INVOICE-HDR                              
                                    AR-INVOICE-ITEM                             
                                    AR-ORG                                      
                                    INVXREF-RGRP                        IM000112
                                    INVXREF-INVOICE                     IM000112
                                    MESSAGE-TYPE                        IM000112
                                    MESSAGE-DATA                        IM000112
                                    LOAD                                IM000112
                                    BUSINESS                                    
                                    CAR-AUDIT                                   
                                    COE-DEFINITION                              
                                    CUSTOMER                                    
                                    CUSTOMER-TERMS                              
                                    DISCOUNT                                    
                                    MULT-DISCOUNTS                              
                                    NUMBER-MASK                                 
                                    ORG-ID                                      
                                    PREFIX-MASK                                 
                                    PRODUCT-CODE                                
                                    REASON-CODE                                 
                                    RECEIVABLE-ITEM                             
                                    RI-NEST                                     
                                    SALES-ORDER                                 
                                    SHIPMENT-HEADER                             
                                    TAX                                         
                                    TAX-AUDIT                                   
                                    TAX-EXEMPTION                               
                                    WS-DATE-CARD                                
                                    IDMS-TIME                                   
                                    COEDUIV0-WORK3-RECORD                       
                                    COEDUIV1-WORK-RECORD                        
                                    SOHEXT                                      
                                    AVP-TAX-RECORD                              
                                    AVP-TAXSEL-PARAMETERS                       
                                    AVP-TAXJURIS-PARAMETERS                     
                                    WS-SALES-TAX-AMT                            
                                    WBSB-INVOICE-HDR                    C02104  
                                    WBSB-CORR-MASTER                    C02104  
                                    TABLE-HDR                           CG040105
                                    TABLE-DETAIL                        CG040105
                                    SALES-ORDER-LINE                    CG040318
                                    WS-CONV-DTLS                        CG220726
                                    WS-DELIVERY-FEE-LC-TAX.             CG220726
                                                                                
           IF (USA-CUSTOMER OR CANADIAN-CUSTOMER)                       IM990707
              AND RECEIVABLE-ITEM-STATUS-2700 = 'P'                     IM990707
              INITIALIZE MESSAGE-DATA                                   IM990707
              MOVE 'BGRI'              TO MESSAGE-TYPE-931              IM990707
              FIND CALC MESSAGE-TYPE                                    CG020821
                ON DB-REC-NOT-FOUND                                     IM990707
                  CONTINUE                                              IM990707
                END-IF                                                  IM990707
              IF DB-REC-NOT-FOUND                                       IM990707
                 STORE MESSAGE-TYPE                                     IM990707
              END-IF                                                    IM990707
              MOVE RECEIVABLE-ITEM-NUMBER-2712                          IM990707
                                       TO WK1-RECEIVABLE-ITEM-NUMBER    IM990707
              MOVE INVOICE-AMT-2712    TO WK1-INVOICE-AMT               IM990707
              MOVE SHIP-TO-BUSINESS-2712                                IM990707
                                       TO WK1-SHIP-TO-BUSINESS          IM990707
              MOVE CUSTOMER-NUMBER-2712                                 IM990707
                                       TO WK1-BILL-TO-BUSINESS          IM990707
              MOVE ORDER-NUMBER-2700   TO WK1-ORDER-NUMBER              IM990707
              MOVE RECEIVABLE-ITEM-TYPE-2700                            IM990707
                                       TO WK1-RECEIVABLE-ITEM-TYPE      IM990707
              MOVE WS-CURRENT-DATE-CCYYMMDD                                     
                                       TO WK1-DATE-TODAY                IM990707
              MOVE WS-CURRENT-TIME     TO WK1-TIME-ENTERED              IM990707
              MOVE 'SABGP380'          TO WK1-USER-ID,                  IM990707
                                          WK1-RESPONSE-NAME             IM990707
              MOVE AOBGD135-WORK1-RECORD                                IM990707
                                       TO MESSAGE-932                   IM990707
              MOVE WS-CURRENT-DATE-YYMMDD                               IM990707
                                       TO DATE-932                      IM990707
              MOVE WS-CURRENT-TIME     TO TIME-HMS-932                  IM990707
              STORE MESSAGE-DATA                                        IM990707
           END-IF.                                                      IM990707
                                                                                
      ******************************************************************CG020821
      * NOW THAT THE INVOICE STRUCTURE RECORDS HAVE BEEN SUCCESSFULLY   CG020821
      * STORED, CALL THE APPROPRIATE JOBS (US, CA OR HX) TO PROCESS AND CG020821
      * PRINT THE MTP INVOICES. JOBS WILL BE INVOKED IF ANY OF THE MSPNSCG020821
      * ON THE INVOICE IS AN MTP PRODUCT.                               CG020821
      ******************************************************************CG020821
      *-   IF (WS-MTP-PRODUCT = 'Y')   AND                              CG020821
      *-      (WS-INSTANT-PRINT = 'Y') AND                              CG020821
      *-      (PREV-PROGRAM-NAME = 'DNWMX820' OR 'DNWMX830')            CG020821
      *-      PERFORM 3000-WRITE-JCL   THRU 3000-EXIT                   CG020821
      *-   END-IF.                                                      CG020821
                                                                                
           SET DB-STATUS-OK            TO TRUE.                         NEWPGM  
           MOVE PREV-PROGRAM-NAME      TO PROGRAM-NAME.                 NEWPGM  
                                                                        NEWPGM  
           GOBACK.                                                              
                                                                                
       EJECT                                                                    
       HSEKPG01             SECTION.                                            
      ******************************************************************        
      * HSEKPG01 - HOUSEKEEPING                                        *        
      * INITIALIZE.  BIND ALL RECORDS NOT BOUND IN CALLING PROGRAM.    *        
      ******************************************************************        
                                                                                
           INITIALIZE WS-WORK-AREA.                                       INIT  
           INITIALIZE AOBGW004.                                           INIT  
           INITIALIZE AOBGD135-WORK1-RECORD.                            IM990707
           INITIALIZE COEDUIV0-WORKM-RECORD.                              INIT  
           INITIALIZE COEDUIV0-WORK9-RECORD.                              INIT  
           INITIALIZE COEDUIV1-WORK-RECORD.                               INIT  
           INITIALIZE APPLICATION-REFERENCE-RECORD.                       INIT  
           INITIALIZE CAS-NUMBER-RECORD.                                  INIT  
           INITIALIZE CARPRIDB-WORK-RECORD.                               INIT  
           INITIALIZE CARPRIDB-WORK1-RECORD.                              INIT  
           INITIALIZE CASPUOM0-CONVERSION-RECORD.                         INIT  
           INITIALIZE AVP-TAX-RECORD.                                     INIT  
           INITIALIZE AVP-TAXSEL-PARAMETERS.                              INIT  
           INITIALIZE AVP-TAXJURIS-PARAMETERS.                            INIT  
           INITIALIZE ADDRSS-OPTION-WORK-RECORD.                          INIT  
           INITIALIZE ORDER-HEADER-WORK-RECORD.                           INIT  
           INITIALIZE AR-INVOICE-HDR-WORK-RECORD.                         INIT  
           INITIALIZE AOBGW380.                                         P84943  
                                                                                
           BIND ADDRSS-OPTION.                                                  
           BIND AR-DEFINITION.                                                  
           BIND AR-DISTRIBUTION.                                                
           BIND AR-GROUP.                                                       
           BIND AR-INV-BATCH.                                                   
           BIND AR-INVOICE-ITEM.                                                
           BIND AR-ORG.                                                         
           BIND AVP-PROV-ZIP.                                                   
           BIND AVP-STATE-CODE.                                                 
           BIND CAR-AUDIT.                                                      
           BIND DISCOUNT.                                                       
           BIND FED-EXCISE-TAX.                                             MKTE
           BIND INVXREF-INVOICE.                                                
           BIND INVXREF-RGRP.                                           IM000112
           BIND MISC-ITEM-CHARGE.                                       C02385  
           BIND MULT-DISCOUNTS.                                                 
           BIND CUSTEXT.                                                CG020821
           BIND ORG-ID.                                                         
           BIND REASON-CODE.                                                    
           BIND RECEIVABLE-ITEM.                                                
           BIND RI-NEST.                                                        
           BIND STANDARD-ACCOUNT.                                               
           BIND TAX.                                                            
           BIND TAX-AUDIT.                                                      
           BIND TAX-EXEMPTION.                                                  
           BIND WBSB-INVOICE-HDR.                                       C02104  
           BIND WBSB-CORR-MASTER.                                       C02104  
           BIND CURRENCY-CONV.                                          CG050602
           BIND CURRENCY-FACTOR.                                        CG050602
           BIND MISC-HDR-CHARGE.                                        CG220726
           IF PREV-PROGRAM-NAME = 'DNWMX820' OR 'DNWMX830'              CG031118
              CONTINUE                                                  CG031118
           ELSE                                                         CG031118
              BIND TABLE-HDR                                            CG031118
              BIND TABLE-DETAIL                                         CG031118
           END-IF.                                                      CG031118
                                                                                
           MOVE FUNCTION CURRENT-DATE(1:14) TO WS-CURRENT-DATE-TIME     IM990707
           MOVE WS-CURRENT-TIME             TO IDMS-TIME                        
           MOVE WS-CURRENT-DATE-YYMMDD      TO SYSTEM-RUN-DATE                  
           MOVE ORDER-HEADER-FUND-RESERVE-367 TO                                
                ORDER-HEADER-WORK-RECORD.                                       
           MOVE ZEROS TO WK-ITEM-AMT.                                           
           MOVE ZEROS TO WK-TAX-AMT.                                            
           MOVE ZEROS TO WK-MISC-CHRG-AMT.                                      
           MOVE ZEROS TO WK-TOT-ITEM-DISCOUNT-AMT.                              
           MOVE ZEROS TO WK-TOTAL-QTY-SHIP.                             UNITDISC
           MOVE 'N' TO WS-CALC-DELIVERY-FEE.                            CG220726
           MOVE ZEROS TO WS-SALES-TAX-AMT.                                      
           MOVE ZEROS TO WK-ORDER-QTY.                                  C02104  
                                                                                
       HSEKPG01-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       ADDHDR10             SECTION.                                            
      ******************************************************************        
      * ADDHDR10 - ADD AN INVOICE HEADER                               *        
      ******************************************************************        
                                                                                
           MOVE '?'                    TO WK-DISCOUNT-IND.                      
           MOVE 'N'                    TO WS-REGROUP-CUST.              C02062  
      *  WS-HST-CUST IS USED FOR CUSTOMERS WHO ARE CHARGED HST.                 
      *  WS-HST-CUSTOMER IS USED FOR CUSTOMERS IN NB, NF, OR NS                 
      *  PROVINCES AND IS USED IN WASTE TAX PROGRAM.                            
           MOVE 'N'                    TO WS-HST-CUST.                  C03338  
           MOVE 'N'                    TO WS-HST-CUSTOMER.              C03338  
           MOVE '00'                   TO STATUS-CODE-W380.             P84943  
           MOVE WS-CURRENT-DATE-YYMMDD TO WK-EFF-FROM.                  CG031118
           INITIALIZE LOAD.                                             SDUUD111
                                                                                
           IF WK3-INVOICE-NUMBER > SPACES                                 WMSSEG
               MOVE 'Y'                TO WK-SHIP-FLAG                    WMSSEG
               INITIALIZE RECEIVABLE-ITEM                                 WMSSEG
               MOVE WK3-INVOICE-NUMBER TO RECEIVABLE-ITEM-NUMBER-2712     WMSSEG
               OBTAIN CALC AR-INVOICE-HDR                                 WMSSEG
               OBTAIN FIRST SHIPMENT-HEADER WITHIN INVHDR-SHIP            WMSSEG
               ACCEPT WK3-DB-KEY (2)   FROM SHIPMENT-HEADER CURRENCY      WMSSEG
               OBTAIN OWNER WITHIN ORDER-SHIPMENTS                        WMSSEG
               OBTAIN OWNER WITHIN LOAD-SHIP                            SDUUD111
           ELSE                                                           WMSSEG
               MOVE 'N'                TO WK-SHIP-FLAG                    WMSSEG
               INITIALIZE AR-INVOICE-HDR                                  WMSSEG
                          RECEIVABLE-ITEM                                 WMSSEG
               OBTAIN SHIPMENT-HEADER DB-KEY IS WK3-DB-KEY (2).           WMSSEG
                                                                                
           MOVE ORDER-NUMBER-3510      TO ORDER-NUMBER-2700.                    
           IF REVERSE-PO-FLAG-3510 = 'Y'                                  C03407
           AND REVERSE-PO-NBR-3515     NOT = SPACES                       C03407
             MOVE REVERSE-PO-NBR-3515  TO INVOICE-REFERENCE-NUMBER-2700   C03407
           ELSE                                                           C03407
           MOVE CUSTOMER-PO-NUMBER-3510                                         
                                       TO INVOICE-REFERENCE-NUMBER-2700.        
           MOVE WS-CURRENT-DATE-YYMMDD TO RECEIVABLE-ITEM-DATE-2700.    CG031118
           IF (ORDER-TYPE-3510 = 'S'   AND INVOICE-ONLY-FLAG-3510 = 'Y')  P86872
              OR (ORDER-TYPE-3510 = 'C')                                  P86872
               MOVE TRNS-TYPE-CODE-3510                                         
                                       TO SUB-ACCOUNT-2700                P86872
           ELSE                                                           P86872
               MOVE SUB-ACCOUNT-3510   TO SUB-ACCOUNT-2700.                     
                                                                                
           MOVE CLAIMS-TYPE-3510       TO WK-CLAIMS-TYPE.                C02104 
           INITIALIZE SOHEXT.                                            C01619 
           OBTAIN FIRST SOHEXT WITHIN SO-HDR-EXT                         C01619 
             ON DB-END-OF-SET                                            C01619 
                 NEXT SENTENCE.                                          C01619 
           IF CORR-INV-RESN-CODE-8243 = '400'                            C01619 
               MOVE 'OSD'              TO SUB-ACCOUNT-2700               C01619 
               MOVE OSD-SEQ-NBR-8243   TO OSD-SEQ-NBR-2700.              C01619 
                                                                                
           IF (CLAIMS-TYPE-3510 = 'X'                                   C02104  
           OR CLAIMS-TYPE-3510 = 'F')                                   C02642  
           AND ORIG-INV-NBR-8243 NOT = SPACES                           C02104  
             MOVE ORIG-INV-NBR-8243    TO RECEIVABLE-ITEM-NUMBER-9100   C02104  
             OBTAIN CALC WBSB-INVOICE-HDR                               C02104  
             PERFORM UNTIL WBSB-CNTL-NBR-9101 = WBSB-CNTL-NBR-8243      C02104  
               OBTAIN NEXT WBSB-CORR-MASTER WITHIN WBSB-INV-CORR        C02104  
             END-PERFORM.                                               C02104  
                                                                                
           IF  INVOICE-ONLY-FLAG-3510 = 'Y'                               RIBOL 
               MOVE BILL-LADING-NUMBER-3510                               RIBOL 
                                       TO BILL-OF-LADING-NUMBER-2700      RIBOL 
           ELSE                                                           RIBOL 
               MOVE BILL-LADING-NUMBER-3515                               RIBOL 
                                       TO BILL-OF-LADING-NUMBER-2700.     RIBOL 
                                                                                
           MOVE SOLD-TO-BUSINESS-3510  TO SOLD-TO-BUSINESS-2712.                
           MOVE BILL-TO-BUSINESS-3510  TO CUSTOMER-NUMBER-2712.                 
           MOVE BILL-TO-ADDR-TYPE-3510 TO BILL-TO-ADDR-TYPE-2712.               
           MOVE SHIP-TO-BUSINESS-3510  TO SHIP-TO-BUSINESS-2712.                
           MOVE SHIP-TO-ADDR-TYPE-3510 TO SHIP-TO-ADDR-TYPE-2712.               
           MOVE SHIP-PLANT-CODE-3515   TO SHIP-PLANT-CODE-2712.                 
           MOVE DATE-SHIPPED-3515      TO DATE-SHIPPED-2712.                    
           MOVE WS-CURRENT-DATE-YYMMDD TO AS-OF-DATE-2712               CG031118
                                          INVOICE-DATE-2712.            CG031118
           MOVE DISCOUNT-CODE-3510 (1) TO DISCOUNT-CODE-2712 (1).               
           MOVE DISCOUNT-CODE-3510 (2) TO DISCOUNT-CODE-2712 (2).               
           MOVE DISCOUNT-CODE-3510 (3) TO DISCOUNT-CODE-2712 (3).               
      ******************************************************************CG240531
      *DO NOT CHARGE DISCOUNT IF DISCOUNT IS SPECIAL PRICE DISCOUNT     CG240531
      ******************************************************************CG240531
           IF DISCOUNT-CODE-2712 (1) NOT = SPACES                       CG240531
           OR DISCOUNT-CODE-2712 (2) NOT = SPACES                       CG240531
           OR DISCOUNT-CODE-2712 (3) NOT = SPACES                       CG240531
              PERFORM 4800-CHECK-SPCL-PRICE                             CG240531
                                       THRU 4800-EXIT                   CG240531
           END-IF.                                                      CG240531
      ******************************************************************CG240531
      *                                                                *CG240531
      ******************************************************************CG240531
           MOVE ORDER-AMT-3510         TO WS-SALES-ORD-AMT.             CG050718
                                                                                
           MOVE TARIFF-AMT-3515        TO TARIFF-AMT-2712.                      
           MOVE SALES-TAX-RATE-3510(1) TO SALES-TAX-RATE-2712 (1).              
           MOVE SALES-TAX-RATE-3510(2) TO SALES-TAX-RATE-2712 (2).              
           MOVE SALES-TAX-RATE-3510(3) TO SALES-TAX-RATE-2712 (3).              
                                                                                
           MOVE SPACES                 TO WS-QC-TAXDATE.                IM980324
           MOVE INVOICE-DATE-2712      TO WS-QC-TAXDATE.                IM980324
                                                                        CG050602
      *************************************************************>>   CG050602
      * CHECK IF INVOICE IS APPLICABLE FOR CURRENCY CONVERSION.    >>   CG050602
      * THE INVOICE IS APPLICABLE FOR CONVERSION IF :              >>   CG050602
      *     1)IT IS FOR A CANADIAN CUSTOMER                        >>   CG050602
      *     2)THE CUSTOMER'S CURRENCY-CODE IS SETUP AS 'USD'  &    >>   CG050602
      *     3)THE INVOICE IS NOT A CORRECTION DOCUMENT             >>   CG050602
      *     4)THE CUSTOMER IS A NON '3001' CATEGORY                >>   CG050613
      *************************************************************>>   CG050602
           MOVE SPACES               TO WS-CONV-DTLS.                   CG050602
           MOVE +0.00                TO WS-CURR-FACTOR.                 CG050602
           MOVE CUSTOMER-NUMBER-2712 TO BUSINESS-NUMBER-5050.           CG050602
           FIND CALC BUSINESS.                                          CG050602
           OBTAIN FIRST CUSTOMER WITHIN BUS-ROLE.                       CG050602
           IF CURRENCY-CODE-3501 (1:3) = 'USD'                          CG050602
              IF CUSTOMER-NUMBER-2712 (1:1) = '0'                       CG050602
                 IF CUST-CODE-GROUP-3501 (1:4) NOT = '3001'             CG050613
                    IF CORR-INV-NBR-8243 (1:1) = SPACES                 CG050602
                                              OR LOW-VALUES             CG050602
                                              OR HIGH-VALUES            CG050602
                       PERFORM 4000-CHECK-CURRENCY THRU 4000-EXIT       CG050602
                    END-IF                                              CG050602
                 END-IF                                                 CG050613
              END-IF                                                    CG050602
           END-IF.                                                      CG050602
      *************************************************************>>   CG050602
           MOVE ORGANIZATION-ID-3501 (1:3) TO WS-ORG-ID.                CG071204
                                                                                
           IF  INVOICE-ONLY-FLAG-3510 = 'Y'                                     
               MOVE DATE-SHIPPED-3515  TO RECEIVABLE-ITEM-DATE-2700             
               MOVE DATE-SHIPPED-3515  TO DATE-SHIPPED-2712                     
               MOVE DATE-SHIPPED-3515  TO AS-OF-DATE-2712                       
               MOVE DATE-SHIPPED-3515  TO INVOICE-DATE-2712.                    
                                                                                
           IF ORDER-TYPE-3510 NOT = 'C'                                 C02157  
             IF AS-OF-DATE-8243 NOT = SPACES                            C02157  
               MOVE AS-OF-DATE-8243    TO AS-OF-DATE-2712               C02157  
               MOVE 'Y'                TO AS-OF-DATE-FLAG-2712.         C02157  
                                                                                
           IF  INVOICE-APPROVAL-IND-3510 = 'Y'                                  
               MOVE 'I'                TO RECEIVABLE-ITEM-STATUS-2700           
           ELSE                                                                 
               MOVE 'P'                TO RECEIVABLE-ITEM-STATUS-2700.          
                                                                                
           MOVE 'N'                    TO BATCH-STATUS-2700.                    
           MOVE 'Y'                    TO LINE-ITEM-IND-2712.                   
           MOVE 'O'                    TO INVOICE-BUILT-BY-IND-2712.            
           MOVE WS-CURRENT-DATE-YYMMDD TO DATE-ENTERED-2712             CG031118
                                          DATE-LAST-ACTIVITY-2712.      CG031118
           MOVE PROGRAM-NAME           TO UPDATE-USER-2712.                     
                                                                                
      *      GETFOB69: MAY READ SHIP-TO CUSTOMER INFO                   BILTOEXM
           PERFORM GETFOB69.                                                    
                                                                                
           PERFORM PLTCTL65.                                                    
                                                                                
      *      INVTYP30: REFERENCES BILL-TO CUSTOMER INFO                 BILTOEXM
           PERFORM INVTYP30.                                                    
                                                                                
      *      TAXNEX40: REFERENCES BILL-TO AND SHIP-TO CUSTOMER INFO     BILTOEXM
           PERFORM TAXNEX40.                                                    
                                                                        PASSERR 
           IF AVP-STATE-NOT-FOUND                                       P84943  
             GO TO ADDHDR10-EXIT.                                       P84943  
                                                                        PASSERR 
      *      GETCAO53: REFERENCES BILL-TO CUSTOMER INFO                 BILTOEXM
           PERFORM GETCAO53.                                                    
                                                                                
      *      HDRGLA31: REFERENCES BILL-TO CUSTOMER INFO                 BILTOEXM
           PERFORM HDRGLA31.                                                    
                                                                                
           IF WK-SHIP-FLAG = 'Y'                                          WMSSEG
               MOVE WK3-INVOICE-NUMBER TO RECEIVABLE-ITEM-NUMBER-2700     WMSSEG
                                          RECEIVABLE-ITEM-NUMBER-2712     WMSSEG
           ELSE                                                           WMSSEG
               PERFORM INVNUM60.                                          WMSSEG
                                                                                
      *      REFERENCING BILL TO CUSTOMER INFO                          BILTOEXM
           FIND CUSTOMER DB-KEY        IS WK3-DB-KEY (5).                       
                                                                                
           OBTAIN FIRST SHIPMENT-LINE WITHIN SHIPMENT-LINES                     
                  ON DB-END-OF-SET                                              
                    NEXT SENTENCE.                                              
                                                                        CG080219
           IF DB-END-OF-SET                                                     
             NEXT SENTENCE                                                      
           ELSE                                                                 
             OBTAIN OWNER WITHIN LINE-SHIPMENTS.                                
                                                                                
           IF DB-STATUS-OK                                              SDUUD111
             IF INVOICE-ONLY-FLAG-3510 = 'Y'                            SDUUD111
               MOVE PAYMENT-TERMS-CODE-3503                             SDUUD111
                                       TO PAYMENT-TERMS-CODE-2700       SDUUD111
               MOVE PAYMENT-TERMS-CODE-3503                             SDUUD111
                                       TO PAYMENT-TERMS-CODE-2712       SDUUD111
               PERFORM GETTRM51                                         SDUUD111
             ELSE                                                       SDUUD111
               IF REGROUP-CUSTOMER                                      C02062  
                   OR REGROUP-IND-3501 = 'Y'                            P05984  
                 MOVE 'N30'            TO PAYMENT-TERMS-CODE-2700       C02062  
                                          PAYMENT-TERMS-CODE-2712       C02062  
                 PERFORM GETTRM51                                       C02062  
               ELSE                                                     C02062  
               OBTAIN OWNER WITHIN LINE-SCHED-SHIPS                     SDUUD111
               MOVE PAYMENT-TERMS-CODE-3504                             SDUUD111
                                       TO PAYMENT-TERMS-CODE-2700       SDUUD111
               MOVE PAYMENT-TERMS-CODE-3504                             SDUUD111
                                       TO PAYMENT-TERMS-CODE-2712       SDUUD111
               PERFORM GETTRM51.                                        SDUUD111
                                                                                
           MOVE 'Y'                    TO WK-HOLD-FLAG.                  TAXMSPN
           MOVE 'Y'                    TO WK-HEADER-FLAG.                TAXMSPN
           IF DB-STATUS-OK                                               TAXMSPN
             IF INVOICE-ONLY-FLAG-3510 = 'Y'                             TAXMSPN
               PERFORM UNTIL DB-END-OF-SET                               TAXMSPN
                 MOVE MARKETING-PART-ID-3516                             TAXMSPN
                                       TO PART-NUMBER-3527               TAXMSPN
                 OBTAIN CALC MKT-PART                                    TAXMSPN
                 IF TAX-LEVEL-3527     NOT = SPACES                      TAXMSPN
                   IF TAX-LEVEL-3527       = 'WS' OR 'CX'               CG050812
                     MOVE 'N'          TO WK-HOLD-FLAG                   TAXMSPN
                   ELSE                                                  TAXMSPN
                     MOVE 'N'          TO WK-HEADER-FLAG                 TAXMSPN
                   END-IF                                                TAXMSPN
                 END-IF                                                  TAXMSPN
                 OBTAIN NEXT SHIPMENT-LINE WITHIN SHIPMENT-LINES         TAXMSPN
                    ON DB-END-OF-SET                                            
                       NEXT SENTENCE                                            
                    END-IF                                                      
               END-PERFORM.                                              TAXMSPN
                                                                                
      ***************************************************************           
      *  THIS SECTION COPIED FROM COEBUIV1 TO SET UP AND CALL                   
      *  CARPRIDB.                                                              
      ***************************************************************           
           MOVE SPACES                 TO CARPRIDB-WORK-RECORD.                 
           MOVE SPACES                 TO CARPRIDB-WORK1-RECORD.                
           MOVE ZEROES                 TO CWK3-APPLIED-PAYMENT-COUNT            
                                         CWK3-DB-KEY (1)                        
                                         CWK3-DB-KEY (2)                        
                                         CWK3-DB-KEY (3)                        
                                         CWK3-DB-KEY (4)                        
                                         CWK3-DB-KEY (5)                        
                                         CWK3-ADJUSTMENT-AMT                    
                                         CWK1-BATCH-SEQUENCE.                   
                                                                                
           IF WK-SHIP-FLAG = 'Y'                                        WMSSEG  
               MOVE 'A'                TO CWK3-ACTION-IND               WMSSEG  
           ELSE                                                         WMSSEG  
               MOVE '0'                TO CWK3-ACTION-IND.              WMSSEG  
                                                                                
           MOVE WS-CURRENT-DATE-YYMMDD TO CWK3-DATE.                    CG031118
           MOVE IDMS-TIME              TO CWK3-TIME.                            
           MOVE PROGRAM-NAME           TO CWK3-USER-ID.                         
           MOVE DISCOUNTABLE-AMT-2700  TO CWK3-DISCOUNTABLE-AMT.                
                                                                                
           MOVE INVOICE-AMT-2712       TO CWK3-ADJUSTMENT-AMT.                  
                                                                                
           MOVE AUDIT-IND-2500 (5)     TO CWK3-AUDIT-IND.                       
           MOVE 'Y'                    TO CWK3-SERVICE-CHARGE-IND.              
           MOVE PROGRAM-NAME           TO CWK3-RESPONSE-NAME.                   
           MOVE SPACES                 TO CWK3-ERROR-STATUS-CODE.               
                                                                                
      * VERIFY EXECUTION OF CORRECT AR PROGRAM IN INCLUDE MODULE                
      * ADARP900 - PRODUCTION  - PCV6                                           
      * ADARX900 - TEST DEVELOPMENT DICTIONARIES                                
                                                                                
           COPY IDMS MODULE CARPRIDB-CALL.                                      
                                                                                
      ***************************************************************           
                                                                                
           MOVE 'SABGP380'             TO PROGRAM-NAME.                         
                                                                                
           IF  CWK3-ERROR-STATUS-CODE = 'R100'                          P84943  
               MOVE '02'               TO STATUS-CODE-W380              P84943  
               GO TO ADDHDR10-EXIT.                                     P84943  
                                                                                
           IF  CWK3-ERROR-STATUS-CODE  NOT = SPACES                             
               PERFORM ARRERR95.                                                
                                                                                
           OBTAIN RECEIVABLE-ITEM DB-KEY IS CWK3-DB-KEY (2).                    
                                                                                
           OBTAIN AR-INVOICE-HDR DB-KEY IS CWK3-DB-KEY (1).                     
                                                                                
           IF RECEIVABLE-ITEM-TYPE-2700 = 'D'                           RGRPENH 
             MOVE 'BGRG'               TO TEXT-TYPE-CODE-951            RGRPENH 
             MOVE ORDER-NUMBER-3510    TO TEXT-KEY-951                  RGRPENH 
             FIND CALC TEXT-HEADER                                      RGRPENH 
                  ON DB-REC-NOT-FOUND                                   RGRPENH 
                     NEXT SENTENCE                                      RGRPENH 
                  END-IF                                                RGRPENH 
             OBTAIN LAST TEXT-LINE WITHIN TEXT-DETAIL                   CG030410
                    ON DB-END-OF-SET                                    RGRPENH 
                       NEXT SENTENCE                                    RGRPENH 
                    END-IF                                              RGRPENH 
             MOVE TEXT-DETAIL-LINE-952 (22:5)                           RGRPENH 
                                       TO REGROUP-NBR-2712              RGRPENH 
             FIND CURRENT AR-INVOICE-HDR                                RGRPENH 
             MODIFY AR-INVOICE-HDR.                                     RGRPENH 
                                                                        RGRPENH 
           IF WK-SHIP-FLAG NOT = 'Y'                                    WMSSEG  
               CONNECT SHIPMENT-HEADER TO INVHDR-SHIP.                  WMSSEG  
                                                                                
           MOVE CWK3-DB-KEY (1)        TO WK3-DB-KEY (3).                       
           MOVE CWK3-DB-KEY (2)        TO WK3-DB-KEY (6).                       
                                                                                
           FIND SHIPMENT-HEADER DB-KEY IS WK3-DB-KEY (2).                       
           OBTAIN NEXT SHIPMENT-LINE WITHIN SHIPMENT-LINES                      
                  ON DB-END-OF-SET                                              
                      NEXT SENTENCE.                                            
                                                                                
           PERFORM UNTIL DB-END-OF-SET                                          
               ACCEPT WK3-DB-KEY (8)                                            
                             FROM SHIPMENT-LINE CURRENCY                        
               PERFORM ADDLNE20                                                 
               OBTAIN NEXT SHIPMENT-LINE WITHIN SHIPMENT-LINES                  
                      ON DB-END-OF-SET                                          
                          NEXT SENTENCE                                         
                      END-IF                                                    
           END-PERFORM.                                                         
                                                                                
           PERFORM 4700-DELIVERY-FEE   THRU   4700-EXIT.                CG220726
           FIND   AR-INVOICE-HDR DB-KEY IS WK3-DB-KEY (3).              CG220726
           MOVE WS-SALES-ORD-AMT       TO ORDER-AMT-3510.               CG050718
           INITIALIZE MESSAGE-TYPE                                              
                      MESSAGE-DATA                                              
                      COEDUIV0-WORK9-RECORD.                                    
           MOVE ORDER-NUMBER-3510      TO WK9-ORDER-NUMBER.                     
           MOVE SHIPMENT-NUMBER-3515   TO WK9-SHIPMENT-NUMBER.                  
           MOVE RECEIVABLE-ITEM-NUMBER-2700                                     
                                       TO WK9-INVOICE-NUMBER.                   
           MOVE ORDER-TYPE-3510        TO WK9-ORDER-TYPE.                       
           MOVE RECEIVABLE-ITEM-TYPE-2700                                       
                                       TO WK9-RECEIVABLE-ITEM-TYPE.             
           MOVE WS-CURRENT-DATE-TIME   TO WK9-CURRENT-DATE-TIME.        CG071204
                                                                        IM010430
           IF OLIVER-CUSTOMER                                           CG071204
              MOVE 'OLVR' TO MESSAGE-TYPE-931                           CG071204
           ELSE                                                         CG071204
              IF WS-MRT-PRODUCT = 'Y'                                   CG020801
                 MOVE 'MRTI' TO MESSAGE-TYPE-931                        CG020801
              ELSE                                                      CG020801
                 IF RECEIVABLE-ITEM-NUMBER-2712 (1:2) = 'XB'            IM010430
                    MOVE 'XB80' TO MESSAGE-TYPE-931                     IM010430
                 ELSE                                                   IM010430
                    MOVE 'OEIV' TO MESSAGE-TYPE-931                     IM010430
                 END-IF                                                 IM010430
              END-IF                                                    CG020801
           END-IF.                                                      CG071204
                                                                        IM010430
           MOVE WS-CURRENT-DATE-YYMMDD TO DATE-932.                     CG031118
           MOVE WS-CURRENT-TIME        TO TIME-HMS-932.                 CG031118
           MOVE COEDUIV0-WORK9-RECORD  TO MESSAGE-932.                          
           IF (WS-MTP-PRODUCT = 'Y')   AND                              CG020821
              (WS-INSTANT-PRINT = 'Y') AND                              CG020821
              (PREV-PROGRAM-NAME = 'DNWMX820' OR 'DNWMX830')            CG020821
              MOVE 'MTP' TO MESSAGE-932 (52:3)                          CG020821
           END-IF.                                                      CG020821
                                                                                
           FIND CALC MESSAGE-TYPE                                               
                ON DB-REC-NOT-FOUND                                             
                  NEXT SENTENCE.                                                
                                                                                
           IF  DB-REC-NOT-FOUND                                                 
               STORE MESSAGE-TYPE.                                              
                                                                                
           STORE MESSAGE-DATA.                                                  
                                                                                
       ADDHDR10-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       ADDLNE20            SECTION.                                             
      ***********************************************************************   
      * ADDLNE20 - ADD INVOICE LINE                                         *   
      ***********************************************************************   
                                                                                
           OBTAIN OWNER WITHIN LINE-SHIPMENTS.                                  
                                                                                
           IF INVOICE-ONLY-FLAG-3510 = 'Y'                              CANCELLN
               IF ORDER-LINE-STATUS-3503 = 'X'                          CANCELLN
                   GO TO ADDLNE20-EXIT.                                 CANCELLN
                                                                                
           MOVE 'N'                         TO WS-SHIP-DATE-PRICE.      CG060124
           IF ORDER-NUMBER-3510(1:1)  = 'S'                             CG050119
              MOVE 'PRCSHPCUS'         TO TABLE-KEY-8016                CG050119
              FIND CALC TABLE-HDR                                       CG050119
              ON DB-REC-NOT-FOUND                                       CG050119
                 NEXT SENTENCE                                          CG050119
              END-IF                                                    CG050119
              MOVE BILL-TO-BUSINESS-3510 TO ENTRY-CODE-8017             CG050119
              FIND TABLE-DETAIL WITHIN HDR-DETAIL                       CG050119
                                   USING ENTRY-CODE-8017                CG050119
              ON DB-REC-NOT-FOUND                                       CG050119
                 NEXT SENTENCE                                          CG050119
              END-IF                                                    CG050119
              PERFORM 4300-PRICE-LINE     THRU 4300-EXIT                CG050119
              MOVE 'Y'                      TO WS-SHIP-DATE-PRICE       CG060124
           END-IF.                                                      CG050119
                                                                                
           IF (CUST-CHNL-3501               =  '01'             OR      CG060124
               CUST-CHNL-3501               =  '14'             OR      CG060124
               CUST-SUB-CHNL-3501           =  '034'            OR      CG060124
               CUST-SUB-CHNL-3501           =  '035')          AND      CG060124
               MRTI-ORDER-FLAG-3510 NOT     =  'N'             AND      CG060124
               WS-SHIP-DATE-PRICE           =  'N'                      CG060124
              PERFORM 4300-PRICE-LINE       THRU 4300-EXIT              CG060124
           END-IF.                                                      CG060124
                                                                        CG060124
           OBTAIN OWNER WITHIN LINE-SCHED-SHIPS.                        SDUUD111
                                                                                
           INITIALIZE AR-INVOICE-ITEM.                                          
           MOVE SHIPMENT-LINE-3516          TO INVOICE-LINE-2714.               
           MOVE MARKETING-PART-ID-3516      TO MARKETING-PART-ID-2714.          
           MOVE MARKETING-TYPE-3516         TO MARKETING-TYPE-2714.             
           MOVE PART-NUMBER-3516            TO PART-NUMBER-2714.                
           MOVE DESCRIPTION-3503            TO PART-DESCRIPTION-2714.           
           MOVE ORDER-QTY-UOM-3516          TO UNIT-MEASURE-2714.               
           IF (CLAIMS-TYPE-3510 = 'X'                                   C02104  
           OR CLAIMS-TYPE-3510 = 'F')                                   C02642  
           AND UNIT-PRICE-3503 < ZEROS                                  C02104  
             COMPUTE UNIT-PRICE-2714 ROUNDED =                          C02104  
                  UNIT-PRICE-3503 * -1                                  C02104  
           ELSE                                                         C02104  
           MOVE UNIT-PRICE-3503             TO UNIT-PRICE-2714.                 
           MOVE DISCOUNT-CODE-3503 (1)      TO DISCOUNT-CODE-2714 (1).          
           MOVE DISCOUNT-CODE-3503 (2)      TO DISCOUNT-CODE-2714 (2).          
           MOVE DISCOUNT-CODE-3503 (3)      TO DISCOUNT-CODE-2714 (3).          
           IF DISCOUNT-CODE-2714 (1) NOT = SPACES                       CG240531
           OR DISCOUNT-CODE-2714 (2) NOT = SPACES                       CG240531
           OR DISCOUNT-CODE-2714 (3) NOT = SPACES                       CG240531
              PERFORM 4850-CHECK-SPCL-PRICE                             CG240531
                                       THRU 4850-EXIT                   CG240531
           END-IF.                                                      CG240531
                                                                                
           IF CLAIMS-TYPE-3510 = 'W'                                    C02104  
           OR CLAIMS-TYPE-3510 = 'X'                                    C02104  
           OR CLAIMS-TYPE-3510 = 'F'                                    C02642  
             MOVE WAS-SHOULD-IND-3503 TO WAS-SHOULD-IND-2714            C02104  
             MOVE DEBIT-CREDIT-IND-3503 TO DEBIT-CREDIT-IND-2714        C02104  
             MOVE WBSB-PAIR-NBR-3503 TO WBSB-PAIR-NBR-2714              C02104  
           ELSE                                                         C02104  
             MOVE SPACES TO WAS-SHOULD-IND-2714                         C02104  
                            DEBIT-CREDIT-IND-2714                       C02104  
             MOVE ZEROS TO WBSB-PAIR-NBR-2714.                          C02104  
                                                                                
      ******************************************************************C00934  
      *  CPU WILL ONLY BE TERMINAL ALLOWANCE. CANNOT HAVE DROP-OFF AND *C00934  
      *  TERMINAL ALLOWANCE ON THE SAME INVOICE.                       *C00934  
      ******************************************************************C00934  
                                                                                
           MOVE QSA-DISCOUNT-CODE-3504      TO QSA-DISCOUNT-CODE-2714.  SDUUD111
           IF INVOICE-ONLY-FLAG-3510 = 'Y'                              SDUUD111
               MOVE TA-DISCOUNT-CODE-3504   TO TA-DISCOUNT-CODE-2714    SDUUD111
           ELSE                                                                 
               IF FREIGHT-CHARGE-FLAG-3515 = 'C'                        P86379  
                 MOVE TA-DISCOUNT-CODE-3504   TO TA-DISCOUNT-CODE-2714  SDUUD111
               ELSE                                                             
                   IF DROP-OFF-CHRG-APP-FLAG-3504 = 'Y' AND             C00934  
                      DROP-OFF-CHRG-ADDED-FLAG-3504 = 'N'               C00934  
                       MOVE TA-DISCOUNT-CODE-3504 TO                    C00934  
                            TA-DISCOUNT-CODE-2714                       C00934  
                       MOVE 'Y' TO DROP-OFF-CHRG-ADDED-FLAG-3504        C00934  
                       FIND CURRENT SO-LINE-SCHEDULE                    C00934  
                       MODIFY SO-LINE-SCHEDULE.                         C00934  
                                                                                
           MOVE TAX-FLAG-3503               TO TAX-FLAG-2714.                   
                                                                                
                                                                                
           MOVE QTY-SHIPPED-3516            TO QTY-SHIPPED-2714                 
           IF  UNIT-MEASURE-2714 NOT = ISSUE-UNIT-MEASURE-3516                  
               INITIALIZE CASPUOM0-CONVERSION-RECORD                            
               MOVE PART-NUMBER-3516        TO CWK-PART-NUMBER (1)              
               MOVE SHIP-PLANT-CODE-3515    TO CWK-PLANT-CODE (1)               
               MOVE ISSUE-UNIT-MEASURE-3516 TO                                  
                    CWK-FROM-UNIT-MEASURE (1)                                   
               MOVE UNIT-MEASURE-2714       TO                                  
                    CWK-TO-UNIT-MEASURE (1)                                     
               MOVE QTY-SHIPPED-2714        TO CWK-FROM-UOM-QTY (1)             
               PERFORM LNKUOM90                                                 
               MOVE CWK-TO-UOM-QTY (1)      TO QTY-SHIPPED-2714.                
                                                                        CG020801
      ****************************************************************  CG020801
      * FOR MRT PRODUCTS, WE NEED TO STORE THE PRICE PER "ROLL" TO      CG020801
      * ENSURE ALL CALCULATIONS WITHIN INVOICING REMAIN UNAFFECTED.     CG020801
      * THE UNIT-PRICE PER POUND WHICH IS REQUIRED ON THE INVOICE COPY  CG020801
      * WILL BE OBTAINED FROM THE SALES-ORDER-LINE, IN SABGP020         CG020801
      *                                                                 CG020821
      * MTP-PRODUCTS WILL BE IDENTIFIED BY THE PRODUCT-CLASSIFICATION   CG020821
      * CODE. SET WS-MTP-PRODUCT TO 'Y' TO CREATE THE REQUIRED MESSAGE  CG020821
      * TYPE/DATA RECORD                                                CG020821
      ****************************************************************  CG020801
           MOVE SPACES                 TO MKT-PART.                     CG020801
           MOVE MARKETING-PART-ID-2714 TO PART-NUMBER-3527.             CG020801
           OBTAIN CALC MKT-PART.                                        CG020801
           IF MARKETING-TYPE-3527 = 'I'                                 CG220726
               MOVE 'Y'        TO WS-CALC-DELIVERY-FEE                  CG220726
           END-IF                                                       CG220726
           IF MULTIPLY-WGT-IND-3527 = 'Y'                               CG020801
              MOVE 'Y' TO WS-MRT-PRODUCT                                CG020801
              COMPUTE UNIT-PRICE-2714 =                                 CG020801
                ((UNIT-PRICE-3503 * ITEM-WGT-LBS-3516)                  CG020801
                 / QTY-SHIPPED-2714)                                    CG020801
           END-IF.                                                      CG020801
           IF WS-CONVERT           = 'Y'                                CG050602
              IF MARKETING-TYPE-2714  = 'N'                             CG050602
                 IF WS-CURR-FACTOR NOT = ZERO                           CG050602
                    COMPUTE WS-UNIT-PRICE ROUNDED =                     CG050613
                            UNIT-PRICE-2714 / WS-CURR-FACTOR            CG050613
                    MOVE    WS-UNIT-PRICE TO UNIT-PRICE-2714            CG050613
                    COMPUTE WS-SALES-ORD-AMT ROUNDED =                  CG050718
                            WS-SALES-ORD-AMT -  ORDER-AMT-3503          CG050718
                    MOVE    UNIT-PRICE-2714 TO UNIT-PRICE-3503          CG050602
                    COMPUTE ORDER-AMT-3503   ROUNDED =                  CG050602
                            UNIT-PRICE-3503 * ORDER-QTY-3503            CG050602
                    COMPUTE WS-SALES-ORD-AMT ROUNDED =                  CG050718
                            WS-SALES-ORD-AMT +  ORDER-AMT-3503          CG050718
                    FIND CURRENT SALES-ORDER-LINE                       CG050602
                    MODIFY SALES-ORDER-LINE                             CG050602
                 END-IF                                                 CG050602
              END-IF                                                    CG050602
           END-IF.                                                      CG050602
           IF PROD-CATEG-CODE-3527 = '013'                              CG020821
              MOVE 'Y' TO WS-MTP-PRODUCT                                CG020821
           END-IF.                                                      CG020821
                                                                        CG020821
           MOVE WS-CURRENT-DATE-YYMMDD TO DATE-ENTERED-2714             CG031118
                                          DATE-LAST-ACTIVITY-2714.      CG031118
           MOVE PROGRAM-NAME               TO UPDATE-USER-2714.                 
                                                                                
           COMPUTE INVOICE-NET-AMT-2714 ROUNDED =                               
                       (QTY-SHIPPED-2714 * UNIT-PRICE-2714).                    
                                                                                
           IF (CLAIMS-TYPE-3510 = 'W'                                   C02104  
           OR CLAIMS-TYPE-3510 = 'X'                                    C02104  
           OR CLAIMS-TYPE-3510 = 'F')                                   C02642  
           AND DEBIT-CREDIT-IND-3503 = 'C'                              C02104  
             SUBTRACT QTY-SHIPPED-2714 FROM WK-TOTAL-QTY-SHIP           C02104  
           ELSE                                                         C02104  
             IF MARKETING-PART-ID-2714 (1:1) IS NUMERIC                 IM010710
                ADD QTY-SHIPPED-2714 TO WK-TOTAL-QTY-SHIP               IM010705
             END-IF                                                     IM010705
           END-IF.                                                      IM010705
                                                                                
           IF (CLAIMS-TYPE-3510 = 'X'                                   C02104  
           OR CLAIMS-TYPE-3510 = 'F')                                   C02642  
           AND WAS-SHOULD-IND-3503 = 'S'                                C02104  
             ADD QTY-SHIPPED-2714 TO WK-ORDER-QTY.                      C02104  
                                                                                
           PERFORM GETMKT52.                                                    
                                                                                
           IF MARKETING-TYPE-3527 = 'N'                                  TAXDISC
             IF TAX-LEVEL-3527 = SPACES  OR                              TAXDISC
                TAX-LEVEL-3527 = LOW-VALUES                              TAXDISC
               COMPUTE WK-ITEM-AMT ROUNDED =                             TAXDISC
                   WK-ITEM-AMT +                                         TAXDISC
                     (QTY-SHIPPED-2714 * UNIT-PRICE-2714)                TAXDISC
             ELSE                                                        TAXDISC
                     COMPUTE WK-TAX-AMT ROUNDED =                        TAXDISC
                         WK-TAX-AMT +                                    TAXDISC
                            (QTY-SHIPPED-2714 * UNIT-PRICE-2714)         TAXDISC
                     IF TAX-LEVEL-3527 NOT EQUAL 'WS' AND               CG050812
                        TAX-LEVEL-3527 NOT EQUAL 'CX'                   CG050812
                       COMPUTE WS-SALES-TAX-AMT ROUNDED =                TAXDISC
                         WS-SALES-TAX-AMT +                              TAXDISC
                            (QTY-SHIPPED-2714 * UNIT-PRICE-2714).        TAXDISC
                                                                                
           PERFORM LNEGLA32.                                                    
                                                                                
      *      CLCETX33: REFERENCES BILL-TO CUSTOMER INFO                 BILTOEXM
           PERFORM CLCETX33.                                                    
                                                                                
           PERFORM LNEDSC35.                                                    
           PERFORM GETTAX37.                                                    
                                                                                
           PERFORM 8000-GET-WP-DETAIL THRU 8000-EXIT.                   CG170910
           COMPUTE ITEM-AMT-2714 ROUNDED =                                      
                  (INVOICE-NET-AMT-2714    +                                    
                   WK-TOT-ITEM-DISCOUNT-AMT +                                   
                   MISC-CHARGE-AMT-2714    +                                    
                   MISC-ALLOWANCE-AMT-2714 ).                                   
      ******************************************************************CG031118
      * THE RETREAD-TAX-FLAG IN SALES-ORDER-LINE IS MOVED TO THE       *CG031118
      * RETREAD-TAX-FLAG IN AR-INVOICE-ITEM RECORD AND AVP-TAX-RECORD. *CG031118
      * IF THE RETREAD-TAX-FLAGS ARE SET TO 'Y', THEN IT WILL INDICATE *CG031118
      * A DIFFERENT METHOD OF TAX CALCULATION.                         *CG031118
      ******************************************************************CG031118
           MOVE RETREAD-TAX-FLAG-3503 TO RETREAD-TAX-FLAG-2714          CG031118
                                         AVP-RETREAD-TAX-FLAG.          CG031118
           FIND AR-INVOICE-HDR DB-KEY IS WK3-DB-KEY (3).                        
           IF  INVOICE-LINES NOT EMPTY                                          
               FIND PRIOR AR-INVOICE-ITEM WITHIN INVOICE-LINES                  
           ELSE                                                                 
               PERFORM IDMS-STATUS.                                             
                                                                                
           STORE AR-INVOICE-ITEM.                                               
                                                                                
      *      CLCTAX45: REFERENCES SHIP-TO CUSTOMER INFO                 BILTOEXM
           PERFORM CLCTAX45.                                                    
                                                                                
           PERFORM CLCCOM34.                                                    
                                                                                
           FIND CURRENT AR-INVOICE-ITEM.                                        
                                                                                
           MODIFY AR-INVOICE-ITEM.                                              
                                                                                
           FIND SHIPMENT-LINE DB-KEY IS WK3-DB-KEY (8).                         
                                                                                
           CONNECT SHIPMENT-LINE TO INVITEM-SHIP.                               
                                                                                
       ADDLNE20-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       INVTYP30          SECTION.                                               
      ***********************************************************************   
      * INVTYP30 - DETERMINE INVOICE TYPE                                   *   
      ***********************************************************************   
           MOVE CUSTOMER-NUMBER-2712 TO BUSINESS-NUMBER-5050.             REASON
           FIND   CALC BUSINESS.                                        CG030410
           OBTAIN FIRST CUSTOMER WITHIN BUS-ROLE.                         REASON
           ACCEPT WK3-DB-KEY (5) FROM CUSTOMER CURRENCY.                  REASON
           OBTAIN FIRST CUSTEXT WITHIN CUSTOMER-EXT.                    CG020821
           MOVE INV-AT-SHIP-FLAG-3506 TO WS-INSTANT-PRINT.              CG020821
                                                                                
           IF  ORDER-TYPE-3510        = 'S'  AND                                
               INVOICE-ONLY-FLAG-3510 = 'N'                                     
               MOVE 'I'   TO RECEIVABLE-ITEM-TYPE-2700                          
               MOVE 'I'   TO RECEIVABLE-ITEM-TYPE-2712                          
               MOVE '   ' TO REASON-2700                                        
               GO TO INVTYP30-EXIT                                       REASON 
           ELSE                                                                 
           IF  ORDER-TYPE-3510        = 'S'  AND                                
               INVOICE-ONLY-FLAG-3510 = 'Y'                                     
               MOVE 'D'   TO RECEIVABLE-ITEM-TYPE-2700                          
               MOVE 'D'   TO RECEIVABLE-ITEM-TYPE-2712                          
               MOVE 'OED' TO REASON-2700                                        
           ELSE                                                                 
           IF  ORDER-TYPE-3510        = 'C'                                     
               MOVE 'C'   TO RECEIVABLE-ITEM-TYPE-2700                          
               MOVE 'C'   TO RECEIVABLE-ITEM-TYPE-2712                          
               MOVE 'OEC' TO REASON-2700.                                       
                                                                                
      *      THE GROUP-ID ON THE BILL-TO CUSTOMER IS USED ALONG WITH THE  REASON
      *      SUB-ACCOUNT ON SALES ORDER TO READ REASON-CODE.  IF THE      REASON
      *      RECORD EXISTS, THEN THE FIRST 3 CHARACTERS OF THE SUB ACCT   REASON
      *      WILL BE USED FOR THE REASON CODE ON RECEIVABLE-ITEM.  THIS   REASON
      *      IS ONLY FOR MEMOS, NOT INVOICES.                             REASON
                                                                                
      *      REFERENCES BILL-TO CUSTOMER INFO                           BILTOEXM
                                                                                
           INITIALIZE REASON-CODE.                                        REASON
           MOVE AR-GROUP-ID-3501 TO AR-GROUP-ID-2650.                     REASON
           MOVE SUB-ACCOUNT-3510 TO REASON-2650.                          REASON
           OBTAIN CALC REASON-CODE                                        REASON
               ON DB-REC-NOT-FOUND                                        REASON
                   NEXT SENTENCE.                                         REASON
                                                                                
           IF DB-STATUS-OK                                                REASON
               MOVE ADJUST-SALES-OPTION-2650                              REASON
                   TO ADJUST-SALES-OPTION-2700                            REASON
               MOVE SUB-ACCOUNT-3510 TO REASON-2700                       REASON
               GO TO INVTYP30-EXIT                                        REASON
           ELSE                                                           REASON
               IF DB-REC-NOT-FOUND                                        REASON
                   MOVE REASON-2700 TO REASON-2650                        REASON
                   OBTAIN CALC REASON-CODE                                REASON
                       ON DB-REC-NOT-FOUND                                REASON
                           GO TO INVTYP30-EXIT.                           REASON
                                                                                
           IF DB-STATUS-OK                                                REASON
               MOVE ADJUST-SALES-OPTION-2650                              REASON
                   TO ADJUST-SALES-OPTION-2700.                           REASON
                                                                                
       INVTYP30-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       HDRGLA31           SECTION.                                              
      ***********************************************************************   
      * HDRGLA31 - GET GL ACCOUNT NUMBER FOR BILL-TO CUSTOMER               *   
      ***********************************************************************   
           MOVE SPACES TO ORGANIZATION-ID-2700.                                 
           MOVE SPACES TO ACCOUNT-2700.                                         
           MOVE SPACES TO CENTER-2700.                                          
                                                                                
           IF  ORGANIZATION-ID-2700 = SPACES                                    
               MOVE GL-ORGANIZATION-ID-3558     TO ORGANIZATION-ID-2700.        
           IF  ORGANIZATION-ID-2700 = SPACES                                    
               MOVE ORGANIZATION-ID-3501        TO ORGANIZATION-ID-2700.        
           IF  ORGANIZATION-ID-2700 = SPACES                                    
               MOVE GL-ORGANIZATION-ID-3501     TO ORGANIZATION-ID-2700.        
           IF  ORGANIZATION-ID-2700 = SPACES                                    
               MOVE ORGANIZATION-ID-2600        TO ORGANIZATION-ID-2700.        
           IF  ORGANIZATION-ID-2700 = SPACES                                    
               MOVE GL-ORGANIZATION-ID-3524 (2) TO ORGANIZATION-ID-2700.        
                                                                                
           IF  ACCOUNT-CODE-3558  NOT = SPACES                                  
               MOVE ACCOUNT-CODE-3558    TO ACCOUNT-CODE-4021                   
               MOVE ORGANIZATION-ID-2700 TO ORGANIZATION-ID-4021 (1)            
               MOVE SPACES               TO ORGANIZATION-ID-4021 (2)            
               MOVE 'CAR'                TO APPLICATION-IND-4021                
               OBTAIN CALC STANDARD-ACCOUNT                                     
                      ON DB-REC-NOT-FOUND                                       
                        NEXT SENTENCE                                           
                        END-IF                                                  
               MOVE ACCOUNT-4021     TO ACCOUNT-2700                            
               MOVE CENTER-4021      TO CENTER-2700                             
           ELSE                                                                 
               IF  GL-ACCOUNT-DATA-3558  NOT = SPACES                           
                   IF  ACCOUNT-2700 = SPACES                                    
                       MOVE GL-ACCOUNT-3558  TO ACCOUNT-2700                    
                   END-IF                                                       
                   IF  CENTER-2700  = SPACES                                    
                       MOVE GL-CENTER-3558   TO CENTER-2700                     
                   END-IF.                                                      
                                                                                
           IF  ACCOUNT-2700 NOT = SPACES  AND                                   
               CENTER-2700  NOT = SPACES                                        
               GO TO HDRGLA31-EXIT.                                             
                                                                                
           IF  ACCOUNT-3501 (1) NOT = SPACES  AND                               
               CENTER-3501  (1) NOT = SPACES                                    
               MOVE ACCOUNT-3501 (1)     TO ACCOUNT-2700                        
               MOVE CENTER-3501  (1)     TO CENTER-2700                         
           ELSE                                                                 
           IF  ACCOUNT-CODE-3501  NOT = SPACES                                  
               MOVE ACCOUNT-CODE-3501    TO ACCOUNT-CODE-4021                   
               MOVE ORGANIZATION-ID-2700 TO ORGANIZATION-ID-4021 (1)            
               MOVE SPACES               TO ORGANIZATION-ID-4021 (2)            
               MOVE 'CAR'                TO APPLICATION-IND-4021                
               OBTAIN CALC STANDARD-ACCOUNT                                     
                      ON DB-REC-NOT-FOUND                                       
                        NEXT SENTENCE                                           
                        END-IF                                                  
               MOVE ACCOUNT-4021     TO ACCOUNT-2700                            
               MOVE CENTER-4021      TO CENTER-2700                             
           ELSE                                                                 
           IF  GL-ACCOUNT-DATA-3501  NOT = SPACES                               
               IF  ACCOUNT-2700 = SPACES                                        
                   MOVE GL-ACCOUNT-3501  TO ACCOUNT-2700                        
               END-IF                                                           
               IF  CENTER-2700  = SPACES                                        
                   MOVE GL-CENTER-3501   TO CENTER-2700.                        
                                                                                
           IF  ACCOUNT-2700 NOT = SPACES  AND                                   
               CENTER-2700  NOT = SPACES                                        
               GO TO HDRGLA31-EXIT.                                             
                                                                                
           IF  ACCOUNT-2520 NOT = SPACES  AND                                   
               CENTER-2520  NOT = SPACES                                        
               MOVE ACCOUNT-2520  TO ACCOUNT-2700                               
               MOVE CENTER-2520   TO CENTER-2700.                               
                                                                                
           IF  ACCOUNT-2700 NOT = SPACES  AND                                   
               CENTER-2700  NOT = SPACES                                        
               GO TO HDRGLA31-EXIT.                                             
                                                                                
           IF  ACCOUNT-CODE-3524 (2)  NOT = SPACES                              
               MOVE ACCOUNT-CODE-3524(2) TO ACCOUNT-CODE-4021                   
               MOVE ORGANIZATION-ID-2700 TO ORGANIZATION-ID-4021 (1)            
               MOVE SPACES               TO ORGANIZATION-ID-4021 (2)            
               MOVE 'CAR'                TO APPLICATION-IND-4021                
               OBTAIN CALC STANDARD-ACCOUNT                                     
                      ON DB-REC-NOT-FOUND                                       
                        NEXT SENTENCE                                           
                        END-IF                                                  
               MOVE ACCOUNT-4021     TO ACCOUNT-2700                            
               MOVE CENTER-4021      TO CENTER-2700                             
           ELSE                                                                 
           IF  GL-ACCOUNT-DATA-3524 (2)  NOT = SPACES                           
               IF  ACCOUNT-2700 = SPACES                                        
                   MOVE GL-ACCOUNT-3524 (2) TO ACCOUNT-2700                     
               END-IF                                                           
               IF  CENTER-2700  = SPACES                                        
                   MOVE GL-CENTER-3524  (2) TO CENTER-2700.                     
                                                                                
       HDRGLA31-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       LNEGLA32            SECTION.                                             
      ***********************************************************************   
      * LNEGLA32 - GET GL ACCOUNT NUMBER FOR MARKETING PART/PLANT           *   
      ***********************************************************************   
           MOVE SPACES TO ORGANIZATION-ID-2714.                                 
           MOVE SPACES TO ACCOUNT-2714.                                         
           MOVE SPACES TO CENTER-2714.                                          
                                                                                
           IF  ACCOUNT-CODE-3526  NOT = SPACES                                  
               MOVE ACCOUNT-CODE-3526    TO ACCOUNT-CODE-4021                   
               MOVE ORGANIZATION-ID-2714 TO ORGANIZATION-ID-4021 (1)            
               MOVE SPACES               TO ORGANIZATION-ID-4021 (2)            
               MOVE 'CAR'                TO APPLICATION-IND-4021                
               OBTAIN CALC STANDARD-ACCOUNT                                     
                      ON DB-REC-NOT-FOUND                                       
                        NEXT SENTENCE                                           
                        END-IF                                                  
               MOVE ACCOUNT-4021     TO ACCOUNT-2714                            
               MOVE CENTER-4021      TO CENTER-2714                             
           ELSE                                                                 
           IF  GL-ACCOUNT-DATA-3526  NOT = SPACES                               
               IF  ACCOUNT-2714 = SPACES                                        
                   MOVE GL-ACCOUNT-3526  TO ACCOUNT-2714                        
               END-IF                                                           
               IF  CENTER-2714  = SPACES                                        
                   MOVE GL-CENTER-3526   TO CENTER-2714.                        
                                                                                
           IF  ACCOUNT-2714 NOT = SPACES  AND                                   
               CENTER-2714  NOT = SPACES                                        
               GO TO LNEGLA32-EXIT.                                             
                                                                                
           IF  ACCOUNT-CODE-3527  NOT = SPACES                                  
               MOVE ACCOUNT-CODE-3527    TO ACCOUNT-CODE-4021                   
               MOVE ORGANIZATION-ID-2714 TO ORGANIZATION-ID-4021 (1)            
               MOVE SPACES               TO ORGANIZATION-ID-4021 (2)            
               MOVE 'CAR'                TO APPLICATION-IND-4021                
               OBTAIN CALC STANDARD-ACCOUNT                                     
                      ON DB-REC-NOT-FOUND                                       
                        NEXT SENTENCE                                           
                        END-IF                                                  
               MOVE ACCOUNT-4021     TO ACCOUNT-2714                            
               MOVE CENTER-4021      TO CENTER-2714                             
           ELSE                                                                 
           IF  GL-ACCOUNT-DATA-3527  NOT = SPACES                               
               IF  ACCOUNT-2714 = SPACES                                        
                   MOVE GL-ACCOUNT-3527  TO ACCOUNT-2714                        
               END-IF                                                           
               IF  CENTER-2714  = SPACES                                        
                   MOVE GL-CENTER-3527   TO CENTER-2714.                        
                                                                                
           IF  ACCOUNT-2714 NOT = SPACES  AND                                   
               CENTER-2714  NOT = SPACES                                        
               GO TO LNEGLA32-EXIT.                                             
                                                                                
           IF  ACCOUNT-CODE-3524 (1)  NOT = SPACES                              
               MOVE ACCOUNT-CODE-3524(1) TO ACCOUNT-CODE-4021                   
               MOVE ORGANIZATION-ID-2714 TO ORGANIZATION-ID-4021 (1)            
               MOVE SPACES               TO ORGANIZATION-ID-4021 (2)            
               MOVE 'CAR'                TO APPLICATION-IND-4021                
               OBTAIN CALC STANDARD-ACCOUNT                                     
                      ON DB-REC-NOT-FOUND                                       
                        NEXT SENTENCE                                           
                        END-IF                                                  
               MOVE ACCOUNT-4021     TO ACCOUNT-2714                            
               MOVE CENTER-4021      TO CENTER-2714                             
           ELSE                                                                 
           IF  GL-ACCOUNT-DATA-3524 (1)  NOT = SPACES                           
               IF  ACCOUNT-2714  = SPACES                                       
                   MOVE GL-ACCOUNT-3524 (1) TO ACCOUNT-2714                     
               END-IF                                                           
               IF  CENTER-2714  = SPACES                                        
                   MOVE GL-CENTER-3524  (1) TO CENTER-2714.                     
                                                                                
       LNEGLA32-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       CLCETX33           SECTION.                                              
      ***********************************************************************   
      * CLCETX33 - CALCULATE EXCISE TAX                                     *   
      ***********************************************************************   
           MOVE ZEROES TO EXCISE-TAX-AMT-2714.                                  
           MOVE SPACES TO WKM-TAX-EXEMPT-IND.                                   
                                                                                
      *      FNDEXM62: REFERENCES BILL-TO CUSTOMER INFO                 BILTOEXM
           PERFORM FNDEXM62.                                                    
                                                                                
           IF WKM-TAX-EXEMPT-IND = 'Y'                                          
               MOVE 'N' TO EXCISE-TAX-FLAG-2714                                 
               MOVE 'N' TO EXCISE-TAX-FLAG-3503                                 
               PERFORM UPDSOL76        THRU UPDSOL76-EXIT               CG020821
               GO TO CLCETX33-EXIT.                                             
                                                                                
           IF EXCISE-TAX-FLAG-3527 NOT EQUAL 'Y'                        MKTEXCIS
               GO TO CLCETX33-EXIT.                                     MKTEXCIS
                                                                        MKTEXCIS
           FIND CURRENT MKT-PART.                                       MKTEXCIS
           IF MKTPART-EXCISE EMPTY                                      MKTEXCIS
               GO TO CLCETX33-EXIT.                                     MKTEXCIS
                                                                        MKTEXCIS
           MOVE SPACES TO WK-FET-DATE.                                  52845   
                                                                                
           IF USA-CUSTOMER                AND                           C00262  
              TRNS-TYPE-CODE-3510 = 'RT'  AND                           C00262  
              PRICE-DATE-3503 > SPACES                                  C00262  
             IF PRICE-DATE-3503(1:2) >  '90'                            C00262  
               MOVE '19' TO WK-FET-CN                                   C00262  
             ELSE                                                       C00262  
               MOVE '20' TO WK-FET-CN                                   C00262  
             END-IF                                                     C00262  
             MOVE PRICE-DATE-3503 TO WK-FET-YMD                         C00262  
             MOVE WK-FET-DATE TO WK-FED-EXCISE-TAX-EFF-DATE             C00262  
           ELSE                                                         C00262  
             IF AVP-INV-DATE (1:2) >  '90'                              MKTEXCIS
               MOVE '19' TO WK-FET-CN                                   52845   
             ELSE                                                       52845   
               MOVE '20' TO WK-FET-CN                                   52845   
             END-IF                                                     C00262  
             MOVE AVP-INV-DATE TO WK-FET-YMD                            52845   
             MOVE WK-FET-DATE TO WK-FED-EXCISE-TAX-EFF-DATE.                    
                                                                                
           OBTAIN LAST FED-EXCISE-TAX WITHIN MKTPART-EXCISE             MKTEXCIS
             ON DB-END-OF-SET                                           MKTEXCIS
                 GO TO CLCETX33-EXIT.                                   MKTEXCIS
                                                                        MKTEXCIS
           MOVE SPACES TO FET-CALC-IND.                                 MKTEXCIS
                                                                        MKTEXCIS
           PERFORM UNTIL DB-END-OF-SET OR FET-CALCULATED                MKTEXCIS
              IF WK-FED-EXCISE-TAX-EFF-DATE <                           MKTEXCIS
                                      FED-EXCISE-TAX-EFF-DATE-8370      MKTEXCIS
                  OBTAIN PRIOR FED-EXCISE-TAX WITHIN MKTPART-EXCISE     MKTEXCIS
                         ON DB-END-OF-SET                               FIXEXCIS
                            NEXT SENTENCE                               FIXEXCIS
                            END-IF                                      FIXEXCIS
              ELSE                                                      MKTEXCIS
                  COMPUTE EXCISE-TAX-AMT-2714 ROUNDED =                 MKTEXCIS
                      QTY-SHIPPED-2714 * FED-EXCISE-TAX-AMT-8370        MKTEXCIS
                  MOVE 'Y' TO FET-CALC-IND                              MKTEXCIS
                  MOVE 'Y' TO EXCISE-TAX-FLAG-2714                      MKTEXCIS
              END-IF                                                    MKTEXCIS
           END-PERFORM.                                                 MKTEXCIS
                                                                                
           IF EXCISE-TAX-AMT-2714 > ZEROS                               MKTEXCIS
               IF UNIT-PRICE-2714 NEGATIVE                              MKTEXCIS
                   COMPUTE EXCISE-TAX-AMT-2714 =                        MKTEXCIS
                       EXCISE-TAX-AMT-2714 * -1.                        MKTEXCIS
                                                                                
       CLCETX33-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
      *----------------------------------------------------------------*CG050119
      *  CALL PRICING MODULE USING PRICE DETAILS FROM ORDER LINE &     *CG050119
      *  DATE SHIPPED.                                                 *CG050119
      *----------------------------------------------------------------*CG050119
       4300-PRICE-LINE  SECTION.                                        CG050119
                                                                        CG050119
           INITIALIZE SAPIP200-PARM-RECORD                              CG050119
                      SAPIP200-PRICE-RECORD.                            CG050119
                                                                        CG050119
           MOVE BILL-TO-BUSINESS-3510        TO WKC-BUSINESS-NUMBER.    CG050119
           MOVE BILL-TO-ADDR-TYPE-3510       TO WKC-ADDR-ID.            CG050119
           OBTAIN FIRST SO-LINE-SCHEDULE WITHIN LINE-SCHEDULE.          CG050119
           MOVE SHIP-TO-BUSINESS-3504  TO BUSINESS-NUMBER-5050.         CG060124
           FIND CALC BUSINESS.                                          CG060124
           PERFORM IDMS-STATUS THRU ISABEX.                             CG060124
           FIND NEXT CUSTOMER WITHIN BUS-ROLE.                          CG060124
           PERFORM IDMS-STATUS THRU ISABEX.                             CG060124
           IF CUSTOMER-OPTIONS NOT EMPTY                                CG050119
              OBTAIN FIRST CUSTOMER-OPTION WITHIN CUSTOMER-OPTIONS      CG050119
              IF OPTION-TYPE-3557             < '6'                     CG050119
                 MOVE SHIP-TO-BUSINESS-3504  TO WKC-BUSINESS-NUMBER     CG050119
                 MOVE SHIP-TO-ADDR-TYPE-3504 TO WKC-ADDR-ID             CG050119
              END-IF                                                    CG050119
           END-IF.                                                      CG050119
           IF CAI-NUMBER-3503                >  SPACES                  CG060124
              IF PRICE-LIST-3503            NOT = SPACES                CG060124
                 MOVE PRICE-LIST-3503        TO WS-CAI-PRICE-LIST       CG060124
              ELSE                                                      CG060124
                 IF APPLIED-PRICE-LIST-3503 NOT = SPACES                CG060124
                    MOVE APPLIED-PRICE-LIST-3503 TO WS-CAI-PRICE-LIST   CG060124
                 ELSE                                                   CG060124
                    MOVE SPACES              TO WS-CAI-PRICE-LIST       CG060124
                 END-IF                                                 CG060124
              END-IF                                                    CG060124
              PERFORM 4350-CAI-PRICE-LIST    THRU 4350-EXIT             CG060124
              MOVE CAI-NUMBER-3503           TO WKC-CAI-NUMBER          CG060124
              MOVE PRECOMT-NAPN-NBR-3503     TO WKC-NAPN-NBR            CG060124
              MOVE WS-CAI-PRICE-LIST         TO WKC-PRICE-LIST          CG060124
           ELSE                                                         CG060124
              MOVE APPLIED-PRICE-LIST-3503   TO WKC-PRICE-LIST          CG060124
           END-IF.                                                      CG060124
           MOVE PLANT-CODE-3510              TO WKC-PLANT-CODE.         CG050119
           MOVE MARKETING-PART-ID-3503       TO WKC-MSPN-NBR.           CG050119
           MOVE ORDER-QTY-3503               TO WKC-ORDER-QTY.          CG050119
           MOVE ORDER-QTY-UOM-3503           TO WKC-ORDER-QTY-UOM.      CG050119
           MOVE DATE-SHIPPED-3515            TO WKC-PRICE-DATE.         CG050119
      ****************************************************************  CG060824
      * THE BELOW LINES HAVE BEEN COMMENTED TO FORCE THE PRICING        CG060824
      * MODULE TO CALCULATE THE PRICE BASED ON THE SHIPPED-DATE,        CG060824
      * RATHER THAN USING THE PARAMETERS FROM THE ORDER-LINE            CG060824
      ****************************************************************  CG060824
      *    MOVE APPLIED-PRICE-PARM-1-3503    TO WKC-PRICE-PARAMETER-1.  CG050119
      *    MOVE APPLIED-PRICE-PARM-2-3503    TO WKC-PRICE-PARAMETER-2.  CG050119
      *    MOVE APPLIED-PRICE-PARM-3-3503    TO WKC-PRICE-PARAMETER-3.  CG050119
      ****************************************************************  CG060824
           MOVE WKC-PLANT-CODE               TO PLANT-CODE-3524.        CG050119
           OBTAIN CALC COE-PLT-CONTROL.                                 CG050119
           IF DB-REC-NOT-FOUND                                          CG050119
              MOVE SPACES                    TO PLANT-CODE-3524         CG050119
              OBTAIN CALC COE-PLT-CONTROL                               CG050119
           END-IF.                                                      CG050119
                                                                        CG050119
           COPY IDMS MODULE SAPIP600-CALL.                              CG050119
                                                                        CG050119
           IF WKC-PRICE-STATUS                = SPACES                  CG050119
              PERFORM 4400-UPDATE-LINE     THRU 4400-EXIT               CG050119
           END-IF.                                                      CG050119
           IF WK-COE-PLT-CNTL-DBKEY > ZEROES                            CG070627
              OBTAIN COE-PLT-CONTROL DB-KEY IS WK-COE-PLT-CNTL-DBKEY    CG070627
           END-IF.                                                      CG070627
                                                                        CG050119
       4300-EXIT.                                                       CG050119
           EXIT.                                                        CG050119
                                                                        CG060124
      ******************************************************************CG060124
      * BUILD THE BLANK PARTS OF THE CAI PRICE LIST                     CG060124
      * BUYING AFFILIATE PRICE GRP/SELLING COMPANY/PRODUCT CATEGORY     CG060124
      ******************************************************************CG060124
       4350-CAI-PRICE-LIST.                                             CG060124
                                                                        CG060124
           IF WS-CAI-PRICE-LIST NOT = SPACES                            CG060124
               GO TO 4350-EXIT                                          CG060124
           END-IF.                                                      CG060124
                                                                        CG060124
           FIND CURRENT CUSTOMER.                                       CG060124
           ACCEPT WS-CUSTOMER-DBKEY FROM CUSTOMER CURRENCY.             CG060124
           PERFORM IDMS-STATUS THRU ISABEX.                             CG060124
      *    FIRST TRY SHIP TO CUSTOMER THEN BILL TO                      CG060124
           MOVE SHIP-TO-BUSINESS-3510  TO BUSINESS-NUMBER-5050.         CG060124
           FIND CALC BUSINESS.                                          CG060124
           PERFORM IDMS-STATUS THRU ISABEX.                             CG060124
           OBTAIN NEXT CUSTOMER WITHIN BUS-ROLE.                        CG060124
           PERFORM IDMS-STATUS THRU ISABEX.                             CG060124
           IF EXPT-AFFIL-PRICE-GROUP-3501 = SPACES                      CG060124
              MOVE BILL-TO-BUSINESS-3510  TO BUSINESS-NUMBER-5050       CG060124
              FIND CALC BUSINESS                                        CG060124
              PERFORM IDMS-STATUS THRU ISABEX                           CG060124
              OBTAIN NEXT CUSTOMER WITHIN BUS-ROLE                      CG060124
              PERFORM IDMS-STATUS THRU ISABEX                           CG060124
              MOVE EXPT-AFFIL-PRICE-GROUP-3501 TO                       CG060124
                   WS-CAI-AFFIL-PRICE-GROUP                             CG060124
           ELSE                                                         CG060124
               MOVE EXPT-AFFIL-PRICE-GROUP-3501 TO                      CG060124
                    WS-CAI-AFFIL-PRICE-GROUP                            CG060124
           END-IF.                                                      CG060124
      *    RESET CUSTOMER CURRENCY                                      CG060124
           OBTAIN CUSTOMER DB-KEY WS-CUSTOMER-DBKEY.                    CG060124
                                                                        CG060124
       4350-EXIT.                                                       CG060124
           EXIT.                                                        CG060124
                                                                        CG050119
      *----------------------------------------------------------------*CG050119
      *  UPDATE SALES ORDER LINE WITH THE NEW PRICE DETAILS.           *CG050119
      *----------------------------------------------------------------*CG050119
       4400-UPDATE-LINE SECTION.                                        CG050119
                                                                        CG050119
           OBTAIN CURRENT SALES-ORDER-LINE.                             CG050119
           IF WKCM-APPLIED-PRICE-LIST NOT = APPLIED-PRICE-LIST-3503     CG050119
              MOVE WKCM-APPLIED-PRICE-LIST TO PRICE-LIST-3503           CG050119
                                              APPLIED-PRICE-LIST-3503   CG050119
           END-IF.                                                      CG050119
                                                                        CG050119
           IF WKCM-APPLIED-PRICE-PARM-1 NOT = APPLIED-PRICE-PARM-1-3503 CG050119
              MOVE WKCM-APPLIED-PRICE-PARM-1 TO PRICE-PARAMETER-3503(1) CG050119
                                             APPLIED-PRICE-PARM-1-3503  CG050119
           END-IF.                                                      CG050119
                                                                        CG050119
           IF WKCM-APPLIED-PRICE-PARM-2 NOT = APPLIED-PRICE-PARM-2-3503 CG050119
              MOVE WKCM-APPLIED-PRICE-PARM-2 TO PRICE-PARAMETER-3503(2) CG050119
                                             APPLIED-PRICE-PARM-2-3503  CG050119
           END-IF.                                                      CG050119
                                                                        CG050119
           IF WKCM-APPLIED-PRICE-PARM-3 NOT = APPLIED-PRICE-PARM-3-3503 CG050119
              MOVE WKCM-APPLIED-PRICE-PARM-3 TO PRICE-PARAMETER-3503(3) CG050119
                                             APPLIED-PRICE-PARM-3-3503  CG050119
           END-IF.                                                      CG050119
                                                                        CG050119
           COMPUTE ORDER-AMT-3503 ROUNDED =                             CG050119
                   WKC-UNIT-PRICE * ORDER-QTY-3503.                     CG050119
           COMPUTE UNIT-PRICE-3503 ROUNDED =                            CG050119
                   WKC-UNIT-PRICE * 1.                                  CG050119
                                                                        CG050119
           MOVE WKCM-BONUS-FLAG      TO BONUS-FLAG-3503.                CG050119
           MOVE WKCM-UNITS-FLAG      TO UNITS-FLAG-3503.                CG050119
           MOVE WKCM-COOP-FLAG       TO COOP-FLAG-3503.                 CG050119
           MOVE WKCM-TRAINING-FLAG   TO TRAINING-FLAG-3503.             CG050119
           MOVE WKCM-EQUIP-PLUS-FLAG TO EQUIP-PLUS-FLAG-3503.           CG050119
           MOVE WKCM-SERV-PLUS-FLAG  TO SERV-PLUS-FLAG-3503.            CG050119
           MOVE WKCM-BONUS-FLAG-ONE  TO BONUS-FLAG-ONE-3503.            CG050119
           MOVE WKCM-BONUS-FLAG-TWO  TO BONUS-FLAG-TWO-3503.            CG050119
           MOVE WKCM-OVERBILL-FLAG   TO OVERBILL-FLAG-3503.             CG050119
           MOVE 'SABGP380'           TO ANALYST-3503.                   CG050119
           MOVE WS-CURRENT-DATE-YYMMDD                                  CG050119
                                     TO DATE-LAST-ACTIVITY-3503         CG050119
                                        BATCH-REPRICE-DATE-3503         CG050119
                                        LAST-REPRICE-DATE-3503          CG050119
                                        ORDER-STATUS-DATE-3503.         CG050119
           MOVE WKC-PRICE-DATE       TO PRICE-DATE-3503.                CG050119
           MOVE 'Y'                  TO BATCH-REPRICE-FLAG-3503.        CG050119
           MOVE WS-CURRENT-TIME      TO TIME-LAST-ACTIVITY-3503.        CG050119
                                                                        CG050119
           MODIFY SALES-ORDER-LINE.                                     CG050119
                                                                        CG050119
           IF REMISE-DISCOUNTS NOT EMPTY                                CG050119
              FIND FIRST DISC-BY-REMISE WITHIN REMISE-DISCOUNTS         CG050119
              PERFORM UNTIL DB-END-OF-SET                               CG050119
                 ERASE DISC-BY-REMISE                                   CG050119
                 FIND NEXT DISC-BY-REMISE WITHIN REMISE-DISCOUNTS       CG050119
                 ON DB-END-OF-SET                                       CG050119
                    CONTINUE                                            CG050119
                 END-IF                                                 CG050119
              END-PERFORM                                               CG050119
           END-IF.                                                      CG050119
                                                                        CG050119
           PERFORM VARYING WS-SUB    FROM 1 BY 1 UNTIL WS-SUB > 10      CG050119
              IF WKCM-REMISE-CODE                (WS-SUB) NOT = SPACES  CG050119
                 IF WKCM-DISCOUNTED-AMT          (WS-SUB) NOT = 0 OR    CG050119
                    WKCM-PRICE-FACTOR-VALUE      (WS-SUB) NOT = 0 OR    CG050119
                    WKCM-PRICE-FACTOR-SEQ        (WS-SUB)     = 0       CG050119
                    INITIALIZE DISC-BY-REMISE                           CG050119
                    MOVE WKCM-PRICE-FACTOR-SEQ   (WS-SUB) TO            CG050119
                                           PRICE-FACTOR-SEQ-9032        CG050119
                    MOVE WKCM-DISCOUNTED-AMT     (WS-SUB) TO            CG050119
                                           DISCOUNTED-AMT-9032          CG050119
                    MOVE WKCM-REMISE-CODE        (WS-SUB) TO            CG050119
                                           REMISE-CODE-9032             CG050119
                    MOVE WKCM-PRICE-FACTOR-VALUE (WS-SUB) TO            CG050119
                                           PRICE-FACTOR-VALUE-9032      CG050119
                    STORE DISC-BY-REMISE                                CG050119
                 END-IF                                                 CG050119
              END-IF                                                    CG050119
           END-PERFORM.                                                 CG050119
                                                                        CG050119
       4400-EXIT.                                                       CG050119
           EXIT.                                                        CG050119
                                                                        CG050119
       CLCCOM34          SECTION.                                               
      ***********************************************************************   
      * CLCCOM34 - CALCULATE COMMISSION AMOUNT                              *   
      ***********************************************************************   
           MOVE ZEROES TO COMMISSION-AMT-2714.                                  
                                                                                
           IF  COMMISSION-TYPE-3526 = 'P'                                       
               COMPUTE COMMISSION-AMT-2714 ROUNDED =                            
                     ((ITEM-AMT-2714 * COMMISSION-VALUE-3526) / 100)            
           ELSE                                                                 
           IF  COMMISSION-TYPE-3526 = 'A'                                       
               COMPUTE COMMISSION-AMT-2714 ROUNDED =                            
                      (COMMISSION-VALUE-3526 * 1)                               
           ELSE                                                                 
           IF  COMMISSION-TYPE-3526 = 'U'                                       
               IF  UNIT-MEASURE-2714 = ORDER-QTY-UOM-3526                       
                   COMPUTE COMMISSION-AMT-2714 ROUNDED =                        
                          (QTY-SHIPPED-2714 * COMMISSION-VALUE-3526)            
               ELSE                                                             
                   INITIALIZE CASPUOM0-CONVERSION-RECORD                        
                   MOVE UNIT-MEASURE-2714  TO CWK-FROM-UNIT-MEASURE (1)         
                   MOVE ORDER-QTY-UOM-3526 TO CWK-TO-UNIT-MEASURE (1)           
                   MOVE QTY-SHIPPED-2714   TO CWK-FROM-UOM-QTY (1)              
                   PERFORM LNKUOM90                                             
                   COMPUTE COMMISSION-AMT-2714 ROUNDED =                        
                          (CWK-TO-UOM-QTY (1) * COMMISSION-VALUE-3526)          
           ELSE                                                                 
           IF  COMMISSION-TYPE-3527 = 'P'                                       
               COMPUTE COMMISSION-AMT-2714 ROUNDED =                            
                     ((ITEM-AMT-2714 * COMMISSION-VALUE-3527) / 100)            
           ELSE                                                                 
           IF  COMMISSION-TYPE-3527 = 'A'                                       
               COMPUTE COMMISSION-AMT-2714 ROUNDED =                            
                      (COMMISSION-VALUE-3527 * 1)                               
           ELSE                                                                 
           IF  COMMISSION-TYPE-3527 = 'U'                                       
               IF  UNIT-MEASURE-2714 = ORDER-QTY-UOM-3527                       
                   COMPUTE COMMISSION-AMT-2714 ROUNDED =                        
                          (QTY-SHIPPED-2714 * COMMISSION-VALUE-3527)            
               ELSE                                                             
                   INITIALIZE CASPUOM0-CONVERSION-RECORD                        
                   MOVE UNIT-MEASURE-2714  TO CWK-FROM-UNIT-MEASURE (1)         
                   MOVE ORDER-QTY-UOM-3527 TO CWK-TO-UNIT-MEASURE (1)           
                   MOVE QTY-SHIPPED-2714   TO CWK-FROM-UOM-QTY (1)              
                   PERFORM LNKUOM90                                             
                   COMPUTE COMMISSION-AMT-2714 ROUNDED =                        
                          (CWK-TO-UOM-QTY (1) * COMMISSION-VALUE-3527).         
                                                                                
       CLCCOM34-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       LNEDSC35           SECTION.                                              
      ***********************************************************************   
      * LNEDSC35 - CALCULATE INVOICE LINE DISCOUNTS                         *   
      ***********************************************************************   
           MOVE ZEROES               TO DISCOUNT-AMT-2714 (1).                  
           MOVE ZEROES               TO DISCOUNT-AMT-2714 (2).                  
           MOVE ZEROES               TO DISCOUNT-AMT-2714 (3).                  
           MOVE ZEROS                TO QSA-DISCOUNT-AMT-2714.          SDUUD111
           MOVE ZEROS                TO TA-DISCOUNT-AMT-2714.           SDUUD111
           MOVE ZEROES               TO DISCOUNTED-AMT-2714.                    
           MOVE ZEROS                TO WK-TOT-ITEM-DISCOUNT-AMT.               
           MOVE ZEROS                TO WK-EXEMPT-AMT.                          
                                                                                
           MOVE INVOICE-NET-AMT-2714 TO WK-DISCOUNTED-AMT.                      
           MOVE QTY-SHIPPED-2714 TO WK-QTY-SHIPPED.                     UNITDISC
                                                                        IM010705
           IF MARKETING-PART-ID-2714 (1:1) IS NOT NUMERIC               IM010710
              MOVE 0 TO WK-QTY-SHIPPED                                  IM010705
           END-IF.                                                      IM010705
                                                                        IM010705
                                                                                
           MOVE 1                      TO WK-COUNT-DIS.                 CG070914
           PERFORM 1000-GET-TBL-DTL    THRU 1000-EXIT                   CG070914
                                       UNTIL WK-COUNT-DIS > 3.          CG070914
                                                                        CG070914
           IF  DISCOUNT-CODE-2714 (1) NOT = SPACES                              
               MOVE DISCOUNT-CODE-2714 (1) TO WK-DISCOUNT-CODE                  
               MOVE ZEROES                 TO WK-DISCOUNT-AMT                   
               PERFORM CLCDSC50                                                 
               MOVE WK-DISCOUNT-AMT        TO DISCOUNT-AMT-2714 (1).            
           IF  DISCOUNT-CODE-2714 (2) NOT = SPACES                              
               MOVE DISCOUNT-CODE-2714 (2) TO WK-DISCOUNT-CODE                  
               MOVE ZEROES                 TO WK-DISCOUNT-AMT                   
               PERFORM CLCDSC50                                                 
               MOVE WK-DISCOUNT-AMT        TO DISCOUNT-AMT-2714 (2).            
           IF  DISCOUNT-CODE-2714 (3) NOT = SPACES                              
               MOVE DISCOUNT-CODE-2714 (3) TO WK-DISCOUNT-CODE                  
               MOVE ZEROES                 TO WK-DISCOUNT-AMT                   
               PERFORM CLCDSC50                                                 
               MOVE WK-DISCOUNT-AMT        TO DISCOUNT-AMT-2714(3).             
           IF  QSA-DISCOUNT-CODE-2714 NOT = SPACES                      SDUUD111
               MOVE QSA-DISCOUNT-CODE-2714 TO WK-DISCOUNT-CODE          SDUUD111
               MOVE ZEROES                 TO WK-DISCOUNT-AMT           SDUUD111
               PERFORM CLCDSC50                                         SDUUD111
               MOVE WK-DISCOUNT-AMT        TO QSA-DISCOUNT-AMT-2714.    SDUUD111
           IF  TA-DISCOUNT-CODE-2714 NOT = SPACES                       SDUUD111
               MOVE TA-DISCOUNT-CODE-2714 TO WK-DISCOUNT-CODE           SDUUD111
               MOVE ZEROES                 TO WK-DISCOUNT-AMT           SDUUD111
               PERFORM CLCDSC50                                         SDUUD111
               MOVE WK-DISCOUNT-AMT        TO TA-DISCOUNT-AMT-2714.     SDUUD111
                                                                                
           COMPUTE WK-TOT-ITEM-DISCOUNT-AMT ROUNDED =                           
                  (DISCOUNT-AMT-2714 (1) +                                      
                   DISCOUNT-AMT-2714 (2) +                                      
                   DISCOUNT-AMT-2714 (3) +                              SDUUD111
                   QSA-DISCOUNT-AMT-2714 +                              SDUUD111
                   TA-DISCOUNT-AMT-2714 ).                              SDUUD111
                                                                                
       LNEDSC35-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
      ******************************************************************CG070914
      *         SPACE OUT DISCOUNT CODE(SPCFRT) IF MODE OF             *CG070914
      *         TRANSPORT = 'TL' OR 'LTL'.                             *CG070914
      ******************************************************************CG070914
       1000-GET-TBL-DTL.                                                CG070914
                                                                        CG070914
           IF DISCOUNT-CODE-2714 (WK-COUNT-DIS) = 'SPCFRT'              CG070914
                                               OR 'STGFRT'              CG070914
              INITIALIZE TABLE-HDR                                      CG070914
              MOVE 'EQUIPSHIPM'        TO TABLE-KEY-8016                CG070914
              FIND CALC TABLE-HDR                                       CG070914
              ON DB-REC-NOT-FOUND                                       CG070914
                 NEXT SENTENCE                                          CG070914
              END-IF                                                    CG070914
                                                                        CG070914
              INITIALIZE TABLE-DETAIL                                   CG070914
              MOVE EQUIPMENT-TYPE-8009 TO ENTRY-CODE-8017               CG070914
              OBTAIN TABLE-DETAIL WITHIN HDR-DETAIL                     CG070914
                                       USING ENTRY-CODE-8017            CG070914
              ON DB-REC-NOT-FOUND                                       CG070914
                 NEXT SENTENCE                                          CG070914
              END-IF                                                    CG070914
                                                                        CG070914
              IF TABLE-DETAIL-DATA-8017 = 'TL' OR 'LTL'                 CG070914
                 MOVE SPACES           TO                               CG070914
                                    DISCOUNT-CODE-2714 (WK-COUNT-DIS)   CG070914
              END-IF                                                    CG070914
           END-IF.                                                      CG070914
           COMPUTE WK-COUNT-DIS ROUNDED = WK-COUNT-DIS + 1.             CG070914
                                                                        CG070914
       1000-EXIT.                                                       CG070914
            EXIT.                                                       CG070914
                                                                        CG070914
       GETTAX37           SECTION.                                              
      ***********************************************************************   
      * GETTAX37 - GET TAX FLAG                                             *   
      ***********************************************************************   
                                                                                
           IF  TAX-PRODUCT-CODE-3526 NOT = SPACES                               
               MOVE TAX-PRODUCT-CODE-3526 TO TAX-PRODUCT-CODE-2714              
           ELSE                                                                 
               MOVE TAX-PRODUCT-CODE-3527 TO TAX-PRODUCT-CODE-2714.             
                                                                                
           IF  TAX-FLAG-3510 = 'N'  OR                                          
               TAX-FLAG-3503 = 'N'  OR                                   TAXMSPN
               WK-HEADER-FLAG = 'N'                                      TAXMSPN
               MOVE 'N' TO TAX-FLAG-2714                                        
           ELSE                                                                 
           IF  TAX-FLAG-3526 = 'N'                                              
               MOVE 'N' TO TAX-FLAG-2714                                        
           ELSE                                                                 
           IF  TAX-FLAG-3527 = 'N'                                              
               MOVE 'N' TO TAX-FLAG-2714.                                       
                                                                                
           IF  TAX-FLAG-2714 = 'Y'                                              
               IF  TAX-FLAG-3510 = 'M'  OR                                      
                   TAX-FLAG-3503 = 'M'                                          
                   MOVE 'M' TO TAX-FLAG-2714                                    
               ELSE                                                             
               IF  TAX-FLAG-3526 NOT = SPACES                                   
                   MOVE TAX-FLAG-3526 TO TAX-FLAG-2714                          
               ELSE                                                             
               IF  TAX-FLAG-3527 NOT = SPACES                                   
                   MOVE TAX-FLAG-3527 TO TAX-FLAG-2714                          
               ELSE                                                             
                   MOVE 'M' TO TAX-FLAG-2714.                                   
                                                                                
           IF  TAX-FLAG-2714 = 'M'                                              
               IF  SALES-TAX-RATE-2714 (1) = ZEROES  AND                        
                   SALES-TAX-AMT-2714  (1) = ZEROES                             
                   MOVE SALES-TAX-RATE-2712 (1) TO                              
                        SALES-TAX-RATE-2714 (1)                                 
               END-IF                                                           
               IF  SALES-TAX-RATE-2714 (2) = ZEROES  AND                        
                   SALES-TAX-AMT-2714  (2) = ZEROES                             
                   MOVE SALES-TAX-RATE-2712 (2) TO                              
                        SALES-TAX-RATE-2714 (2)                                 
               END-IF                                                           
               IF  SALES-TAX-RATE-2714 (3) = ZEROES  AND                        
                   SALES-TAX-AMT-2714  (3) = ZEROES                             
                   MOVE SALES-TAX-RATE-2712 (3) TO                              
                        SALES-TAX-RATE-2714 (3)                                 
               END-IF                                                           
           ELSE                                                                 
               MOVE ZEROES TO SALES-TAX-RATE-2714 (1)                           
               MOVE ZEROES TO SALES-TAX-RATE-2714 (2)                           
               MOVE ZEROES TO SALES-TAX-RATE-2714 (3)                           
               MOVE ZEROES TO SALES-TAX-AMT-2714 (1)                            
               MOVE ZEROES TO SALES-TAX-AMT-2714 (2)                            
               MOVE ZEROES TO SALES-TAX-AMT-2714 (3).                           
                                                                                
       GETTAX37-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       TAXNEX40           SECTION.                                              
      ***********************************************************************   
      * TAXNEX40 - DETERMINE TAX NEXUS FOR SHIP-TO STATE                    *   
      ***********************************************************************   
           MOVE ' ' TO WK-TAX-FLAG.                                             
                                                                                
           INITIALIZE COE-DEFINITION.                                           
           MOVE '   ' TO COE-DEFINITION-KEY-3523.                               
           OBTAIN CALC COE-DEFINITION.                                          
                                                                                
           INITIALIZE AVP-TAX-RECORD                                            
                      AVP-TAXSEL-PARAMETERS                                     
                      AVP-TAXJURIS-PARAMETERS.                                  
                                                                                
           MOVE RECEIVABLE-ITEM-NUMBER-2712 TO AVP-INVOICE-NO.                  
           MOVE 'N'                         TO AVP-REPORT-INDICATOR.            
           MOVE SPACES                      TO AVP-OVERIDE-GROUP.               
           MOVE '2'                         TO AVP-TAXSEL-PARAMETERS.           
           MOVE FOB-POINT-2712              TO AVP-POT.                         
           MOVE 'END-LINK'                  TO AVP-END-LINK.                    
                                                                                
           IF ABNORMAL-DEMAND-FLAG-3503 = 'S'                                   
                MOVE 'S'                    TO AVP-SERVICE-IND.                 
                                                                                
           PERFORM PLTCTL65.                                                    
           PERFORM GETPOA54.                                                    
                                                                                
           MOVE COUNTRY-5004 TO WK-COUNTRY.                                     
                                                                                
           IF WK-COUNTRY-1ST-2BYTES = 'CA'                                      
               MOVE ZIP-CODE-5004 TO AVP-SHIP-FROM-POSTAL                       
               MOVE 'CN' TO AVP-SHIP-FROM-STATE                                 
               MOVE 'CN' TO AVP-FROM-STATE                                      
           ELSE                                                                 
               MOVE STATE-5004                TO AVP-FROM-STATE                 
               MOVE STATE-5004                TO AVP-SHIP-FROM-STATE            
               MOVE ZIP-FIRST-5-5004          TO AVP-SHIP-FROM-ZIP              
               MOVE CITY-5004                 TO AVP-SHIP-FROM-CITY             
               MOVE COUNTY-CODE-5004          TO AVP-SHIP-FROM-COUNTY           
               MOVE GEO-CODE-5004             TO AVP-SHIP-FROM-GEO-CODE.        
                                                                                
           PERFORM PLTCTL63.                                                    
           PERFORM GETPOA54.                                                    
                                                                                
           MOVE COUNTRY-5004 TO WK-COUNTRY.                                     
                                                                                
           IF WK-COUNTRY-1ST-2BYTES = 'CA'                                      
               MOVE ZIP-CODE-5004 TO AVP-POO-POSTAL                             
               MOVE 'CN' TO AVP-POO-STATE                                       
           ELSE                                                                 
               MOVE STATE-5004                  TO AVP-POO-STATE                
               MOVE ZIP-FIRST-5-5004            TO AVP-POO-ZIP                  
               MOVE CITY-5004                   TO AVP-POO-CITY                 
               MOVE COUNTY-CODE-5004            TO AVP-POO-COUNTY               
               MOVE GEO-CODE-5004               TO AVP-POO-GEO-CODE.            
                                                                                
           PERFORM PLTCTL64.                                                    
           PERFORM GETPOA54.                                                    
                                                                                
           MOVE COUNTRY-5004 TO WK-COUNTRY.                                     
                                                                                
           IF WK-COUNTRY-1ST-2BYTES = 'CA'                                      
               MOVE ZIP-CODE-5004 TO AVP-POA-POSTAL                             
               MOVE 'CN' TO AVP-POA-STATE                                       
           ELSE                                                                 
               MOVE STATE-5004                  TO AVP-POA-STATE                
               MOVE ZIP-FIRST-5-5004            TO AVP-POA-ZIP                  
               MOVE CITY-5004                   TO AVP-POA-CITY                 
               MOVE COUNTY-CODE-5004            TO AVP-POA-COUNTY               
               MOVE GEO-CODE-5004               TO AVP-POA-GEO-CODE.            
                                                                                
           PERFORM PLTCTL65.                                                    
                                                                                
      *      CUSTOMER REFERENCES ARE FOR SHIP-TO                        BILTOEXM
           PERFORM GETSTA54.                                              EXPORT
           MOVE SHIP-TO-BUSINESS-2712       TO AVP-CUST-NO.               EXPORT
                                                                                
           MOVE 'N' TO WK-SALES-TAX-EXMPTN-FLAG.                        BILTOEXM
           MOVE WK3-DB-KEY (7) TO WK-DB-KEY.                            BILTOEXM
                                                                                
           IF CUS-TAX-EXEMPT IS NOT EMPTY                               BILTOEXM
               MOVE 'Y' TO WK-SALES-TAX-EXMPTN-FLAG.                    BILTOEXM
                                                                                
      *      CUSTOMER REFERENCES ARE FOR BILL-TO                        BILTOEXM
           MOVE CUSTOMER-NUMBER-2712 TO BUSINESS-NUMBER-5050.            REASON 
           FIND CALC BUSINESS.                                          CG030410
           OBTAIN FIRST CUSTOMER WITHIN BUS-ROLE.                        REASON 
           ACCEPT WK3-DB-KEY (5) FROM CUSTOMER CURRENCY.                BILTOEXM
                                                                                
           MOVE CUSTOMER-NUMBER-3501 TO WK-CUST-NBR.                            
                                                                                
           IF WK-SALES-TAX-EXMPTN-FLAG = 'N'                            BILTOEXM
               IF CUS-TAX-EXEMPT IS NOT EMPTY                           BILTOEXM
                   MOVE WK3-DB-KEY (5) TO WK-DB-KEY                     BILTOEXM
                   MOVE 'Y' TO WK-SALES-TAX-EXMPTN-FLAG.                BILTOEXM
                                                                                
      *    THE FOLLOWING CHECKS FOR AFFILIATES (003) OR EXPORTS (01)            
      *    OR HOUSTON                                                           
                                                                                
           IF (CUST-SUB-CHNL-3501 = '003') OR                                   
              (CUST-CHNL-3501 = '01' OR '14' OR '16') OR                C00419  
               WK-CUST-COUNTRY = '9'                                            
               MOVE ZEROS TO AVP-ZIPCODE                                        
                             AVP-ZIPCODE-EXT                              ZIP9  
                             WK-ZIP-CODE                                  ZIP9  
               MOVE '53'  TO AVP-ST-CODE                                        
               GO TO TAXNEX40-EXIT.                                             
                                                                                
           MOVE SPACES TO WK-AVP-NUMERIC-COUNTY.                                
           MOVE SPACES                 TO WS-DROP-TO-ST-COUNTY.         CG100715
           MOVE COUNTRY-5004 TO WK-COUNTRY.                                     
                                                                                
           IF CANADIAN-CUSTOMER                                           CANTAX
               MOVE SPACES TO AVP-LOCAL-NAME                                    
               MOVE ZIP-CODE-5004 TO AVP-POSTAL                                 
               MOVE ZIP-CODE-5004 TO WK-ZIP-CODE                           ZIP9 
               MOVE 'CN' TO AVP-ST-CODE                                         
               MOVE STATE-5004 TO WK-TAXABLE-PROV-CODE                          
               MOVE 'CN' TO AVP-SHIP-TO-STATE                                   
               MOVE ZIP-CODE-5004 TO AVP-SHIP-TO-POSTAL                         
           ELSE                                                                 
               MOVE STATE-5004              TO AVP-ST-CODE                      
               MOVE ZIP-FIRST-5-5004        TO AVP-ZIPCODE                      
               MOVE ZIP-FIRST-5-5004        TO WK-ZIP-FIRST-5              ZIP9 
               MOVE ZIP-LAST-4-5004         TO AVP-ZIPCODE-EXT                  
               MOVE ZIP-LAST-4-5004         TO WK-ZIP-LAST-4               ZIP9 
               MOVE CITY-5004               TO AVP-LOCAL-NAME                   
               MOVE SPACES                  TO AVP-NUMERIC-COUNTY         PERIOD
               MOVE COUNTY-CODE-5004        TO WK-AVP-NUMERIC-COUNTY      PERIOD
                                               WS-DROP-TO-ST-COUNTY     CG100715
               MOVE GEO-CODE-5004           TO AVP-GEO-CODE                     
               MOVE STATE-5004              TO AVP-SHIP-TO-STATE                
               MOVE ZIP-FIRST-5-5004        TO AVP-SHIP-TO-ZIP                  
               MOVE CITY-5004               TO AVP-SHIP-TO-CITY                 
               MOVE COUNTY-CODE-5004        TO AVP-SHIP-TO-COUNTY               
               MOVE GEO-CODE-5004           TO AVP-SHIP-TO-GEO-CODE             
               MOVE SPACES                  TO WK-TAXABLE-PROV-CODE.            
                                                                                
           PERFORM GETCLM41.                                                    
                                                                                
      ***************************************************************** P66279  
      *  WHEN THE SHIP-TO IS OUTSIDE THE COUNTRY IN US TERRITORIES AND  P66279  
      *  THE CUSTOMER CLASSIFICATION IS DOMESTIC, TREAT AS AN EXPORT SO P66279  
      *  TAX IS NOT CALCULATED. PASS INTERNATIONAL ('53') STATE CODE TO P66279  
      *  AVP.                                                           P66279  
      ***************************************************************** P66279  
           IF AVP-ST-CODE = 'VI' OR 'MP' OR 'GU' OR 'AS' OR             CG061009
                            'PW' OR 'AA' OR 'AE' OR 'AP'                P66279  
               MOVE ZEROS TO AVP-ZIPCODE                                P66279  
                             AVP-ZIPCODE-EXT                            P66279  
                             WK-ZIP-CODE                                P66279  
               MOVE SPACES             TO AVP-NUMERIC-COUNTY            CG100715
               MOVE '53'  TO AVP-ST-CODE                                P66279  
               GO TO TAXNEX40-EXIT.                                     P66279  
                                                                        P66279  
                                                                                
      *********************************************************************     
      * THE TAX LAWS STATE THAT IF WE HAVE A SALESMAN THAT RESIDES IN NEW       
      * MEXICO, THEN WE ARE OBLIGATED TO CHARGE TAX WHERE HE RESIDES, NO        
      * MATTER WHERE THE PURCHASE WAS MADE IN THE STATE; THEREFORE, FOR         
      * STATE CODE 'NM' THE ZIP CODE WILL ALWAYS BE OVERRIDDEN AS 87124.CG050801
      *********************************************************************     
                                                                        IM991224
           IF AVP-ST-CODE = 'NM'                                        IM991224
             IF ((AVP-SHIP-FROM-STATE NOT  = 'NM')                      CG120823
             AND (WK9-INVOICE-NUMBER (1:2) = '00'))                     CG120823
               MOVE '87124' TO AVP-ZIPCODE                              CG050801
               MOVE '87124' TO WK-ZIP-FIRST-5                           CG050801
               MOVE '01'    TO AVP-GEO-CODE                             CG050801
               MOVE SPACES TO AVP-ZIPCODE-EXT                           IM991224
                              WK-ZIP-LAST-4                             IM991224
               MOVE SPACES             TO AVP-NUMERIC-COUNTY            CG100715
             END-IF                                                     CG120823
           END-IF.                                                      IM991224
                                                                        54958   
           IF AVP-ST-CODE = 'CA'                                        CG070921
              IF SHIP-PLANT-CODE-2712 = 'U06'                           CG070921
                 MOVE SPACES TO AVP-ZIPCODE-EXT                         54958   
                 MOVE SPACES TO WK-ZIP-LAST-4                           54958   
                 MOVE '91761' TO AVP-ZIPCODE                            54958   
                 MOVE '91761' TO WK-ZIP-FIRST-5                         CG070921
                 MOVE SPACES           TO AVP-NUMERIC-COUNTY            CG100715
              ELSE                                                      CG070921
                 IF SHIP-PLANT-CODE-2712 = 'U11'                        CG070921
                    MOVE SPACES        TO AVP-ZIPCODE-EXT               CG070921
                    MOVE SPACES        TO WK-ZIP-LAST-4                 CG070921
                    MOVE '92374'       TO AVP-ZIPCODE                   CG070921
                                          WK-ZIP-FIRST-5                CG070921
                    MOVE SPACES        TO AVP-NUMERIC-COUNTY            CG100715
                 END-IF                                                 CG070921
              END-IF                                                    CG070921
           END-IF.                                                      CG070921
                                                                                
           PERFORM GETDAT42.                                                    
                                                                                
           MOVE AVP-INV-DATE       TO WS-QC-WASTE-TAX-DATE              IM991124
           IF CANADIAN-CUSTOMER AND WK-TAXABLE-PROV-CODE = 'QC'         IM991124
              MOVE WS-QC-TAXDATE   TO AVP-INV-DATE                      IM991124
           END-IF.                                                      IM991124
                                                                                
           PERFORM GETADM43.                                                    
                                                                                
           IF AVP-STATE-NOT-FOUND                                       P84943  
             GO TO TAXNEX40-EXIT.                                       P84943  
                                                                        PASSERR 
      *      WSTEXM46: CUSTOMER REFERENCES ARE FOR EXEMPT CUSTOMER.     BILTOEXM
      *                MAY BE BILL-TO OR SHIP-TO                        BILTOEXM
           PERFORM WSTEXM46.                                             WASTEXM
                                                                                
           IF WK-COUNTRY = 'USA'                                        CG050812
              IF SALES-TAX-CITY-8243     > SPACES                       CG050812
              OR CITY-5004               > SPACES                       CG050812
                 PERFORM 0032M-CITY-TAX-EXEMPTIONS THRU 0032M-EXIT      CG050812
              END-IF                                                    CG050812
           END-IF.                                                      CG050812
                                                                                
       TAXNEX40-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       GETCLM41          SECTION.                                               
      ***********************************************************************   
      * GETCLM41 - GET CLAIMS TAXABLE STATE AND ZIP                         *   
      ***********************************************************************   
                                                                                
                                                                                
           FIND SHIPMENT-HEADER DB-KEY IS WK3-DB-KEY (2).                       
           INITIALIZE SOHEXT.                                                   
                                                                                
           OBTAIN OWNER WITHIN ORDER-SHIPMENTS.                                 
           OBTAIN FIRST SOHEXT WITHIN SO-HDR-EXT                                
                  ON DB-END-OF-SET                                              
                    GO TO GETCLM41-EXIT.                                        
                                                                                
           IF USA-CUSTOMER                                              CG100715
                                                                        CG100715
              INITIALIZE TABLE-HDR                                      CG100715
              INITIALIZE TABLE-DETAIL                                   CG100715
              MOVE 'TRANSTYPE'         TO TABLE-KEY-8016                CG100715
              FIND   CALC TABLE-HDR                                     CG100715
              ON DB-REC-NOT-FOUND                                       CG100715
                 NEXT SENTENCE                                          CG100715
              END-IF                                                    CG100715
                                                                        CG100715
              IF DB-STATUS-OK                                           CG100715
                 MOVE SPACES           TO ENTRY-CODE-8017               CG100715
                 MOVE TRNS-TYPE-CODE-3510                               CG100715
                                       TO ENTRY-CODE-8017               CG100715
                                                                        CG100715
      *       CHECK THE TYPE OF TRANSACTION FOR COUNTY CALCULATION     *CG100715
      *       FROM TABLE TABLE-HDR.                                    *CG100715
      *       IF FOUND IN TABLE-HDR, IDENTIFY AS SPECIAL TRANSACTION   *CG100917
      *       ELSE IDENTIFY AS NORMAL TRANSACTION                      *CG100917
                 OBTAIN TABLE-DETAIL WITHIN HDR-DETAIL                  CG100715
                                     USING ENTRY-CODE-8017              CG100715
                 ON DB-REC-NOT-FOUND                                    CG100715
                    MOVE 'N'           TO WS-KIND-OF-TRANSACTION        CG100917
                 END-IF                                                 CG100715
                                                                        CG100715
                 IF DB-STATUS-OK                                        CG100715
                    MOVE 'S'           TO WS-KIND-OF-TRANSACTION        CG100917
                 END-IF                                                 CG100715
           END-IF.                                                      CG100715
                                                                        CG100715
           IF USA-CUSTOMER                                              CG100715
              IF ORIG-INV-NBR-8243 EQUAL TO SPACES OR LOW-VALUES        CG100715
                 EVALUATE SLS-TAX-USING-FLAG-8243                       CG100715
                 WHEN ' '                                               CG100715
                   MOVE WS-DROP-TO-ST-COUNTY                            CG100715
                                       TO AVP-NUMERIC-COUNTY            CG100715
                 WHEN '1'                                               CG100715
                   IF RECEIVABLE-ITEM-TYPE-2712 = 'D'                   CG100715
                   OR RECEIVABLE-ITEM-TYPE-2712 = 'C'                   CG100715
                         MOVE SHIP-TO-BUSINESS-3510                     CG100715
                                       TO BUSINESS-NUMBER-5050          CG100715
                   ELSE                                                 CG100715
                         NEXT SENTENCE                                  CG100715
                   END-IF                                               CG100715
                   FIND CALC BUSINESS                                   CG100715
                   ON DB-REC-NOT-FOUND                                  CG100715
                         NEXT SENTENCE                                  CG100715
                   END-IF                                               CG100715
                   IF DB-STATUS-OK                                      CG100715
                      MOVE 'A'         TO ADDR-ID-5005                  CG100715
                      OBTAIN ADDRSS-ID WITHIN BUS-ADDRID                CG100715
                                       USING ADDR-ID-5005               CG100715
                       ON DB-REC-NOT-FOUND                              CG100715
                             NEXT SENTENCE                              CG100715
                       END-IF                                           CG100715
                       IF DB-STATUS-OK                                  CG100715
                          OBTAIN OWNER WITHIN ADDR-ADDRID               CG100715
                          ON DB-REC-NOT-FOUND                           CG100715
                                NEXT SENTENCE                           CG100715
                          END-IF                                        CG100715
                          IF DB-STATUS-OK                               CG100715
                             MOVE COUNTY-CODE-5004                      CG100715
                                       TO AVP-NUMERIC-COUNTY            CG100715
                             MOVE STATE-5004                            CG100715
                                       TO AVP-ST-CODE                   CG100715
                             MOVE ZIP-FIRST-5-5004                      CG100715
                                       TO AVP-ZIPCODE                   CG100715
                             MOVE ZIP-LAST-4-5004                       CG100715
                                       TO AVP-ZIPCODE-EXT               CG100715
                          END-IF                                        CG100715
                       END-IF                                           CG100715
                   END-IF                                               CG100715
                 WHEN '2'                                               CG100715
                   IF RECEIVABLE-ITEM-TYPE-2712 = 'D'                   CG100715
                      IF NORMAL-TRANSACTION                             CG100715
                         MOVE PARTNER-NUMBER-3510                       CG100715
                                       TO BUSINESS-NUMBER-5050          CG100715
                      ELSE                                              CG100715
                         MOVE SHIP-TO-BUSINESS-3510                     CG100715
                                       TO BUSINESS-NUMBER-5050          CG100715
                      END-IF                                            CG100715
                   END-IF                                               CG100715
                   IF RECEIVABLE-ITEM-TYPE-2712 = 'C'                   CG100715
                      IF NORMAL-TRANSACTION                             CG100715
                         MOVE SHIP-TO-BUSINESS-3510                     CG100715
                                       TO BUSINESS-NUMBER-5050          CG100715
                      ELSE                                              CG100715
                         MOVE PARTNER-NUMBER-3510                       CG100715
                                       TO BUSINESS-NUMBER-5050          CG100715
                      END-IF                                            CG100715
                   END-IF                                               CG100715
                   FIND CALC BUSINESS                                   CG100715
                   ON DB-REC-NOT-FOUND                                  CG100715
                         NEXT SENTENCE                                  CG100715
                   END-IF                                               CG100715
                   IF DB-STATUS-OK                                      CG100715
                      MOVE 'A'         TO ADDR-ID-5005                  CG100715
                      OBTAIN ADDRSS-ID WITHIN BUS-ADDRID                CG100715
                                       USING ADDR-ID-5005               CG100715
                       ON DB-REC-NOT-FOUND                              CG100715
                             NEXT SENTENCE                              CG100715
                       END-IF                                           CG100715
                       IF DB-STATUS-OK                                  CG100715
                          OBTAIN OWNER WITHIN ADDR-ADDRID               CG100715
                          ON DB-REC-NOT-FOUND                           CG100715
                                NEXT SENTENCE                           CG100715
                          END-IF                                        CG100715
                          IF DB-STATUS-OK                               CG100715
                             MOVE COUNTY-CODE-5004                      CG100715
                                       TO AVP-NUMERIC-COUNTY            CG100715
                             MOVE STATE-5004                            CG100715
                                       TO AVP-ST-CODE                   CG100715
                             MOVE ZIP-FIRST-5-5004                      CG100715
                                       TO AVP-ZIPCODE                   CG100715
                             MOVE ZIP-LAST-4-5004                       CG100715
                                       TO AVP-ZIPCODE-EXT               CG100715
                          END-IF                                        CG100715
                       END-IF                                           CG100715
                   END-IF                                               CG100715
                 WHEN '3'                                               CG100715
                   MOVE SPACES         TO AVP-NUMERIC-COUNTY            CG100715
                 WHEN OTHER                                             CG100715
                   MOVE SPACES         TO AVP-NUMERIC-COUNTY            CG100715
                 END-EVALUATE                                           CG100715
              ELSE                                                      CG100715
                 EVALUATE SLS-TAX-USING-FLAG-8243                       CG100715
                 WHEN ' '                                               CG100715
                   MOVE WS-DROP-TO-ST-COUNTY                            CG100715
                                       TO AVP-NUMERIC-COUNTY            CG100715
                 WHEN '1'                                               CG100715
                      MOVE SPACES      TO WS-ORIG-INV-NBR               CG100715
                      MOVE SPACES      TO WS-NEW-ORD-NBR                CG100917
                      MOVE ORIG-INV-NBR-8243                            CG100715
                                       TO WS-ORIG-INV-NBR               CG100715
                      MOVE  ORDER-NUMBER-3510                           CG100917
                                       TO WS-NEW-ORD-NBR                CG100917
                      MOVE ORIG-INV-NBR-8243                            CG100917
                                       TO WS-TEXT-KEY                   CG100917
                      PERFORM GTINVEXT                                  CG100917
                                                                        CG100715
                                                                        CG100715
                      IF WS-TEXT-ST-CHANGE-FLAG = 'Y'                   CG100715
                      AND WS-ORIG-PREFIX (1:1)                          CG100917
                                        EQUAL TO WS-NEW-PREFIX          CG100917
                         MOVE WS-TEXT-NEW-SHP-TO                        CG100715
                                       TO BUSINESS-NUMBER-5050          CG100715
                         FIND CALC BUSINESS                             CG100715
                         ON DB-REC-NOT-FOUND                            CG100715
                            CONTINUE                                    CG100715
                         END-IF                                         CG100715
                         IF DB-STATUS-OK                                CG100715
                            MOVE 'A'   TO ADDR-ID-5005                  CG100715
                            OBTAIN ADDRSS-ID WITHIN BUS-ADDRID          CG100715
                                             USING ADDR-ID-5005         CG100715
                            ON DB-REC-NOT-FOUND                         CG100715
                               CONTINUE                                 CG100715
                            END-IF                                      CG100715
                             IF DB-STATUS-OK                            CG100715
                                OBTAIN OWNER WITHIN ADDR-ADDRID         CG100715
                                ON DB-REC-NOT-FOUND                     CG100715
                                   CONTINUE                             CG100715
                                END-IF                                  CG100715
                                IF DB-STATUS-OK                         CG100715
                                   MOVE COUNTY-CODE-5004                CG100715
                                             TO AVP-NUMERIC-COUNTY      CG100715
                                   MOVE STATE-5004                      CG100715
                                             TO AVP-ST-CODE             CG100715
                                   MOVE ZIP-FIRST-5-5004                CG100715
                                             TO AVP-ZIPCODE             CG100715
                                   MOVE ZIP-LAST-4-5004                 CG100715
                                             TO AVP-ZIPCODE-EXT         CG100715
                                ELSE                                    CG100715
                                   NEXT SENTENCE                        CG100715
                                END-IF                                  CG100715
                             ELSE                                       CG100715
                                NEXT SENTENCE                           CG100715
                             END-IF                                     CG100715
                         ELSE                                           CG100715
                            NEXT SENTENCE                               CG100715
                         END-IF                                         CG100715
                      ELSE                                              CG100715
                         MOVE WS-TEXT-COUNTY-CODE TO AVP-NUMERIC-COUNTY CG100715
                         MOVE WS-TEXT-STATE-CODE TO AVP-ST-CODE         CG100715
                         MOVE WS-TEXT-ZIP-CODE(1:5)                     CG100715
                                                  TO AVP-ZIPCODE        CG100715
                         MOVE WS-TEXT-ZIP-CODE(6:4)                     CG100715
                                                  TO AVP-ZIPCODE-EXT    CG100715
                      END-IF                                            CG100715
                 WHEN '2'                                               CG100715
                      MOVE ORIG-INV-NBR-8243                            CG100917
                                       TO WS-ORIG-INV-NBR               CG100917
                      MOVE  ORDER-NUMBER-3510                           CG100917
                                       TO WS-NEW-ORD-NBR                CG100917
                      MOVE ORIG-INV-NBR-8243                            CG100917
                                       TO WS-TEXT-KEY                   CG100917
                      PERFORM GTINVEXT                                  CG100917
                                                                        CG100715
                      IF WS-TEXT-ST-CHANGE-FLAG = 'Y'                   CG100715
                      AND WS-ORIG-PREFIX (1:1)                          CG100917
                                        EQUAL TO WS-NEW-PREFIX          CG100917
                         MOVE WS-TEXT-NEW-SHP-TO                        CG100715
                                       TO BUSINESS-NUMBER-5050          CG100715
                         FIND CALC BUSINESS                             CG100715
                         ON DB-REC-NOT-FOUND                            CG100715
                            CONTINUE                                    CG100715
                         END-IF                                         CG100715
                         IF DB-STATUS-OK                                CG100715
                            MOVE 'A'   TO ADDR-ID-5005                  CG100715
                            OBTAIN ADDRSS-ID WITHIN BUS-ADDRID          CG100715
                                             USING ADDR-ID-5005         CG100715
                            ON DB-REC-NOT-FOUND                         CG100715
                               CONTINUE                                 CG100715
                            END-IF                                      CG100715
                             IF DB-STATUS-OK                            CG100715
                                OBTAIN OWNER WITHIN ADDR-ADDRID         CG100715
                                ON DB-REC-NOT-FOUND                     CG100715
                                   CONTINUE                             CG100715
                                END-IF                                  CG100715
                                IF DB-STATUS-OK                         CG100715
                                   MOVE COUNTY-CODE-5004                CG100715
                                             TO AVP-NUMERIC-COUNTY      CG100715
                                   MOVE STATE-5004                      CG100715
                                             TO AVP-ST-CODE             CG100715
                                   MOVE ZIP-FIRST-5-5004                CG100715
                                             TO AVP-ZIPCODE             CG100715
                                   MOVE ZIP-LAST-4-5004                 CG100715
                                             TO AVP-ZIPCODE-EXT         CG100715
                                ELSE                                    CG100715
                                   NEXT SENTENCE                        CG100715
                                END-IF                                  CG100715
                             ELSE                                       CG100715
                                NEXT SENTENCE                           CG100715
                             END-IF                                     CG100715
                         ELSE                                           CG100715
                            NEXT SENTENCE                               CG100715
                         END-IF                                         CG100715
                      ELSE                                              CG100715
                         MOVE WS-TEXT-COUNTY-CODE TO AVP-NUMERIC-COUNTY CG100715
                         MOVE WS-TEXT-STATE-CODE TO AVP-ST-CODE         CG100715
                         MOVE WS-TEXT-ZIP-CODE(1:5)                     CG100715
                                                  TO AVP-ZIPCODE        CG100715
                         MOVE WS-TEXT-ZIP-CODE(6:4)                     CG100715
                                                  TO AVP-ZIPCODE-EXT    CG100715
                      END-IF                                            CG100715
                 WHEN '3'                                               CG100715
                   MOVE SPACES         TO AVP-NUMERIC-COUNTY            CG100715
                 WHEN OTHER                                             CG100715
                   MOVE SPACES         TO AVP-NUMERIC-COUNTY            CG100715
                 END-EVALUATE                                           CG100715
              END-IF                                                    CG100715
           END-IF.                                                      CG100715
                                                                                
           IF SALES-TAX-STATE-CODE-8243 = SPACES                                
               GO TO GETCLM41-EXIT.                                             
                                                                                
           MOVE COUNTRY-5004 TO WK-COUNTRY.                                     
                                                                                
           IF USA-CUSTOMER                                                CANTAX
               MOVE SALES-TAX-STATE-CODE-8243 TO AVP-ST-CODE                    
               MOVE ZIP-FIRST-5-8243 TO AVP-ZIPCODE                             
               MOVE ZIP-FIRST-5-8243 TO WK-ZIP-FIRST-5                     ZIP9 
               MOVE ZIP-LAST-4-8243 TO AVP-ZIPCODE-EXT                          
               MOVE ZIP-LAST-4-8243 TO WK-ZIP-LAST-4                       ZIP9 
               MOVE SPACES TO WK-TAXABLE-PROV-CODE                              
               MOVE SALES-TAX-CITY-8243 TO AVP-LOCAL-NAME               CG100630
               MOVE SPACES TO AVP-GEO-CODE                                      
               GO TO GETCLM41-EXIT.                                             
                                                                                
           MOVE SPACES TO AVP-LOCAL-NAME.                                       
           MOVE SALES-TAX-STATE-CODE-8243 TO WK-TAXABLE-PROV-CODE.              
           MOVE 'CN' TO AVP-ST-CODE.                                            
                                                                                
           IF SALES-TAX-ZIP-CODE-8243 NOT = SPACES                              
               MOVE SALES-TAX-ZIP-CODE-8243 TO AVP-POSTAL                       
               MOVE SALES-TAX-ZIP-CODE-8243 TO WK-ZIP-CODE                 ZIP9 
               GO TO GETCLM41-EXIT.                                             
                                                                                
           MOVE SALES-TAX-STATE-CODE-8243 TO PROV-CODE-8322.                    
           OBTAIN CALC AVP-PROV-ZIP.                                            
           MOVE POSTAL-CODE-8322 TO AVP-POSTAL.                                 
           MOVE POSTAL-CODE-8322 TO WK-ZIP-CODE.                           ZIP9 
                                                                                
       GETCLM41-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
                                                                        CG100917
       GTINVEXT SECTION.                                                CG100917
                                                                        CG100917
           TRANSFER 'SABGP381' LINK USING WS-TEXT-KEY                   CG100917
                                          WS-TEXT-HEADER.               CG100917
                                                                        CG100917
       GTINVEXT-EXIT.                                                   CG100917
           EXIT.                                                        CG100917
                                                                        CG100917
       EJECT                                                            CG100917
                                                                        CG100917
       GETDAT42           SECTION.                                              
      ***********************************************************************   
      * GETDAT42 - DETERMINE TAXABLE DATE                                   *   
      ***********************************************************************   
                                                                                
      *      INVOICE DATE WILL BE THE DEFAULT DATE USED FOR TAXING:             
                                                                                
           MOVE INVOICE-DATE-2712 TO AVP-INV-DATE.                              
                                                                                
      *      DELIVERY RECEIPTS WILL BE TAXED BASED ON THE D/R DATE:             
                                                                                
           IF TRNS-TYPE-CODE-3510 = 'DR' OR 'DU' OR 'DG' OR 'GS' OR     52326   
RFS114           'GU' OR 'MR' OR 'MX' OR 'NA' OR 'NU' OR 'MT' OR 'MV'   IM990405
               OR 'NR' OR 'TS' OR 'TR' OR 'NT' OR 'CC' OR 'CD' OR 'EM'  IM000320
               OR 'OS' OR 'OT'                                          CG060703
               IF FORM-DATE-8243 = SPACES OR LOW-VALUES                 52845   
                   GO TO GETDAT42-EXIT                                  52845   
               END-IF                                                   52845   
               MOVE FORM-DATE-8243 TO WK-FORM-DATE                              
               MOVE WK-FORM-DATE-LAST6 TO AVP-INV-DATE                          
               GO TO GETDAT42-EXIT.                                             
                                                                                
      *      PRIOR DATE WILL BE USED WHENEVER AN ORIGINAL INVOICE NUMBER IS     
      *      AVAILABLE. THE ORIGINAL INVOICE DATE OBTAINED FROM XREF WILL       
      *      WILL BE THE PRIOR DATE USED FOR TAXING:                            
                                                                                
           IF ORIG-INV-NBR-8243 = SPACES                                        
               GO TO GETDAT42-EXIT.                                             
                                                                                
           MOVE ORIG-INV-NBR-8243 TO INVOICE-NUMBER-8275.                       
           OBTAIN CALC INVXREF-INVOICE                                          
                  ON DB-REC-NOT-FOUND                                           
                    GO TO GETDAT42-EXIT.                                        
                                                                                
           MOVE INVOICE-DATE-8275  TO Y2K-WK-DATE1-X.                           
           MOVE Y2K-WK-DATE1-X-YYMMDD TO AVP-INV-DATE.                          
                                                                                
       GETDAT42-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       GETADM43            SECTION.                                             
      ***********************************************************************   
      * GETADM43 - GET ADMINISTRATION CODES FROM TAX MASTER AND SET USE TAX *   
      *            LINKAGE PARMS ACCORDINGLY.                               *   
      ***********************************************************************   
                                                                                
           INITIALIZE TAX.                                                      
           MOVE SPACES TO TAX-KEY-3594.                                         
           MOVE '1' TO TAX-TYPE-IND-3594.                                       
           MOVE ZEROS TO TAX-KEY-STATE-3594.                                    
           MOVE 'S' TO AVP-ST-SALES-USE-IND.                                    
           MOVE 'S' TO WK-AVP-ST-SALES-USE-IND.                         USETAX  
                                                                                
           PERFORM CONSTA44.                                                    
                                                                                
           IF AVP-STATE-NOT-FOUND                                       P84943  
             GO TO GETADM43-EXIT.                                       P84943  
                                                                        PASSERR 
           OBTAIN CALC TAX                                                      
                  ON DB-REC-NOT-FOUND                                           
                    GO TO GETADM43-EXIT.                                        
                                                                                
           IF LOCAL-ADMIN-IND-3594 = '5'                                        
               MOVE 'U' TO AVP-ST-SALES-USE-IND                                 
               MOVE 'U' TO AVP-CN-SALES-USE-IND                                 
               MOVE 'U' TO AVP-LC-SALES-USE-IND                                 
               MOVE 'U' TO AVP-SEC-SALES-USE-IND.                               
                                                                                
       GETADM43-EXIT.                                                           
           EXIT.                                                                
                                                                                
       CONSTA44            SECTION.                                             
      ***********************************************************************   
      * CONSTA44 - CONVERT STATE CODES FROM ALPHA TO NUMERIC                *   
      ***********************************************************************   
                                                                                
           MOVE 'N' TO AVP-STATE-NOT-FOUND-SW.                          P84943  
           MOVE AVP-ST-CODE TO STATE-CODE-8318.                                 
           OBTAIN CALC AVP-STATE-CODE                                   P84943  
             ON DB-REC-NOT-FOUND                                        P84943  
               MOVE 'Y' TO AVP-STATE-NOT-FOUND-SW                       P84943  
               MOVE '01' TO STATUS-CODE-W380                            P84943  
               GO TO CONSTA44-EXIT.                                     P84943  
                                                                        PASSERR 
           MOVE '00' TO STATUS-CODE-W380.                               P84943  
           MOVE STATE-CODE-NBR-8318 TO STATE-3594.                              
                                                                                
       CONSTA44-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       CLCTAX45           SECTION.                                              
      ***********************************************************************   
      * CLCTAX45 - CALCULATE TAX FOR AN INVOICE LINE                        *   
      ***********************************************************************   
                                                                                
      *  MANUAL TAXING                                                          
                                                                                
           IF  TAX-FLAG-2714 = 'M'                                              
               IF  SALES-TAX-RATE-2714 (1) NOT = ZEROES                         
                   COMPUTE SALES-TAX-AMT-2714 (1) ROUNDED =                     
                         ((ITEM-AMT-2714 *                                      
                           SALES-TAX-RATE-2714 (1)) / 100)                      
               END-IF                                                           
               IF  SALES-TAX-RATE-2714 (2) NOT = ZEROES                         
                   COMPUTE SALES-TAX-AMT-2714 (2) ROUNDED =                     
                         ((ITEM-AMT-2714 *                                      
                           SALES-TAX-RATE-2714 (2)) / 100)                      
               END-IF                                                           
               IF  SALES-TAX-RATE-2714 (3) NOT = ZEROES                         
                   COMPUTE SALES-TAX-AMT-2714 (3) ROUNDED =                     
                         ((ITEM-AMT-2714 *                                      
                           SALES-TAX-RATE-2714 (3)) / 100)                      
               END-IF                                                           
               GO TO CLCTAX45-EXIT.                                             
                                                                                
           IF TAX-LEVEL-3527 NOT = SPACES  AND                                  
              TAX-LEVEL-3527 NOT = 'WS'    AND                          CG050812
              TAX-LEVEL-3527 NOT = 'CX'                                 CG050812
               MOVE ZEROS TO AVP-ST-OVERIDE-AMT                                 
               MOVE ZEROS TO AVP-CN-OVERIDE-AMT                                 
               MOVE ZEROS TO AVP-LC-OVERIDE-AMT                                 
               MOVE ZEROS TO AVP-SEC-CN-OVERIDE-AMT                             
               MOVE ZEROS TO AVP-SEC-LC-OVERIDE-AMT                             
               IF STATE-TAX-3527                                                
                 MOVE ITEM-AMT-2714 TO AVP-ST-OVERIDE-AMT                       
               ELSE                                                             
                 IF CNTY-TAX-3527                                               
                   MOVE ITEM-AMT-2714 TO AVP-CN-OVERIDE-AMT                     
                 ELSE                                                           
                   IF LOCAL-TAX-3527                                            
                     MOVE ITEM-AMT-2714 TO AVP-LC-OVERIDE-AMT                   
                   ELSE                                                         
                     IF SEC-CNTY-TAX-3527                                       
                       MOVE ITEM-AMT-2714 TO AVP-SEC-CN-OVERIDE-AMT             
                     ELSE                                                       
                       IF SEC-LOCAL-TAX-3527                                    
                         MOVE ITEM-AMT-2714 TO AVP-SEC-LC-OVERIDE-AMT           
                       ELSE                                             INITOVER
                         NEXT SENTENCE                                  INITOVER
           ELSE                                                         INITOVER
               MOVE SPACES TO AVP-OVERIDE-GROUP.                        INITOVER
                                                                                
           MOVE '1'                   TO AVP-OPTIONAL-FILES.                    
           MOVE ITEM-AMT-2714         TO AVP-GROSS-AMT.                         
                                                                                
      ***************************************************************** IM990410
      * IF THE STATE IS 'TN' (TENNESSEE), MOVE QTY-SHIPPED-2714 TO    * IM990410
      * AVP-ITEM FOR CALCULATING THE CORRECT TAX AMT. THIS DOES NOT   * IM990410
      * APPLY WHEN THE QTY-SHIPPED-2714 > 99999.                      * IM990410
      ***************************************************************** IM990410
           MOVE ZEROS TO AVP-ITEM.                                      IM990410
           IF AVP-ST-CODE = 'TN'                                        IM990410
              IF QTY-SHIPPED-2714 > 0 AND QTY-SHIPPED-2714 < 100000     IM990410
                MOVE QTY-SHIPPED-2714 TO AVP-ITEM                       IM990410
              END-IF                                                    IM990410
           END-IF.                                                      IM990410
                                                                                
           MOVE TAX-PRODUCT-CODE-2714 TO AVP-PRODUCT-CODE.                      
           MOVE ZEROES                TO AVP-STATE-TAX-RATE.                    
           MOVE ZEROES                TO AVP-LOCAL-TAX-RATE.                    
           MOVE ZEROES                TO AVP-COUNTY-TAX-RATE.                   
           MOVE ZEROES                TO AVP-SEC-LC-TAX-RATE.                   
           MOVE ZEROES                TO AVP-SEC-CN-TAX-RATE.                   
           MOVE ZEROES                TO AVP-ST-TAX-AMT.                        
           MOVE ZEROES                TO AVP-LC-TAX-AMT.                        
           MOVE ZEROES                TO AVP-CN-TAX-AMT.                        
           MOVE ZEROES                TO AVP-SEC-LC-TAX-AMT.                    
           MOVE ZEROES                TO AVP-SEC-CN-TAX-AMT.                    
           MOVE ' '                   TO AVP-NO-TAX-IND.                        
           MOVE ' '                   TO AVP-NO-ST-TAX.                         
           MOVE ' '                   TO AVP-NO-CN-TAX.                         
           MOVE ' '                   TO AVP-NO-LC-TAX.                         
                                                                                
           MOVE WK-EXEMPT-AMT TO AVP-EXEMPT-AMT.                                
                                                                                
      *      FOR CANADA THE EXCISE TAX AMOUNT WILL BE ZEROS.                    
                                                                                
           ADD EXCISE-TAX-AMT-2714 TO AVP-GROSS-AMT.                            
           IF AVP-ST-CODE = 'AR' OR                                             
              AVP-ST-CODE = 'IN' OR                                             
              AVP-ST-CODE = 'UT' OR                                             
              AVP-ST-CODE = 'WY' OR                                             
              AVP-ST-CODE = 'MO' OR                                             
              AVP-ST-CODE = 'ND' OR                                             
              AVP-ST-CODE = 'SD'                                                
               ADD EXCISE-TAX-AMT-2714 TO AVP-EXEMPT-AMT.                       
                                                                                
      *      CUSTOMER REFERENCES ARE FOR SHIP-TO CUSTOMER               BILTOEXM
           MOVE SHIP-TO-BUSINESS-2712 TO BUSINESS-NUMBER-5050.          GSTSHPTO
           FIND CALC BUSINESS.                                          GSTSHPTO
           OBTAIN FIRST CUSTOMER WITHIN BUS-ROLE.                       GSTSHPTO
                                                                                
           MOVE CUST-CODE-GROUP-3501 TO WK-CUST-CODE-GROUP.             WASTCUST
                                                                                
           IF AVP-ST-CODE = 'CN'                                                
             MOVE CA-GOODS-SERV-TAX-IND-3501 TO WS-GST-HST              C03338  
             IF CA-GOODS-SERV-TAX-IND-3501 = 'Y'                                
               MOVE 'N' TO AVP-NO-ST-TAX.                                       
                                                                        CG100520
           IF AVP-ST-CODE = 'CN'                                        CG100520
      ******************************************************************CG100520
      * START OF LOGIC: PROVINCE HST ELIGIBILITY CHECK                  CG100520
      * --------------  ------------------------------                  CG100520
      *        CHECK IF PROVINCE IS ELIGIBLE FOR HST CALCULATION        CG100520
      *        IF YES, SET FLAG WS-PROVINCE-ELIGIBILE-FOR-HST           CG100520
      *        NOTE: THIS LOGIC IS APPLICABLE ONLY FOR CANADA CUSTOMERS CG100520
      ******************************************************************CG100520
                                                                        CG100520
              INITIALIZE TABLE-HDR                                      CG100520
              INITIALIZE TABLE-DETAIL                                   CG100520
              MOVE ZEROES              TO WS-CONV-DATE-SHIPPED-YYMMDD   CG100520
              MOVE ZEROES              TO WS-REFERENCE-DATE             CG100520
              MOVE ZEROES              TO WS-COMPARE-DATE               CG100520
              MOVE ZEROES              TO WS-NO-OF-DAYS                 CG100520
              MOVE 'N'                 TO WS-CALC-HST-FLAG              CG100520
              MOVE 'CAHSTTABLE'        TO TABLE-KEY-8016                CG100520
              FIND   CALC TABLE-HDR                                     CG100520
              ON DB-REC-NOT-FOUND                                       CG100520
                 NEXT SENTENCE                                          CG100520
              END-IF                                                    CG100520
                                                                        CG100520
              IF DB-STATUS-OK                                           CG100520
                 MOVE SPACES           TO ENTRY-CODE-8017               CG100520
                 MOVE WK-TAXABLE-PROV-CODE                              CG100520
                                       TO ENTRY-CODE-8017               CG100520
                                                                        CG100520
      *       GET THE REFERENCE DATE FOR TAXABLE PROVINCE              *CG100520
      *                  FROM TABLE TABLE-HDR                          *CG100520
                 OBTAIN TABLE-DETAIL WITHIN HDR-DETAIL                  CG100520
                                     USING ENTRY-CODE-8017              CG100520
                 ON DB-REC-NOT-FOUND                                    CG100520
                    NEXT SENTENCE                                       CG100520
                 END-IF                                                 CG100520
                                                                        CG100520
                 IF DB-STATUS-OK                                        CG100520
                    MOVE TABLE-DETAIL-DATA-8017(1:8)                    CG100520
                                       TO WS-REFERENCE-DATE             CG100520
      *   GET THE FORM DATE IF PRESENT ELSE SHIPPED DATE               *CG100520
      *   IS USED TO COMPARE WITH THE REFERENCE DATE                   *CG100520
                    IF FORM-DATE-8243 NOT = SPACES                      CG100520
                       MOVE FORM-DATE-8243                              CG100520
                                       TO WS-COMPARE-DATE               CG100520
                    ELSE                                                CG100520
                       IF DATE-SHIPPED-3515 NOT = SPACES                CG100520
      *                   CONVERT DATE SHIPPED FROM MMDDYY FORMAT      *CG100520
      *                   INTO CCYYMMDD USING NDR ROUTINE              *CG100520
                          MOVE DATE-SHIPPED-3515                        CG100520
                                       TO WS-CONV-DATE-SHIPPED-YYMMDD   CG100520
                          MOVE SPACES  TO WS-CHECK-BYTE                 CG100520
                          CALL 'NDR8015'                                CG100520
                                       USING WS-CONV-DATE-SHIPPED-YYMMDDCG100520
                                             WS-COMPARE-DATE            CG100520
                                             WS-CHECK-BYTE              CG100520
                          IF WS-CHECK-BYTE NOT = SPACES                 CG100520
                             NEXT SENTENCE                              CG100520
                          END-IF                                        CG100520
                       ELSE                                             CG100520
                          NEXT SENTENCE                                 CG100520
                       END-IF                                           CG100520
                    END-IF                                              CG100520
                                                                        CG100520
      *            COMPARE DATE SHIPPED/FORM-DATE WITH REFERENCE DATE  *CG100520
      *            IF DATE SHIPPED/FORM-DATE IS ON OR AFTER REFERENCE  *CG100520
      *            DATE THEN SET WS-PROVINCE-ELIGIBILE-FOR-HST TO      *CG100520
      *            CALCULATE HST ELSE RETAIN THE PROCESS TO CALCULATE  *CG100520
      *            GST AND PST CALCULATION                             *CG100520
      *            NOTE:                                               *CG100520
      *               1. THIS IS APPLICABLE FOR ONLY CANADA CUSTOMERS  *CG100520
      *               2. NDR ROUTINE COMPARES DATE BY:                 *CG100520
      *            WS-NO-OF-DAYS = WS-COMPARE-DATE - WS-REFERENCE-DATE *CG100520
                                                                        CG100520
                    MOVE SPACES        TO WS-CHECK-BYTE                 CG100520
                    MOVE ZEROES        TO WS-NO-OF-DAYS                 CG100520
                                                                        CG100520
                    CALL 'NDR1165'     USING WS-REFERENCE-DATE          CG100520
                                             WS-COMPARE-DATE            CG100520
                                             WS-NO-OF-DAYS              CG100520
                                             WS-CHECK-BYTE              CG100520
                    IF WS-CHECK-BYTE NOT = SPACES                       CG100520
                        NEXT SENTENCE                                   CG100520
                    ELSE                                                CG100520
                        IF WS-NO-OF-DAYS < 0                            CG100520
                           NEXT SENTENCE                                CG100520
                        ELSE                                            CG100520
                           SET WS-PROVINCE-ELIGIBILE-FOR-HST TO TRUE    CG100520
                        END-IF                                          CG100520
                    END-IF                                              CG100520
                 END-IF                                                 CG100520
              END-IF                                                    CG100520
                                                                        CG100520
           END-IF.                                                      CG100520
                                                                        CG100520
           IF CANADIAN-CUSTOMER                                         C03338  
              IF WK-TAXABLE-PROV-CODE = 'NB'                            CG090624
              OR WK-TAXABLE-PROV-CODE = 'NF'                            CG090624
              OR WK-TAXABLE-PROV-CODE = 'NS'                            CG090624
            COPY IMRGXDT1                                                       
            REPLACING DATE-X BY WK-EFF-FROM.                                    
      *                                                                         
            COPY IMRGXDT2                                                       
            REPLACING DATE-X BY DATE-SHIPPED-2712.                              
               IF Y2K-WK-DATE1-X > '19977031'                                   
                 OR(Y2K-WK-DATE1-X < '19970801'                                 
                    AND Y2K-WK-DATE2-X > '19970331')                            
                 MOVE 'H' TO WS-HST-CUSTOMER                            C03338  
                 IF WS-GST-HST = 'Y'                                    C03338  
                   MOVE 'N' TO WS-HST-CUST                              C03338  
                 ELSE                                                   C03338  
                   MOVE 'Y' TO WS-HST-CUST.                             C03338  
                                                                                
           IF CANADIAN-CUSTOMER                                         CG100520
              IF WS-PROVINCE-ELIGIBILE-FOR-HST                          CG100520
                 MOVE 'H' TO WS-HST-CUSTOMER                            CG100520
                 IF WS-GST-HST = 'Y'                                    CG100520
                   MOVE 'N' TO WS-HST-CUST                              CG100520
                 ELSE                                                   CG100520
                   MOVE 'Y' TO WS-HST-CUST                              CG100520
                 END-IF                                                 CG100520
              END-IF                                                    CG100520
           END-IF.                                                      CG100520
                                                                        CG100520
           IF MULT-PO-FLG-3501 = 'N'                                    P70878  
           AND REVERSE-PO-FLAG-3510 NOT = 'Y'                           C03407  
             PERFORM CUSTPO47.                                          P70878  
                                                                                
           IF CUSTOMER-NUMBER-2712 = '1134807   '                       C02685  
           AND CUST-VEND-REF-NBR-8244 NOT = SPACES                      C02685  
             MOVE CUST-VEND-REF-NBR-8244 TO                             C02685  
                INVOICE-REFERENCE-NUMBER-2700.                          C02685  
                                                                                
           IF AVP-ST-CODE = 'CN'                                        C03338  
           AND WS-HST-CUST = 'Y'                                        C03338  
             MOVE 'N' TO WK-TAX-EXEMPT-IND.                             C03338  
                                                                                
           IF (WK-HOLD-FLAG = 'Y')                                      TAXMSPN 
             AND (WK-TAX-EXEMPT-IND NOT EQUAL 'Y'                       CG050812
              OR  WK-CITY-TAX-EXEMPT-IND NOT EQUAL 'Y')                 CG050812
             AND (WASTE-TAX-FLAG-3503 = 'Y')                            WASTOFLG
             AND (CLAIMS-TYPE-3510 NOT = 'X'                            C02642  
             AND CLAIMS-TYPE-3510 NOT = 'F')                            C02642  
               PERFORM CLCWST48.                                                
                                                                                
           IF (WK-HOLD-FLAG = 'Y')                                      TAXMSPN 
             AND (WK-TAX-EXEMPT-IND NOT EQUAL 'Y'                       CG050812
              OR  WK-CITY-TAX-EXEMPT-IND NOT EQUAL 'Y')                 CG050812
             AND (OSD-FLAG-9101 = 'Y'                                   C02642  
             AND CLAIMS-TYPE-3510 = 'F')                                C02642  
               PERFORM CLCWST48.                                        C02642  
                                                                                
           IF  TAX-FLAG-2714 = 'N'  AND                                 WASTETX3
               TAX-LEVEL-3527 = SPACES                                  WASTETX3
               GO TO CLCTAX45-EXIT.                                     WASTETX3
                                                                                
           IF (ORDER-TYPE-3510 = 'C'                                    C02104  
           AND (CLAIMS-TYPE-3510 NOT = 'W'                              C02104  
           AND CLAIMS-TYPE-3510 NOT = 'X'                               C02104  
           AND CLAIMS-TYPE-3510 NOT = 'F'))                             C02642  
               COMPUTE AVP-GROSS-AMT = AVP-GROSS-AMT * -1                       
               COMPUTE AVP-EXEMPT-AMT = AVP-EXEMPT-AMT * -1.                    
                                                                                
           IF (CLAIMS-TYPE-3510 = 'W'                                   C02104  
           OR CLAIMS-TYPE-3510 = 'X'                                    C02104  
           OR CLAIMS-TYPE-3510 = 'F')                                   C02642  
           AND DEBIT-CREDIT-IND-3503 = 'C'                              C02104  
               COMPUTE AVP-GROSS-AMT = AVP-GROSS-AMT * -1                       
               COMPUTE AVP-EXEMPT-AMT = AVP-EXEMPT-AMT * -1.                    
                                                                                
           IF ORDER-TYPE-3510 = 'C'                                             
           AND AVP-OVERIDE-GROUP NOT = SPACES                                   
           AND (CLAIMS-TYPE-3510 NOT = 'W'                              C02104  
           AND CLAIMS-TYPE-3510 NOT = 'X'                               C02104  
           AND CLAIMS-TYPE-3510 NOT = 'F')                              C02642  
               COMPUTE AVP-ST-OVERIDE-AMT = AVP-ST-OVERIDE-AMT * -1             
               COMPUTE AVP-CN-OVERIDE-AMT = AVP-CN-OVERIDE-AMT * -1             
               COMPUTE AVP-LC-OVERIDE-AMT = AVP-LC-OVERIDE-AMT * -1             
               COMPUTE AVP-SEC-CN-OVERIDE-AMT =                                 
                       AVP-SEC-CN-OVERIDE-AMT * -1                              
               COMPUTE AVP-SEC-LC-OVERIDE-AMT =                                 
                       AVP-SEC-LC-OVERIDE-AMT * -1.                             
                                                                                
           IF (CLAIMS-TYPE-3510 = 'W'                                   C02104  
           OR CLAIMS-TYPE-3510 = 'X'                                    C02104  
           OR CLAIMS-TYPE-3510 = 'F')                                   C02642  
           AND DEBIT-CREDIT-IND-3503 = 'C'                              C02104  
           AND (AVP-OVERIDE-GROUP NOT = SPACES)                         C02104  
               COMPUTE AVP-ST-OVERIDE-AMT = AVP-ST-OVERIDE-AMT * -1             
               COMPUTE AVP-CN-OVERIDE-AMT = AVP-CN-OVERIDE-AMT * -1             
               COMPUTE AVP-LC-OVERIDE-AMT = AVP-LC-OVERIDE-AMT * -1             
               COMPUTE AVP-SEC-CN-OVERIDE-AMT =                                 
                       AVP-SEC-CN-OVERIDE-AMT * -1                              
               COMPUTE AVP-SEC-LC-OVERIDE-AMT =                                 
                       AVP-SEC-LC-OVERIDE-AMT * -1.                             
                                                                                
           MOVE '  ' TO AVP-ERROR-CODE.                                         
                                                                                
           IF AVP-RETREAD-TAX-FLAG = 'Y' AND                            CG031118
              FORM-DATE-8243 NOT = SPACES                               CG031118
              MOVE FORM-DATE-8243 (3:6) TO AVP-INV-DATE                 CG031118
           END-IF.                                                      CG031118
                                                                                
      *    FOR PCV6 PROMOTIONS SABGP310 SHOULD BE EXECUTED.                     
      *    FOR TCV8/CCV5 DEVELOPMENT DICTIONARIES SABGX310 SHOULD BE            
      *    EXECUTED.                                                            
                                                                                
           MOVE SPACES            TO AVP-SEC-COUNTY-CODE.               CG090420
           TRANSFER 'SABGP310' LINK USING                                       
                                    SUBSCHEMA-CTRL                              
                                    TAX                                         
                                    TAX-AUDIT                                   
                                    PRODUCT-CODE                                
                                    ADSO-APPLICATION-GLOBAL-RECORD              
                                    AVP-TAX-RECORD                              
                                    AVP-TAXSEL-PARAMETERS                       
                                    AVP-TAXJURIS-PARAMETERS                     
                                    APPLICATION-REFERENCE-RECORD        AVP144  
                                    TABLE-HDR                           CG031118
                                    TABLE-DETAIL.                       CG031118
                                                                                
           MOVE 'SABGP380' TO PROGRAM-NAME.                                     
                                                                                
           IF (ORDER-TYPE-3510 = 'C'                                            
           AND (CLAIMS-TYPE-3510 NOT = 'W'                              C02104  
           AND CLAIMS-TYPE-3510 NOT = 'X'                               C02104  
           AND CLAIMS-TYPE-3510 NOT = 'F'))                             C02642  
           OR ((CLAIMS-TYPE-3510 = 'W'                                  C02104  
           OR CLAIMS-TYPE-3510 = 'X'                                    C02104  
           OR CLAIMS-TYPE-3510 = 'F')                                   C02642  
           AND DEBIT-CREDIT-IND-3503 = 'C')                             C02104  
               COMPUTE AVP-GROSS-AMT = AVP-GROSS-AMT * -1                       
               COMPUTE AVP-ST-TAX-AMT = AVP-ST-TAX-AMT * -1                     
               COMPUTE AVP-CN-TAX-AMT = AVP-CN-TAX-AMT * -1                     
               COMPUTE AVP-LC-TAX-AMT = AVP-LC-TAX-AMT * -1                     
               COMPUTE AVP-SEC-CN-TAX-AMT = AVP-SEC-CN-TAX-AMT * -1             
               COMPUTE AVP-SEC-LC-TAX-AMT = AVP-SEC-LC-TAX-AMT * -1             
               COMPUTE AVP-EXEMPT-AMT = AVP-EXEMPT-AMT * -1.                    
                                                                                
      *       MUST MOVE ZEROS TO LOCAL OVERIDE AMT SINCE AVP NOW        OVERIDE 
      *       MOVES LOCAL OVERIDE AMT TO COUNTY OVERIDE AMT, THEN       OVERIDE 
      *       SPACES OUT THE LOCAL OVERIDE AMT FOR CANADA.              OVERIDE 
                                                                                
           IF AVP-ST-CODE = 'CN'                                        OVERIDE 
               AND AVP-OVERIDE-GROUP NOT EQUAL SPACES                   OVERIDE 
                   MOVE ZEROS TO AVP-LC-OVERIDE-AMT.                    OVERIDE 
                                                                                
           IF (ORDER-TYPE-3510 = 'C'                                            
           AND AVP-OVERIDE-GROUP NOT = SPACES                                   
           AND (CLAIMS-TYPE-3510 NOT = 'W'                              C02104  
           AND CLAIMS-TYPE-3510 NOT = 'X'                               C02104  
           AND CLAIMS-TYPE-3510 NOT = 'F'))                             C02642  
           OR ((CLAIMS-TYPE-3510 = 'W'                                  C02104  
           OR CLAIMS-TYPE-3510 = 'X'                                    C02104  
           OR CLAIMS-TYPE-3510 = 'F')                                   C02642  
           AND DEBIT-CREDIT-IND-3503 = 'C'                              C02104  
           AND AVP-OVERIDE-GROUP NOT = SPACES)                          C02104  
               COMPUTE AVP-ST-OVERIDE-AMT = AVP-ST-OVERIDE-AMT * -1             
               COMPUTE AVP-CN-OVERIDE-AMT = AVP-CN-OVERIDE-AMT * -1             
               COMPUTE AVP-LC-OVERIDE-AMT = AVP-LC-OVERIDE-AMT * -1             
               COMPUTE AVP-SEC-CN-OVERIDE-AMT =                                 
                       AVP-SEC-CN-OVERIDE-AMT * -1                              
               COMPUTE AVP-SEC-LC-OVERIDE-AMT =                                 
                       AVP-SEC-LC-OVERIDE-AMT * -1.                             
                                                                                
      *********************************************************************     
      * THE FOLLOWING CHECKS THE PRODUCT FOR A PROMOTIONAL/SALES AID      *     
      * CLASSIFICATION, IDENTIFIED BY A '14' IN THE PRODUCT CATEGORY.     *     
      * SALES AIDS ARE ALWAYS SUBJECT TO SALES TAX, REGARDLESS OF WHETHER *     
      * THE CUSTOMER IS EXEMPT FROM TAX OR NOT; THEREFORE, EXEMPTION      *     
      * PROCESSING IS BYPASSED FOR THIS PRODUCT CATEG. CLOTHING IS THE ONE*     
      * TYPE OF SALES AID THAT IS NOT ALWAYS TAXABLE; IT IS TAXABLE       *     
      * DEPENDING ON THE STATE, BUT IS STILL TAXABLE REGARDLESS OF THE    *     
      * CUSTOMER EXEMPTIONS.  CLOTHING WILL BE TAXED AUTOMATICALLY WITH    *    
      * OTHER SALES AIDS; HOWEVER, A TAX PRODUCT CODE WILL SPECIFY WHICH  *     
      * STATES CLOTHING IS TAXABLE IN, AND AT THIS POINT CLOTHING PRODUCTS*     
      * MAY HAVE BEEN EXEMPTED FROM TAX BASED ON THE PRODUCT MATRIX.      *     
      *********************************************************************     
                                                                                
           IF PROD-CATEG-CODE-3527 = '014'                                      
               NEXT SENTENCE                                                    
           ELSE                                                                 
               PERFORM EXEMPT55.                                                
      *      EXEMPT55: CUSTOMER REFERENCES ARE FOR EXEMPT CUSTOMER.     BILTOEXM
      *                MAY BE BILL-TO OR SHIP-TO                        BILTOEXM
                                                                                
           IF AVP-ST-CODE = 'CN'                                        C03338  
           AND (WS-GST-HST = 'Y'                                        C03338  
           OR WS-HST-CUST = 'Y')                                        C03338  
             MOVE 'N' TO AVP-NO-SEC-LC-TAX                              C03338  
                         AVP-NO-SEC-CN-TAX                              C03338  
             IF WS-GST-HST = 'Y'                                        C03338  
               MOVE 'N' TO AVP-NO-LC-TAX                                C03338  
                           AVP-NO-CN-TAX                                C03338  
                           AVP-NO-ST-TAX                                C03338  
             ELSE                                                       C03338  
               MOVE ' ' TO AVP-NO-LC-TAX                                C03338  
                           AVP-NO-CN-TAX                                C03338  
                           AVP-NO-ST-TAX.                               C03338  
                                                                                
           IF  TAX-LEVEL-3527 NOT = SPACES  AND                                 
               TAX-LEVEL-3527 NOT = 'WS'    AND                         CG050812
               TAX-LEVEL-3527 NOT = 'CX'                                CG050812
               MOVE ' ' TO AVP-NO-TAX-IND                                       
                           AVP-NO-ST-TAX                                        
                           AVP-NO-CN-TAX                                        
                           AVP-NO-LC-TAX                                        
                           AVP-NO-SEC-CN-TAX                                    
                           AVP-NO-SEC-LC-TAX.                                   
                                                                                
           IF  AVP-NO-TAX-IND = 'N'                                             
               MOVE 'N' TO TAX-FLAG-2714                                        
               GO TO CLCTAX45-EXIT.                                             
                                                                                
           IF  AVP-NO-ST-TAX  = 'N'   OR                                        
               AVP-NO-CN-TAX  = 'N'   OR                                        
               AVP-NO-LC-TAX  = 'N'                                             
               MOVE 'E' TO TAX-FLAG-2714.                                       
                                                                                
           IF  AVP-NO-ST-TAX       NOT = 'N' AND                                
               AVP-STATE-TAX-RATE  NOT = ZEROES                                 
               MOVE AVP-ST-SALES-USE-IND TO TAX-FLAG-2714                       
               COMPUTE SALES-TAX-RATE-2714 (1) ROUNDED =                        
                      (AVP-STATE-TAX-RATE * 100)                                
               COMPUTE SALES-TAX-AMT-2714 (1) ROUNDED =                         
                       AVP-ST-TAX-AMT * 1.                                      
                                                                                
           IF  AVP-NO-LC-TAX       NOT = 'N' AND                                
               AVP-LOCAL-TAX-RATE  NOT = ZEROES                                 
               MOVE AVP-ST-SALES-USE-IND TO TAX-FLAG-2714                       
               COMPUTE SALES-TAX-RATE-2714 (2) ROUNDED =                        
                       AVP-LOCAL-TAX-RATE * 100                                 
               COMPUTE SALES-TAX-AMT-2714 (2) ROUNDED =                         
                       AVP-LC-TAX-AMT * 1.                                      
                                                                                
           IF  AVP-NO-SEC-LC-TAX   NOT = 'N' AND                                
               AVP-SEC-LC-TAX-RATE NOT = ZEROES                                 
               MOVE AVP-ST-SALES-USE-IND TO TAX-FLAG-2714                       
               COMPUTE SALES-TAX-RATE-2714 (2) ROUNDED =                        
                     ((AVP-LOCAL-TAX-RATE + AVP-SEC-LC-TAX-RATE) * 100)         
               COMPUTE SALES-TAX-AMT-2714 (2) ROUNDED =                         
                     (AVP-LC-TAX-AMT * 1)                                       
               COMPUTE SALES-TAX-AMT-2714 (2) ROUNDED =                         
                     (SALES-TAX-AMT-2714 (2) + AVP-SEC-LC-TAX-AMT).             
                                                                                
           IF  AVP-NO-CN-TAX       NOT = 'N' AND                                
             AVP-COUNTY-TAX-RATE NOT = ZEROES                                   
             MOVE AVP-ST-SALES-USE-IND TO TAX-FLAG-2714                         
             IF WS-HST-CUST = 'Y'                                        C03338 
               COMPUTE SALES-TAX-RATE-2714 (1) ROUNDED =                 C03338 
                 (AVP-COUNTY-TAX-RATE * 100) + SALES-TAX-RATE-2714 (1)   C03338 
               COMPUTE SALES-TAX-AMT-2714 (1) ROUNDED =                  C03338 
                 (AVP-CN-TAX-AMT * 1) + SALES-TAX-AMT-2714 (1)           C03338 
             ELSE                                                        C03338 
               COMPUTE SALES-TAX-RATE-2714 (3) ROUNDED =                        
                      (AVP-COUNTY-TAX-RATE * 100)                               
               COMPUTE SALES-TAX-AMT-2714 (3) ROUNDED =                         
                      (AVP-CN-TAX-AMT * 1).                                     
                                                                                
           IF  AVP-NO-SEC-CN-TAX   NOT = 'N' AND                                
               AVP-SEC-CN-TAX-RATE NOT = ZEROES                                 
               MOVE AVP-ST-SALES-USE-IND TO TAX-FLAG-2714                       
               COMPUTE SALES-TAX-RATE-2714 (3) ROUNDED =                        
                     ((AVP-COUNTY-TAX-RATE + AVP-SEC-CN-TAX-RATE) * 100)        
               COMPUTE SALES-TAX-AMT-2714 (3) ROUNDED =                         
                     (AVP-CN-TAX-AMT * 1)                                       
               COMPUTE SALES-TAX-AMT-2714 (3) ROUNDED =                         
                     (SALES-TAX-AMT-2714 (3) + AVP-SEC-CN-TAX-AMT).             
                                                                                
           IF  AVP-NO-ST-TAX       = 'N'   AND                                  
               AVP-STATE-TAX-RATE  NOT = ZEROES                                 
               COMPUTE SALES-TAX-RATE-2714 (1) ROUNDED =                        
                      (AVP-STATE-TAX-RATE * 100).                               
           IF  AVP-NO-LC-TAX       = 'N'   AND                                  
               AVP-LOCAL-TAX-RATE  NOT = ZEROES                                 
               COMPUTE SALES-TAX-RATE-2714 (2) ROUNDED =                        
                      (AVP-LOCAL-TAX-RATE * 100).                               
           IF  AVP-NO-CN-TAX       = 'N'   AND                                  
               AVP-COUNTY-TAX-RATE NOT = ZEROES                                 
               COMPUTE SALES-TAX-RATE-2714 (3) ROUNDED =                        
                      (AVP-COUNTY-TAX-RATE * 100).                              
           IF  AVP-NO-SEC-LC-TAX       = 'N'   AND                              
               AVP-SEC-LC-TAX-RATE  NOT = ZEROES                                
               COMPUTE SALES-TAX-RATE-2714 (2) ROUNDED =                        
                     ((AVP-SEC-LC-TAX-RATE + AVP-LOCAL-TAX-RATE) * 100).        
           IF  AVP-NO-SEC-CN-TAX       = 'N'   AND                              
               AVP-SEC-CN-TAX-RATE NOT = ZEROES                                 
               COMPUTE SALES-TAX-RATE-2714 (3) ROUNDED =                        
                    ((AVP-SEC-CN-TAX-RATE + AVP-COUNTY-TAX-RATE) * 100).        
                                                                                
       CLCTAX45-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
                                                                                
       WSTEXM46           SECTION.                                       WASTEXM
      ****************************************************************** WASTEXM
      * WSTEXM46 - READ TAX EXEMPTIONS FOR WASTE TAX                     WASTEXM
      ****************************************************************** WASTEXM
                                                                         WASTEXM
      *      CUSTOMER REFERENCES ARE FOR EXEMPT CUSTOMER.               BILTOEXM
      *      MAY BE BILL-TO OR SHIP-TO CUSTOMER PER WK-DB-KEY.          BILTOEXM
                                                                                
           INITIALIZE TAX-EXEMPTION.                                     WASTEXM
           MOVE 'N' TO WK-TAX-EXEMPT-IND.                                WASTEXM
           FIND CUSTOMER DB-KEY IS WK-DB-KEY.                           BILTOEXM
                                                                         WASTEXM
           MOVE 5 TO TAXING-AUTHORITY-3531.                              WASTEXM
           IF AVP-ST-CODE = 'CN'                                         WASTEXM
               MOVE WK-TAXABLE-PROV-CODE TO WK-STATE                     WASTEXM
           ELSE                                                          WASTEXM
               MOVE AVP-ST-CODE TO WK-STATE.                             WASTEXM
           MOVE WK-STATE TO STATE-3531.                                  WASTEXM
                                                                         WASTEXM
           OBTAIN TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT                    WASTEXM
               USING TAX-EXEMPT-ID-3531                                  WASTEXM
                 ON DB-REC-NOT-FOUND                                     WASTEXM
                   OBTAIN NEXT TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT       WASTEXM
                     ON DB-END-OF-SET                                    WASTEXM
                       NEXT SENTENCE.                                    WASTEXM
                                                                         WASTEXM
           PERFORM UNTIL DB-END-OF-SET OR WK-TAX-EXEMPT-IND = 'Y'        WASTEXM
               IF EXPIRATION-DATE-3531 = SPACES                          WASTEXM
                 MOVE HIGH-VALUES TO EXPIRATION-DATE-3531                WASTEXM
               END-IF                                                    WASTEXM
                                                                        CG050812
           COPY IMRGXDT1                                                        
           REPLACING DATE-X BY AVP-INV-DATE.                                    
           COPY IMRGXDT2                                                        
           REPLACING DATE-X BY EXPIRATION-DATE-3531.                            
               IF (Y2K-WK-DATE1-X >= EFF-DATE-3531)  AND                        
                  (Y2K-WK-DATE1-X <= Y2K-WK-DATE2-X) AND                        
                  (STATE-3531 = WK-STATE) AND                                   
                  (TAX-FLAG-3531 = 'W')                                         
                    MOVE 'Y' TO WK-TAX-EXEMPT-IND                               
               END-IF                                                    WASTEXM
               OBTAIN NEXT TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT           WASTEXM
                 ON DB-END-OF-SET                                        WASTEXM
                     NEXT SENTENCE                                       WASTEXM
                 END-IF                                                  WASTEXM
           END-PERFORM.                                                  WASTEXM
                                                                         WASTEXM
       WSTEXM46-EXIT.                                                    WASTEXM
           EXIT.                                                         WASTEXM
                                                                                
       0032M-CITY-TAX-EXEMPTIONS.                                       CG050812
      ******************************************************************CG050812
      * CTYEXM46 - READ TAX EXEMPTIONS FOR CITY  TAX                    CG050812
      ******************************************************************CG050812
                                                                        CG050812
      *      CUSTOMER REFERENCES ARE FOR EXEMPT CUSTOMER.               CG050812
      *      MAY BE BILL-TO OR SHIP-TO CUSTOMER PER WK-DB-KEY.          CG050812
                                                                        CG050812
           INITIALIZE TAX-EXEMPTION.                                    CG050812
           MOVE 'N' TO WK-CITY-TAX-EXEMPT-IND.                          CG050812
           FIND CUSTOMER DB-KEY IS WK-DB-KEY.                           CG050812
                                                                        CG050812
           MOVE 6 TO TAXING-AUTHORITY-3531.                             CG050812
                                                                        CG050812
           MOVE AVP-ST-CODE          TO WK-STATE.                       CG050812
           IF SALES-TAX-CITY-8243 NOT = SPACES                          CG050812
              MOVE SALES-TAX-CITY-8243 TO WK-CITY                       CG050812
           ELSE                                                         CG050812
              MOVE CITY-5004           TO WK-CITY                       CG050812
           END-IF.                                                      CG050812
                                                                        CG050812
           MOVE WK-STATE TO STATE-3531.                                 CG050812
           MOVE WK-CITY  TO CITY-3531.                                  CG050812
                                                                        CG050812
           OBTAIN TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT                   CG050812
               USING TAX-EXEMPT-ID-3531                                 CG050812
                 ON DB-REC-NOT-FOUND                                    CG050812
                   OBTAIN NEXT TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT      CG050812
                     ON DB-END-OF-SET                                   CG050812
                       NEXT SENTENCE.                                   CG050812
                                                                        CG050812
           PERFORM UNTIL DB-END-OF-SET OR WK-CITY-TAX-EXEMPT-IND = 'Y'  CG050812
              IF EXPIRATION-DATE-3531 = SPACES                          CG050812
                 MOVE SPACES      TO Y2K-WK-DATE2-X                     CG050812
              ELSE                                                      CG050812
                 CALL 'NDR8015' USING EXPIRATION-DATE-3531              CG050812
                                      Y2K-WK-DATE2-X                    CG050812
                                      WS-1-BYTE                         CG050812
                 IF WS-1-BYTE NOT = SPACES                              CG050812
                    MOVE SPACES     TO Y2K-WK-DATE2-X                   CG050812
                 END-IF                                                 CG050812
              END-IF                                                    CG050812
                                                                        CG050812
              MOVE SPACES           TO  WS-1-BYTE                       CG050812
              CALL 'NDR8015'     USING  AVP-INV-DATE                    CG050812
                                        Y2K-WK-DATE1-X                  CG050812
                                        WS-1-BYTE                       CG050812
              IF WS-1-BYTE NOT = SPACES                                 CG050812
                 DISPLAY 'AVP-INV-DATE DATE CONV ERROR'                 CG050812
                 MOVE 0010 TO ABORT-RC                                  CG050812
                 CALL 'ILBOABN0' USING ABORT-RC                         CG050812
              END-IF                                                    CG050812
                                                                        CG050812
              IF (Y2K-WK-DATE1-X >= EFF-DATE-3531)  AND                 CG050812
                 (Y2K-WK-DATE1-X <= Y2K-WK-DATE2-X   OR                 CG050812
                  Y2K-WK-DATE2-X  = SPACES        ) AND                 CG050812
                 (CITY-3531  = WK-CITY)             AND                 CG050812
                 (STATE-3531 = WK-STATE)            AND                 CG050812
                 (TAXING-AUTHORITY-3531 = '6')      AND                 CG050812
                 (TAX-FLAG-3531 = 'C')                                  CG050812
                  MOVE 'Y' TO WK-CITY-TAX-EXEMPT-IND                    CG050812
               END-IF                                                   CG050812
                                                                        CG050812
               OBTAIN NEXT TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT          CG050812
                 ON DB-END-OF-SET                                       CG050812
                     NEXT SENTENCE                                      CG050812
                 END-IF                                                 CG050812
           END-PERFORM.                                                 CG050812
                                                                        CG050812
       0032M-EXIT.                                                      CG050812
           EXIT.                                                        CG050812
                                                                                
       CUSTPO47           SECTION.                                              
      ***********************************************************************   
      * CUSTPO47 - OBTAIN SOLEXT RECORD TO GET CUSTOMER-PO-NUMBER           *   
      ***********************************************************************   
                                                                                
           FIND CURRENT SALES-ORDER-LINE.                               P70878  
           OBTAIN NEXT SOLEXT WITHIN SO-LINE-EXT                        P70878  
              ON DB-END-OF-SET                                          P70878  
                GO TO CUSTPO47-EXIT.                                    P70878  
                                                                                
           IF CUSTOMER-PO-NUMBER-8244 NOT EQUAL SPACES                  P76684  
              MOVE CUSTOMER-PO-NUMBER-8244 TO                           P70878  
               INVOICE-REFERENCE-NUMBER-2700.                           P70878  
                                                                        P70878  
       CUSTPO47-EXIT.                                                   P70878  
           EXIT.                                                        P70878  
                                                                                
                                                                                
       CLCWST48           SECTION.                                              
      ***********************************************************************   
      * CLCWST48 - SET UP AND LINK TO WASTE TAX PROGRAM                     *   
      ***********************************************************************   
                                                                                
           INITIALIZE AOBGW004.                                                 
           INITIALIZE WASTE-TAX-RECORD.                                 CG050919
           MOVE STATE-CODE-NBR-8318 TO STATE-CODE-NBR-W004.                     
           IF AVP-ST-CODE = 'CN'                                                
               MOVE WK-TAXABLE-PROV-CODE TO STATE-CODE-W004                     
               MOVE AVP-LOCAL-NAME       TO CITY-W004                           
           ELSE                                                                 
               MOVE AVP-ST-CODE TO STATE-CODE-W004                              
               IF WK-CITY-TAX-EXEMPT-IND  = 'Y'                         CG050812
                  MOVE SPACES          TO CITY-W004                     CG050812
               ELSE                                                     CG050812
                  IF SALES-TAX-CITY-8243 NOT = SPACES                   CG050812
                     MOVE SALES-TAX-CITY-8243                           CG050812
                                       TO CITY-W004                     CG050812
                  ELSE                                                  CG050812
                     MOVE CITY-5004       TO CITY-W004                  CG050812
                  END-IF                                                CG050812
               END-IF                                                   CG050812
           END-IF.                                                      CG050812
                                                                                
           MOVE 'N'                 TO SALES-TAX-EXMPTN-FLAG-W004(1)    CG050812
                                       SALES-TAX-EXMPTN-FLAG-W004(2)    CG050812
                                       SALES-TAX-EXMPTN-FLAG-W004(3).   CG050812
           MOVE AVP-INV-DATE           TO INVOICE-DATE-W004.                    
           IF CANADIAN-CUSTOMER AND WK-TAXABLE-PROV-CODE = 'QC'         IM991124
              MOVE WS-QC-WASTE-TAX-DATE TO INVOICE-DATE-W004            IM991124
           END-IF.                                                      IM991124
           MOVE WK-CUST-CODE-GROUP     TO CUST-CODE-GROUP-W004.                 
           MOVE PROD-CODE-DATA-3527    TO PROD-CODE-DATA-W004.                  
           MOVE MARKETING-PART-ID-2714 TO MARKETING-PART-ID-W004.               
           MOVE ORDER-TYPE-3510        TO ORDER-TYPE-W004.                      
           MOVE CORR-INV-NBR-8243 (1:1) TO RECEIVABLE-ITEM-TYPE-W004.   52326   
                                                                                
      *      CUSTOMER REFERENCES ARE FOR EXEMPT CUSTOMER.               BILTOEXM
      *      MAY BE BILL-TO OR SHIP-TO CUSTOMER PER WK-DB-KEY.          BILTOEXM
           MOVE WK-DB-KEY              TO DB-KEY-W004.                  BILTOEXM
                                                                                
      *  SET FLAG IF CUSTOMER IN NB, NF, OR NS PROVINCES                C03338  
           IF CANADIAN-CUSTOMER                                                 
             MOVE WS-HST-CUSTOMER TO CA-GOODS-SERV-TAX-IND-W004.        C03338  
                                                                                
           MOVE AVP-PRODUCT-CODE       TO AVP-PRODUCT-CODE-W004.                
           MOVE QTY-SHIPPED-2714       TO QTY-SHIPPED-W004.                     
           MOVE TAX-FLAG-2714          TO TAX-FLAG-W004.                        
           MOVE EXCISE-TAX-AMT-2714    TO EXCISE-TAX-AMT-W004.                  
           MOVE WK-AVP-ST-SALES-USE-IND  TO AVP-ST-SALES-USE-IND-W004.  USETAX  
           MOVE TRNS-TYPE-CODE-3510    TO TRNS-TYPE-CODE-W004.          USACHGS 
           MOVE WASTE-TAX-PROD-CODE-3527 TO WASTE-TAX-PROD-CODE-W004.   USACHGS 
           MOVE SUB-ACCOUNT-3510       TO SUB-ACCOUNT-W004.             TRNSTYPE
           MOVE 'Y'                    TO STORE-TYPE-W004.              TRNSTYPE
      ************************************************************      CG050919
      * WASTE TAX EXEMPTION FLAG IS PASSED TO SABGP011           *      CG050919
      * IF FLAG IS 'Y', WASTE TAX CALCULATIONS WILL NOT BE DONE  *      CG050919
      * IF FLAG IS 'N', CUSTOMER IS NOT EXEMPTED AND WASTE TAX   *      CG050919
      * WILL BE CALCULATED.                                      *      CG050919
      ************************************************************      CG050919
           MOVE WK-TAX-EXEMPT-IND      TO WS-WASTE-TAX-EXEMPT-IND.      CG050919
      *                                                                         
      *    GET RIM SIZE OF ALL INVENTORY PARTS TO USE IN WASTE TAX      C00003  
      *    MODULE IF STATE IS NC, OK, OR TX.                            C00003  
                                                                        C00003  
           INITIALIZE STBDNAR.                                          C00003  
           IF MARKETING-TYPE-3527 = 'I'                                 C00003  
             MOVE SIZE-CODE-3527 TO SIZE-CODE-8491                      C00003  
             OBTAIN STBDNAR WITHIN IX-SIZE USING SIZE-CODE-8491         C00003  
               ON DB-REC-NOT-FOUND                                      C00003  
                 MOVE SPACES TO EDIT-CODE-W004.                         C00003  
           IF MARKETING-TYPE-3527 = 'I'                                 C00003  
           AND DB-STATUS-OK                                             C00003  
               IF SEAT-DESC-8491 (3:1) = '.'                            C00003  
                 MOVE SEAT-DESC-8491 (1:5) TO EDIT-CODE-W004            C00003  
               ELSE                                                     C00003  
                 MOVE SEAT-DESC-8491 (1:3) TO WS-SEAT-DESC              C00003  
                 COMPUTE WS-EDIT-CODE ROUNDED =                         C00003  
                     WS-SEAT-DESC * .0394                               C00003  
                 MOVE WS-EDIT-CODE TO WS-EDIT-CODE-ALPH                 C00003  
                 MOVE WS-EDIT-CODE-ALPH TO EDIT-CODE-W004.              C00003  
                                                                                
           PERFORM CLCAMT49.                                                    
                                                                                
      *      THE CUSTOMER RECORD PASSED IS SHIP-TO, THE DB-KEY IS       GSTSHPTO
      *      BILL-TO.  THEREFORE, WASTE TAX MUST READ CUSTOMER AGAIN    GSTSHPTO
      *      TO OBTAIN BILL-TO INFO.                                    GSTSHPTO
                                                                                
      *    FOR PCV6 PROMOTIONS SABGP011 SHOULD BE EXECUTED.                     
      *    FOR TCV8/CCV5 DEVELOPMENT DICTIONARIES SABGX011 SHOULD BE            
      *    EXECUTED.                                                            
                                                                                
           TRANSFER 'SABGP011' LINK USING  SUBSCHEMA-CTRL                       
                                           COE-DEFINITION                       
                                           CUSTOMER                             
                                           MKT-PART                             
                                           TAX-EXEMPTION                        
                                           AOBGW004                     C02385  
                                           WASTE-TAX-RECORD             CG050919
                                           MISC-ITEM-CHARGE             C02385  
                                           TABLE-HDR                    CG130815
                                           TABLE-DETAIL.                CG130815
                                                                        CG050602
      *************************************************************>>   CG050602
      * IF THE INVOICE IS APPLICABLE FOR CURRENCY CONVERSION, ENSURE    CG050602
      * THAT THE WASTE-TAX AMOUNTS CALCULATED IN SABGP011 ABOVE, ARE    CG050602
      * MODIFIED AND STORED IN US DOLLARS.                              CG050602
      *************************************************************>>   CG050602
           IF WS-CONVERT = 'Y'                                          CG050602
              FIND CURRENT AR-INVOICE-ITEM                              CG050602
              MOVE 0 TO SUB1                                            CG050602
              PERFORM 4500-CONVERT-AMOUNTS THRU 4500-EXIT               CG050602
           END-IF.                                                      CG050602
                                                                                
           PERFORM VARYING SUB1 FROM 1 BY 1                             SDMUD866
                   UNTIL   SUB1 > 3                                     CG050812
             IF (CLAIMS-TYPE-3510 = 'W'                                 C02642  
             OR CLAIMS-TYPE-3510 = 'X'                                  C02642  
             OR CLAIMS-TYPE-3510 = 'F')                                 C02642  
             AND DEBIT-CREDIT-IND-2714 = 'C'                            C02642  
               COMPUTE WK-MISC-CHRG-AMT =                               C02642  
                 WK-MISC-CHRG-AMT - MISC-CHRG-AMT-W004(SUB1)            C02642  
                 ADD MISC-CHRG-AMT-W004(SUB1) TO   AVP-GROSS-AMT        CG240501
             ELSE                                                       C02642  
             ADD MISC-CHRG-AMT-W004(SUB1) TO AVP-GROSS-AMT              SDMUD866
             COMPUTE WK-MISC-CHRG-AMT =                                         
                 WK-MISC-CHRG-AMT + MISC-CHRG-AMT-W004(SUB1)            SDMUD866
             END-IF                                                     C02642  
             IF SALES-TAX-EXMPTN-FLAG-W004(SUB1) = 'E'                  SDMUD866
             OR ((SALES-TAX-EXMPTN-FLAG-W004(SUB1) = 'P'                C03338  
             OR SALES-TAX-EXMPTN-FLAG-W004(SUB1) = 'G')                 C03338  
             AND CA-GOODS-SERV-TAX-IND-W004 NOT = 'H')                  C03338  
               IF (CLAIMS-TYPE-3510 = 'W'                               C02642  
               OR CLAIMS-TYPE-3510 = 'X'                                C02642  
               OR CLAIMS-TYPE-3510 = 'F')                               C02642  
               AND DEBIT-CREDIT-IND-2714 = 'C'                          C02642  
                 SUBTRACT MISC-CHRG-AMT-W004(SUB1) FROM AVP-EXEMPT-AMT  C02642  
               ELSE                                                     C02642  
                 ADD MISC-CHRG-AMT-W004(SUB1) TO AVP-EXEMPT-AMT         SDMUD866
               END-IF                                                   C02642  
             END-IF                                                     C02642  
           END-PERFORM.                                                 SDMUD866
                                                                                
       CLCWST48-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       CLCAMT49           SECTION.                                              
      ***********************************************************************   
      * CLCAMT49 - CALCULATE NET AND GROSS TAXABLE AMOUNTS FOR WASTE TAX    *   
      ***********************************************************************   
                                                                                
           COMPUTE TAXABLE-NET-ITEM-AMT-W004 ROUNDED =                          
                   UNIT-PRICE-2714 * QTY-SHIPPED-2714.                          
                                                                                
           FIND CURRENT SALES-ORDER-LINE.                                       
           IF REMISE-DISCOUNTS IS EMPTY                                         
               MOVE TAXABLE-NET-ITEM-AMT-W004 TO                                
                    TAXABLE-GROSS-ITEM-AMT-W004                                 
               GO TO CLCAMT49-EXIT                                              
           ELSE                                                                 
               IF REMISE-DISCOUNTS NOT EMPTY                                    
                   NEXT SENTENCE                                                
               ELSE                                                             
                   PERFORM IDMS-STATUS.                                         
                                                                                
           MOVE ZEROS TO WK-DISCOUNTED-AMT.                                     
           OBTAIN NEXT DISC-BY-REMISE WITHIN REMISE-DISCOUNTS                   
                  ON DB-END-OF-SET                                              
                    NEXT SENTENCE.                                              
                                                                                
           PERFORM UNTIL DB-END-OF-SET                                          
               IF PRICE-FACTOR-SEQ-9032 NOT = 00                                
                   COMPUTE WK-DISCOUNTED-AMT =                                  
                       WK-DISCOUNTED-AMT + DISCOUNTED-AMT-9032                  
               END-IF                                                           
               OBTAIN NEXT DISC-BY-REMISE WITHIN REMISE-DISCOUNTS               
                      ON DB-END-OF-SET                                          
                        NEXT SENTENCE                                           
                        END-IF                                                  
           END-PERFORM.                                                         
           COMPUTE TAXABLE-GROSS-ITEM-AMT-W004 ROUNDED =                        
              (UNIT-PRICE-2714 - WK-DISCOUNTED-AMT) * QTY-SHIPPED-2714. P07552  
                                                                                
       CLCAMT49-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       CLCDSC50          SECTION.                                               
      ***********************************************************************   
      * CLCDSC50 - GET DISCOUNT, CALCULATE DISCOUNT AMOUNT                  *   
      ***********************************************************************   
           INITIALIZE DISCOUNT.                                                 
                                                                                
           MOVE WK-DISCOUNT-CODE TO DISCOUNT-CODE-3540.                         
                                                                                
           IF WK-QTY-SHIPPED = ZEROS                                    UNITDISC
               MOVE ZEROS TO WK-DISCOUNT-AMT                            UNITDISC
               GO TO CLCDSC50-EXIT.                                     UNITDISC
                                                                                
           OBTAIN CALC DISCOUNT                                                 
                  ON DB-REC-NOT-FOUND                                           
                    GO TO CLCDSC50-EXIT.                                        
                                                                                
           IF  DISCOUNT-VALUE-TYPE-3540 = 'P'                                   
               COMPUTE WK-DISCOUNT-AMT ROUNDED =                                
                     ((WK-DISCOUNTED-AMT * DISCOUNT-VALUE-3540) / 100)          
           ELSE                                                                 
           IF  DISCOUNT-VALUE-TYPE-3540 = 'A'                                   
               COMPUTE WK-DISCOUNT-AMT ROUNDED =                                
                      (DISCOUNT-VALUE-3540 * 1)                         UNITDISC
           ELSE                                                         UNITDISC
             IF DISCOUNT-VALUE-TYPE-3540 = 'U'                          UNITDISC
                 COMPUTE WK-DISCOUNT-AMT ROUNDED =                      UNITDISC
                   (DISCOUNT-VALUE-3540 * WK-QTY-SHIPPED).              UNITDISC
                                                                                
      *************************************************************>>   CG050602
      * IF THE INVOICE IS APPLICABLE FOR CURRENCY CONVERSION, ENSURE    CG050602
      * THAT THE DISCOUNT AMOUNTS ARE CONVERTED INTO US DOLLARS BASED   CG050602
      * ON THE CONVERSION RATE ALREADY CALCULATED (WS-CURR-FACTOR)      CG050602
      *************************************************************>>   CG050602
           IF WS-CONVERT = 'Y'                                          CG050602
              IF WS-CURR-FACTOR NOT = ZERO                              CG050602
                 COMPUTE WK-DISCOUNT-AMT ROUNDED =                      CG050602
                     WK-DISCOUNT-AMT / WS-CURR-FACTOR                   CG050602
                 MOVE WK-DISCOUNT-AMT TO DISCOUNT-AMT-3503              CG050602
                 FIND CURRENT SALES-ORDER-LINE                          CG050602
                 MODIFY SALES-ORDER-LINE                                CG050602
              END-IF                                                    CG050602
           END-IF.                                                      CG050602
                                                                                
           IF (CLAIMS-TYPE-3510 = 'W'                                   C02104  
           OR CLAIMS-TYPE-3510 = 'X'                                    C02104  
           OR CLAIMS-TYPE-3510 = 'F')                                   C02642  
           AND DEBIT-CREDIT-IND-3503 = 'C'                              C02104  
             COMPUTE WK-DISCOUNTED-AMT ROUNDED =                        C02104  
                  (WK-DISCOUNTED-AMT - WK-DISCOUNT-AMT)                 C02104  
           ELSE                                                         C02104  
           COMPUTE WK-DISCOUNTED-AMT ROUNDED =                                  
                  (WK-DISCOUNTED-AMT + WK-DISCOUNT-AMT).                        
                                                                                
           IF TAX-FLAG-3540 = 'N'                                               
             IF (CLAIMS-TYPE-3510 = 'W'                                 C02104  
             OR CLAIMS-TYPE-3510 = 'X'                                  C02104  
             OR CLAIMS-TYPE-3510 = 'F')                                 C02642  
             AND DEBIT-CREDIT-IND-3503 = 'C'                            C02104  
               SUBTRACT WK-DISCOUNT-AMT FROM WK-EXEMPT-AMT              C02104  
             ELSE                                                       C02104  
               ADD WK-DISCOUNT-AMT TO WK-EXEMPT-AMT.                            
                                                                                
                                                                                
       CLCDSC50-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       GETTRM51         SECTION.                                                
      ***********************************************************************   
      * GETTRM51 - GET CUSTOMER TERMS RECORD                                *   
      ***********************************************************************   
           INITIALIZE CUSTOMER-TERMS.                                           
                                                                                
           MOVE PAYMENT-TERMS-CODE-2700 TO PAYMENT-TERMS-CODE-3512.     CG080219
                                                                        CG080219
           OBTAIN CALC CUSTOMER-TERMS.                                          
                                                                        CG080219
       GETTRM51-EXIT.                                                           
           EXIT.                                                                
                                                                                
       GETMKT52          SECTION.                                               
      ***********************************************************************   
      * GETMKT52 - GET MARKETING PART / PLANT                               *   
      ***********************************************************************   
           INITIALIZE MKT-PART                                                  
                      MKT-PLANT.                                                
                                                                                
           IF  MARKETING-PART-ID-2714 = SPACES                                  
               GO TO GETMKT52-EXIT.                                             
                                                                                
           MOVE MARKETING-PART-ID-2714 TO PART-NUMBER-3527.                     
           MOVE SHIP-PLANT-CODE-2712   TO PLANT-CODE-3526.                      
                                                                                
           OBTAIN CALC MKT-PART                                                 
                  ON DB-REC-NOT-FOUND                                           
                    GO TO GETMKT52-EXIT.                                        
                                                                                
           OBTAIN MKT-PLANT WITHIN MKT-PART-PLANT                               
                  USING PLANT-CODE-3526                                         
                    ON DB-REC-NOT-FOUND                                         
                      NEXT SENTENCE.                                            
                                                                                
       GETMKT52-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       GETCAO53           SECTION.                                              
      ***********************************************************************   
      * GETCAO53 - GET CUSTOMER ADDRESS OPTIONS                             *   
      ***********************************************************************   
           INITIALIZE CUSTOMER                                                  
                      ADDRSS-OPTION.                                            
                                                                                
      *      CUSTOMER REFERENCES ARE FOR BILL TO CUSTOMER.              BILTOEXM
           MOVE CUSTOMER-NUMBER-2712   TO BUSINESS-NUMBER-5050.                 
           MOVE BILL-TO-ADDR-TYPE-2712 TO ADDR-ID-3558.                         
                                                                                
           FIND   CALC BUSINESS                                         CG030410
                  ON DB-REC-NOT-FOUND                                           
                    NEXT SENTENCE.                                              
                                                                                
           IF  DB-STATUS-OK                                                     
               OBTAIN FIRST CUSTOMER WITHIN BUS-ROLE                            
               ACCEPT WK3-DB-KEY (5) FROM CUSTOMER CURRENCY.                    
                                                                                
           OBTAIN ADDRSS-OPTION WITHIN ADDR-OPTIONS USING ADDR-ID-3558          
                  ON DB-REC-NOT-FOUND                                           
                    NEXT SENTENCE.                                              
                                                                                
           INITIALIZE AR-GROUP, ORG-ID, AR-ORG.                                 
           IF  AR-INSTALLED-900 = 'Y'                                           
               IF  GL-ORGANIZATION-ID-3558 NOT = SPACES                         
                   MOVE GL-ORGANIZATION-ID-3558 TO ORGANIZATION-ID-6482         
               ELSE                                                             
               IF  ORGANIZATION-ID-3501 NOT = SPACES                            
                   MOVE ORGANIZATION-ID-3501 TO ORGANIZATION-ID-6482            
               ELSE                                                             
               IF  GL-ORGANIZATION-ID-3501 NOT = SPACES                         
                   MOVE GL-ORGANIZATION-ID-3501 TO ORGANIZATION-ID-6482         
               ELSE                                                             
                   MOVE AR-GROUP-ID-3501 TO AR-GROUP-ID-2600                    
                   OBTAIN CALC AR-GROUP                                         
                          ON DB-REC-NOT-FOUND                                   
                            CONTINUE                                            
                            END-IF                                              
                   IF DB-STATUS-OK                                              
                       MOVE ORGANIZATION-ID-2600 TO ORGANIZATION-ID-6482        
                   END-IF                                                       
               END-IF                                                           
               END-IF                                                           
               END-IF                                                           
               IF  ORGANIZATION-ID-6482 = SPACES                                
                   MOVE GL-ORGANIZATION-ID-3524 (2) TO                          
                        ORGANIZATION-ID-6482                                    
               END-IF                                                           
               IF  ORGANIZATION-ID-6482 = SPACES                                
                   NEXT SENTENCE                                                
               END-IF                                                           
               FIND CALC ORG-ID                                                 
                    ON DB-REC-NOT-FOUND                                         
                      NEXT SENTENCE                                             
                      END-IF                                                    
               IF  DB-STATUS-OK                                                 
                   OBTAIN FIRST AR-ORG WITHIN ORG-APPL.                         
                                                                                
       GETCAO53-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       GETSTA54          SECTION.                                               
      ***********************************************************************   
      * GETSTA54 - GET SHIP-TO ADDRESS                                      *   
      ***********************************************************************   
           MOVE SHIP-TO-BUSINESS-2712  TO BUSINESS-NUMBER-5050.                 
           MOVE SHIP-TO-ADDR-TYPE-2712 TO ADDR-ID-5005.                         
                                                                                
           FIND CALC BUSINESS                                                   
                ON DB-REC-NOT-FOUND                                             
                  GO TO GETSTA54-EXIT.                                          
                                                                                
           FIND ADDRSS-ID WITHIN BUS-ADDRID USING ADDR-ID-5005                  
                ON DB-REC-NOT-FOUND                                             
                  INITIALIZE ADDRSS.                                            
                                                                                
           IF  DB-STATUS-OK                                                     
               OBTAIN OWNER WITHIN ADDR-ADDRID.                                 
                                                                                
      *      CUSTOMER REFERENCES ARE FOR SHIP TO CUSTOMER.              BILTOEXM
           OBTAIN FIRST CUSTOMER WITHIN BUS-ROLE.                       C02062  
                                                                                
           ACCEPT WK3-DB-KEY (7) FROM CUSTOMER CURRENCY.                        
                                                                                
           IF REGROUP-IND-3501 = 'Y'                                    C02062  
             MOVE 'Y' TO WS-REGROUP-CUST                                C02062  
           ELSE                                                         C02062  
             MOVE 'N' TO WS-REGROUP-CUST.                               C02062  
                                                                                
                                                                                
       GETSTA54-EXIT.                                                           
           EXIT.                                                                
                                                                                
       GETPOA54         SECTION.                                                
      ***********************************************************************   
      * GETPOA54 - GET SHIP-FROM ADDRESS                                    *   
      ***********************************************************************   
           MOVE SHIP-FROM-BUSINESS-3524  TO BUSINESS-NUMBER-5050.               
           MOVE SHIP-FROM-ADDR-TYPE-3524 TO ADDR-ID-5005.                       
                                                                                
           FIND CALC BUSINESS                                                   
                ON DB-REC-NOT-FOUND                                             
                  INITIALIZE ADDRSS.                                            
                                                                                
           IF  DB-STATUS-OK                                                     
               FIND ADDRSS-ID WITHIN BUS-ADDRID USING ADDR-ID-5005              
                    ON DB-REC-NOT-FOUND                                         
                      INITIALIZE ADDRSS                                         
                      END-IF                                                    
               IF  DB-STATUS-OK                                                 
                   OBTAIN OWNER WITHIN ADDR-ADDRID.                             
                                                                                
       GETPOA54-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       EXEMPT55          SECTION.                                               
      ***********************************************************************   
      * EXEMPT55 - CHECK FOR TAX EXEMPTIONS FOR USER BUSINESS               *   
      *          - CHECK FOR TAX EXEMPTIONS FOR MARKETING PART              *   
      *          - CHECK FOR TAX EXEMPTIONS FOR SHIP TO BUSINESS            *   
      ***********************************************************************   
                                                                                
      *  USER BUSINESS EXEMPTION                                                
                                                                                
           MOVE 0                                TO WK-SAVED-SUB.               
                                                                                
           PERFORM VARYING WK-SUB                FROM 1 BY 1                    
                   UNTIL   WK-SUB > 55           OR                             
                           AVP-ST-CODE  = 'CN'                                  
               IF (STATE-3523    (WK-SUB)        NOT = SPACES AND               
                   TAX-FLAG-3523 (WK-SUB)        NOT = SPACES) AND              
                   STATE-3523    (WK-SUB) = AVP-ST-CODE                         
                   MOVE TAX-FLAG-3523 (WK-SUB)   TO WK-TAX-FLAG                 
                   MOVE 55                       TO WK-SUB                      
               ELSE                                                             
                   IF (STATE-3523    (WK-SUB)        = SPACES   AND             
                       TAX-FLAG-3523 (WK-SUB)    NOT = SPACES) AND              
                       WK-SAVED-SUB                  = ZEROES                   
                       MOVE WK-SUB               TO WK-SAVED-SUB                
                   END-IF                                                       
               END-IF                                                           
           END-PERFORM.                                                         
                                                                                
           PERFORM VARYING WK-SUB                FROM 1 BY 1                    
                   UNTIL   WK-SUB > 55           OR                             
                           AVP-ST-CODE           NOT = 'CN'                     
               IF (STATE-3523    (WK-SUB)        NOT = SPACES AND               
                   TAX-FLAG-3523 (WK-SUB)        NOT = SPACES) AND              
                   STATE-3523    (WK-SUB)         = WK-TAXABLE-PROV-CODE        
                   MOVE TAX-FLAG-3523 (WK-SUB)   TO WK-TAX-FLAG                 
                   MOVE 55                       TO WK-SUB                      
               ELSE                                                             
                   IF (STATE-3523    (WK-SUB)        = SPACES   AND             
                       TAX-FLAG-3523 (WK-SUB)    NOT = SPACES) AND              
                       WK-SAVED-SUB                  = ZEROES                   
                       MOVE WK-SUB               TO WK-SAVED-SUB                
                   END-IF                                                       
               END-IF                                                           
           END-PERFORM.                                                         
                                                                                
           IF WK-SAVED-SUB NOT = ZEROES                                         
              MOVE TAX-FLAG-3523 (WK-SAVED-SUB)  TO WK-TAX-FLAG.                
                                                                                
           IF WK-TAX-FLAG  = ' '                                                
              MOVE 'Y'                           TO WK-TAX-FLAG.                
                                                                                
           IF WK-TAX-FLAG = 'Y'                                                 
              NEXT SENTENCE                                                     
           ELSE                                                                 
           IF WK-TAX-FLAG = 'N' OR                                              
              WK-TAX-FLAG NOT = WK-AVP-ST-SALES-USE-IND                   USETAX
              MOVE 'N'                           TO AVP-NO-TAX-IND              
              GO TO EXEMPT55-EXIT.                                              
                                                                                
      *  MARKETING PART EXEMPTION                                               
                                                                                
           IF TAX-FLAG-2714 = 'Y' OR 'S' OR 'U'                                 
              NEXT SENTENCE                                                     
           ELSE                                                                 
              MOVE 'N'                           TO AVP-NO-TAX-IND              
              GO TO EXEMPT55-EXIT.                                              
                                                                                
      *  CUSTOMER EXEMPTION                                                     
                                                                                
           IF AVP-ST-CODE = 'CN'                                                
              MOVE WK-TAXABLE-PROV-CODE          TO WK-STATE                    
           ELSE                                                                 
              MOVE AVP-ST-CODE                   TO WK-STATE.                   
                                                                                
      *      CUSTOMER REFERENCES ARE FOR EXEMPT CUSTOMER.               BILTOEXM
      *      MAY BE BILL-TO OR SHIP-TO CUSTOMER PER WK-DB-KEY.          BILTOEXM
                                                                                
           PERFORM VARYING WK-TAXING-AUTHORITY   FROM 1 BY 1                    
                   UNTIL   WK-TAXING-AUTHORITY > 3                              
               INITIALIZE TAX-EXEMPTION                                         
               MOVE WK-TAXING-AUTHORITY          TO                             
                                                 TAXING-AUTHORITY-3531          
               MOVE WK-STATE                     TO STATE-3531                  
               IF WK-TAXING-AUTHORITY = 2                                       
                  MOVE WK-AVP-NUMERIC-COUNTY     TO COUNTY-CODE-3531            
               END-IF                                                           
               IF WK-TAXING-AUTHORITY = 3                                       
                  MOVE WK-ZIP-CODE(1:5)          TO ZIP-CODE-3531(1:5)  CG030410
               END-IF                                                           
               FIND CUSTOMER DB-KEY              IS WK-DB-KEY           BILTOEXM
               OBTAIN TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT                       
                      USING TAX-EXEMPT-ID-3531                                  
                        ON DB-REC-NOT-FOUND                                     
                          CONTINUE                                              
                          END-IF                                                
               IF DB-REC-NOT-FOUND                                              
                  OBTAIN NEXT TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT               
                         ON DB-END-OF-SET                                       
                           CONTINUE                                             
                           END-IF                                               
               END-IF                                                           
               IF DB-STATUS-OK                                                  
                  PERFORM CHKCTE56                                              
               END-IF                                                           
           END-PERFORM.                                                         
                                                                                
       EXEMPT55-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       CHKCTE56           SECTION.                                              
      ***********************************************************************   
      * CHKCTE56 - CHECK CUSTOMER TAX EXEMPTION                             *   
      ***********************************************************************   
           MOVE 0                            TO WK-SUB.                         
                                                                                
      *      CUSTOMER REFERENCES ARE FOR EXEMPT CUSTOMER.               BILTOEXM
      *      MAY BE BILL-TO OR SHIP-TO CUSTOMER PER WK-DB-KEY.          BILTOEXM
                                                                                
           PERFORM UNTIL WK-SUB > 0                                             
               IF TAXING-AUTHORITY-3531      NOT = WK-TAXING-AUTHORITY          
                  GO TO CHKCTE56-EXIT                                           
               END-IF                                                           
               IF AVP-ST-CODE = 'CN'                                            
                  AND STATE-3531             NOT = WK-TAXABLE-PROV-CODE         
                  GO TO CHKCTE56-EXIT                                           
               END-IF                                                           
               IF AVP-ST-CODE                NOT = 'CN'                         
                  AND STATE-3531             NOT = AVP-ST-CODE                  
                  GO TO CHKCTE56-EXIT                                           
               END-IF                                                           
               IF WK-TAXING-AUTHORITY            = 2                            
                  AND COUNTY-CODE-3531       NOT = WK-AVP-NUMERIC-COUNTY        
                  GO TO CHKCTE56-EXIT                                           
               END-IF                                                           
               IF WK-TAXING-AUTHORITY            = 3                            
                  AND ZIP-CODE-3531          NOT = SPACES                  ZIP9 
                  AND ZIP-CODE-3531(1:5)     NOT = WK-ZIP-CODE(1:5)     CG030410
                  GO TO CHKCTE56-EXIT                                           
               END-IF                                                           
               IF EFF-DATE-3531                  = SPACES                       
                  MOVE LOW-VALUES            TO EFF-DATE-3531                   
               END-IF                                                           
               IF EXPIRATION-DATE-3531           = SPACES                       
                  MOVE HIGH-VALUES           TO EXPIRATION-DATE-3531            
               END-IF                                                           
           COPY IMRGXDT1                                                        
           REPLACING DATE-X BY AVP-INV-DATE.                                    
           COPY IMRGXDT2                                                        
           REPLACING DATE-X BY EXPIRATION-DATE-3531.                            
                IF Y2K-WK-DATE1-X                = EFF-DATE-3531                
                   OR Y2K-WK-DATE1-X             = Y2K-WK-DATE2-X               
                   OR (Y2K-WK-DATE1-X            > EFF-DATE-3531                
                   AND Y2K-WK-DATE1-X            < Y2K-WK-DATE2-X)              
                   IF TAX-PRODUCT-CODE-3531      = SPACES                       
                      AND TAX-FLAG-3531          = SPACES                       
                      NEXT SENTENCE                                             
                   ELSE                                                         
                   IF (TAX-PRODUCT-CODE-3531 NOT = SPACES                       
                      AND TAX-PRODUCT-CODE-3531  = AVP-PRODUCT-CODE)            
                      AND (TAX-FLAG-3531     NOT = SPACES                       
                      AND TAX-FLAG-3531       = WK-AVP-ST-SALES-USE-IND)  USETAX
                      NEXT SENTENCE                                             
                   ELSE                                                         
                   IF (TAX-PRODUCT-CODE-3531 NOT = SPACES                       
                      AND TAX-PRODUCT-CODE-3531  = AVP-PRODUCT-CODE)            
                      AND TAX-FLAG-3531          = SPACES                       
                      NEXT SENTENCE                                             
                   ELSE                                                         
                   IF TAX-PRODUCT-CODE-3531      = SPACES                       
                      AND (TAX-FLAG-3531     NOT = SPACES                       
                      AND TAX-FLAG-3531       = WK-AVP-ST-SALES-USE-IND)  USETAX
                      NEXT SENTENCE                                             
                   END-IF                                                       
                   END-IF                                                       
                   END-IF                                                       
                   END-IF                                                       
               END-IF                                                           
               OBTAIN NEXT TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT                  
                      ON DB-END-OF-SET                                          
                        GO TO CHKCTE56-EXIT                                     
                        END-IF                                                  
           END-PERFORM.                                                         
                                                                                
           IF  TAXING-AUTHORITY-3531 = 1                                        
               IF AVP-ST-CODE = 'CN'                                            
                   MOVE 'N'                  TO AVP-NO-CN-TAX                   
                   MOVE 'N'                  TO AVP-NO-LC-TAX                   
               ELSE                                                             
                   MOVE 'N'                  TO AVP-NO-ST-TAX                   
                   MOVE 'N'                  TO AVP-NO-LC-TAX                   
                   MOVE 'N'                  TO AVP-NO-CN-TAX                   
                   MOVE 'N'                  TO AVP-NO-SEC-LC-TAX               
                   MOVE 'N'                  TO AVP-NO-SEC-CN-TAX               
           ELSE                                                                 
           IF  TAXING-AUTHORITY-3531 = 2                                        
                   MOVE 'N'                  TO AVP-NO-LC-TAX                   
                   MOVE 'N'                  TO AVP-NO-CN-TAX                   
                   MOVE 'N'                  TO AVP-NO-SEC-LC-TAX               
                   MOVE 'N'                  TO AVP-NO-SEC-CN-TAX               
           ELSE                                                                 
           IF  TAXING-AUTHORITY-3531 = 3                                        
                   MOVE 'N'                  TO AVP-NO-LC-TAX                   
                   MOVE 'N'                  TO AVP-NO-SEC-LC-TAX.              
                                                                                
       CHKCTE56-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       INVNUM60          SECTION.                                               
      ***********************************************************************   
      * INVNUM60 - GENERATE INVOICE, CREDIT MEMO, OR DEBIT MEMO NUMBER      *   
      ***********************************************************************   
           INITIALIZE CAS-NUMBER-RECORD.                                        
           MOVE 'G' TO CAS-FUNCTION-IND.                                        
                                                                                
           IF  ORDER-TYPE-3510        = 'S'   AND                               
               INVOICE-ONLY-FLAG-3510 = 'N'                                     
               MOVE 'INVOIC'        TO CAS-NUMBER-TYPE                          
               MOVE PREFIX-3524 (1) TO CAS-ID-TO-PROCESS                        
           ELSE                                                                 
           IF  ORDER-TYPE-3510        = 'S'   AND                               
               INVOICE-ONLY-FLAG-3510 = 'Y'                                     
               MOVE 'MEMOS '        TO CAS-NUMBER-TYPE                          
               MOVE PREFIX-3524 (3) TO CAS-ID-TO-PROCESS                        
           ELSE                                                                 
           IF  ORDER-TYPE-3510        = 'C'                                     
               MOVE 'MEMOS '        TO CAS-NUMBER-TYPE                          
               MOVE PREFIX-3524 (2) TO CAS-ID-TO-PROCESS.                       
                                                                                
           TRANSFER 'CSYPGNUM' LINK USING SUBSCHEMA-CTRL                        
                                          CAS-NUMBER-RECORD                     
                                          NUMBER-MASK                           
                                          PREFIX-MASK                           
                                          APPLICATION-REFERENCE-RECORD.         
                                                                                
           MOVE 'SABGP380' TO PROGRAM-NAME.                                     
                                                                                
      ******************************************************************* WMSSEG
      * INVOICE NUMBERS FOR SHIPMENTS WILL NOW BE CREATED BY WMS WITH A * WMSSEG
      * PLANT SUFFIX AND THEREFORE WILL NOT COME THRU THIS ROUTINE. THIS* WMSSEG
      * ROUTINE WILL NOW ISSUE INVOICE NUMBERS ONLY FOR DEBITS AND CRED-* WMSSEG
      * ITS WITHOUT CHANGE TO THE NUMBERING SCHEME.                     * WMSSEG
      ******************************************************************* WMSSEG
                                                                                
           MOVE CAS-ID-TO-PROCESS   TO RECEIVABLE-ITEM-NUMBER-2700.             
           MOVE CAS-ID-TO-PROCESS   TO RECEIVABLE-ITEM-NUMBER-2712.             
           MOVE CAS-ID-TO-PROCESS   TO WK3-INVOICE-NUMBER.                      
                                                                                
       INVNUM60-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       FNDEXM62          SECTION.                                               
      ***********************************************************************   
      * FNDEXM62 - FIND TAX-EXEMPTION FOR EXCISE TAX                        *   
      ***********************************************************************   
           IF WK-CUST-COUNTRY = '0'                                             
               GO TO FNDEXM62-EXIT.                                             
                                                                                
           PERFORM GETSOL75.                                                    
           IF EXCISE-TAX-FLAG-3503 = 'N' OR                                     
              EXCISE-TAX-FLAG-3503 = ' ' OR                              WMSSEG 
              (EXCISE-TAX-FLAG-3526 = 'N' AND                                   
              EXCISE-TAX-FLAG-3527 = 'N') OR                             WMSSEG 
              (EXCISE-TAX-FLAG-3526 = 'N' AND                            WMSSEG 
              EXCISE-TAX-FLAG-3527 = ' ')                                WMSSEG 
              MOVE 'Y' TO WKM-TAX-EXEMPT-IND                                    
              GO TO FNDEXM62-EXIT.                                              
                                                                                
           INITIALIZE TAX-EXEMPTION.                                            
                                                                                
      *      CUSTOMER REFERENCES ARE FOR EXEMPT CUSTOMER.               BILTOEXM
      *      MAY BE BILL-TO OR SHIP-TO CUSTOMER PER WK-DB-KEY.          BILTOEXM
                                                                                
           OBTAIN CUSTOMER DB-KEY IS WK-DB-KEY.                         BILTOEXM
                                                                                
      *  THESE BILL-TO'S SHOULD GET FET (UG TAKEON)                     P67265  
           IF (CUSTOMER-NUMBER-3501 = '1000009' OR '1039280')           P67265  
                 GO TO FNDEXM62-EXIT.                                   P67265  
                                                                                
           IF (CUST-SUB-CHNL-3501 = '003')                              FETEXPOR
             OR (CUST-CHNL-3501 = '01' OR '14' OR '16')                 C00419  
                 MOVE 'Y' TO WKM-TAX-EXEMPT-IND                         FETEXPOR
                 GO TO FNDEXM62-EXIT.                                   FETEXPOR
                                                                                
           MOVE 4 TO TAXING-AUTHORITY-3531.                                     
           OBTAIN TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT                           
                  USING TAX-EXEMPT-ID-3531                                      
                    ON DB-REC-NOT-FOUND                                         
                      NEXT SENTENCE.                                            
                                                                                
           IF DB-REC-NOT-FOUND                                                  
               OBTAIN NEXT TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT                  
                      ON DB-END-OF-SET                                          
                        NEXT SENTENCE.                                          
                                                                                
           PERFORM  UNTIL NOT DB-STATUS-OK  OR                                  
                    TAXING-AUTHORITY-3531 NOT = 4                               
             IF EXPIRATION-DATE-3531 = SPACES                                   
                 MOVE HIGH-VALUES TO EXPIRATION-DATE-3531                       
             END-IF                                                             
            COPY IMRGXDT1                                                       
            REPLACING DATE-X BY INVOICE-DATE-2712.                              
            COPY IMRGXDT2                                                       
            REPLACING DATE-X BY EXPIRATION-DATE-3531.                           
             IF Y2K-WK-DATE1-X >=  EFF-DATE-3531 AND                            
                 Y2K-WK-DATE1-X <= Y2K-WK-DATE2-X                               
                 MOVE 'Y' TO WKM-TAX-EXEMPT-IND                                 
                 GO TO FNDEXM62-EXIT                                            
             END-IF                                                             
             OBTAIN NEXT TAX-EXEMPTION WITHIN CUS-TAX-EXEMPT                    
                    ON DB-END-OF-SET                                            
                      NEXT SENTENCE                                             
                      END-IF                                                    
           END-PERFORM.                                                         
                                                                                
       FNDEXM62-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       PLTCTL63          SECTION.                                               
      ***********************************************************************   
      * PLTCTL63 - GET PLANT CONTROL RECORD FOR THE POO PLANT               *   
      ***********************************************************************   
           IF  ORDER-PLANT-LOCATION-367 (1) NOT = PLANT-CODE-3524               
               INITIALIZE COE-PLT-CONTROL                                       
               MOVE ORDER-PLANT-LOCATION-367 (1) TO PLANT-CODE-3524             
               PERFORM GETPLT68                                                 
               MOVE ORDER-PLANT-LOCATION-367 (1) TO PLANT-CODE-3524.            
                                                                                
       PLTCTL63-EXIT.                                                           
           EXIT.                                                                
                                                                                
       PLTCTL64          SECTION.                                               
      ***********************************************************************   
      * PLTCTL64 - GET PLANT CONTROL RECORD FOR THE POA PLANT               *   
      ***********************************************************************   
           IF  ORDER-PLANT-LOCATION-367 (2) NOT = PLANT-CODE-3524               
               INITIALIZE COE-PLT-CONTROL                                       
               MOVE ORDER-PLANT-LOCATION-367 (2) TO PLANT-CODE-3524             
               PERFORM GETPLT68                                                 
               MOVE ORDER-PLANT-LOCATION-367 (2) TO PLANT-CODE-3524.            
                                                                                
       PLTCTL64-EXIT.                                                           
           EXIT.                                                                
                                                                                
       PLTCTL65           SECTION.                                              
      ***********************************************************************   
      * PLTCTL65 - GET PLANT CONTROL RECORD FOR THE SHIPMENT PLANT          *   
      ***********************************************************************   
           IF  SHIP-PLANT-CODE-2712 NOT = PLANT-CODE-3524                       
               INITIALIZE COE-PLT-CONTROL                                       
               MOVE SHIP-PLANT-CODE-2712 TO PLANT-CODE-3524                     
               PERFORM GETPLT68                                                 
               MOVE SHIP-PLANT-CODE-2712 TO PLANT-CODE-3524.                    
                                                                                
       PLTCTL65-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       GETPLT68          SECTION.                                               
      ****************************************************************          
      * GETPLT68 - GET PLANT CONTROL RECORD FOR THE SIGN-ON PLANT    *          
      ****************************************************************          
           OBTAIN CALC COE-PLT-CONTROL                                          
                  ON DB-REC-NOT-FOUND                                           
                    NEXT SENTENCE.                                              
                                                                                
           IF DB-REC-NOT-FOUND                                                  
               MOVE SPACES TO PLANT-CODE-3524                                   
               OBTAIN CALC COE-PLT-CONTROL.                                     
           INITIALIZE WK-COE-PLT-CNTL-DBKEY.                            CG070627
           ACCEPT WK-COE-PLT-CNTL-DBKEY FROM COE-PLT-CONTROL CURRENCY.  CG070627
                                                                                
       GETPLT68-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       GETFOB69         SECTION.                                                
      ******************************************************************        
      * GETFOB69 - DETERMINE FOB POINT FOR INVOICE                     *        
      ******************************************************************        
           MOVE PAYMENT-TERMS-CODE-2712 TO AR-INVOICE-HDR-WORK-RECORD.          
                                                                                
           IF  FOB-POINT-2712 NOT = SPACES                                      
               GO TO GETFOB69-EXIT.                                             
                                                                                
           MOVE FOB-POINT-367 TO FOB-POINT-2712.                                
                                                                                
      *      CUSTOMER REFERENCES ARE FOR SHIP TO CUSTOMER               BILTOEXM
                                                                                
           IF  FOB-POINT-2712 = SPACES                                          
               MOVE SHIP-TO-BUSINESS-2712 TO BUSINESS-NUMBER-5050               
               FIND CALC BUSINESS                                               
               FIND FIRST CUSTOMER WITHIN BUS-ROLE                              
               IF  ADDR-OPTIONS NOT EMPTY                                       
                   OBTAIN LAST ADDRSS-OPTION WITHIN ADDR-OPTIONS                
                          ON DB-END-OF-SET                                      
                            NEXT SENTENCE                                       
                            END-IF                                              
                   IF  DB-STATUS-OK  AND                                        
                       ADDR-ID-3558  =  HIGH-VALUES                             
                       MOVE ADDRSS-OPTION-USER-DATA-3558                        
                         TO ADDRSS-OPTION-WORK-RECORD                           
                       MOVE FOB-POINT-3558 TO FOB-POINT-2712                    
                   END-IF                                                       
               END-IF                                                           
           END-IF.                                                              
                                                                                
           IF  FOB-POINT-2712 = SPACES                                          
               MOVE 'O' TO FOB-POINT-2712.                                      
                                                                                
       GETFOB69-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
       GETSOL75           SECTION.                                              
      ***********************************************************************   
      * GETSOL75 - GET SALES ORDER LINE                                     *   
      ***********************************************************************   
           OBTAIN OWNER WITHIN LINE-SHIPMENTS.                                  
                                                                                
       GETSOL75-EXIT.                                                           
           EXIT.                                                                
                                                                                
       UPDSOL76           SECTION.                                              
      ***********************************************************************   
      * UPDSOL76 - MOD SALES-ORDER-LINE TAX-FLAG                            *   
      ***********************************************************************   
           MOVE WS-CURRENT-DATE-YYMMDD TO DATE-LAST-ACTIVITY-3503.      CG030717
           MOVE WS-CURRENT-TIME        TO TIME-LAST-ACTIVITY-3503.      CG030717
           FIND CURRENT SALES-ORDER-LINE.                                       
                                                                                
           MODIFY SALES-ORDER-LINE.                                             
                                                                                
       UPDSOL76-EXIT.                                                           
           EXIT.                                                                
       EJECT                                                                    
                                                                        04030000
      *******************************************************           CG020821
      *     FIND TEXT-HEADER TO SUBMIT JCL                  *           CG020821
      *     KEY :SABGD307         - FOR USADATA             *           CG020821
      *     KEY :SABGD308         - FOR CANDATA             *           CG020821
      *******************************************************           CG020821
       3000-WRITE-JCL.                                                  CG020821
           MOVE 'N'    TO WS-END-OF-JCL.                                CG020821
           MOVE 'SABG' TO TEXT-TYPE-CODE-951.                           CG020821
                                                                        CG030806
           EVALUATE CUSTOMER-NUMBER-2712 (1:1)                          CG030806
              WHEN '1'                                                  CG030806
                 MOVE 'SABGD307' TO TEXT-KEY-951                        CG030806
              WHEN '0'                                                  CG030806
                 MOVE 'SABGD308' TO TEXT-KEY-951                        CG030806
              WHEN OTHER                                                CG030806
                 GO TO 3000-EXIT                                        CG030806
           END-EVALUATE.                                                CG030806
                                                                        CG020821
           FIND CALC TEXT-HEADER                                        CG020821
           ON DB-REC-NOT-FOUND                                          CG020821
               GO TO 3000-EXIT                                          CG020821
           END-IF.                                                      CG020821
                                                                        CG020821
           IF TEXT-DETAIL EMPTY                                         CG020821
               MOVE 'Y'                TO WS-END-OF-JCL                 CG020821
           END-IF.                                                      CG020821
                                                                        CG020821
           PERFORM 3100-GET-TEXTLINE   THRU 3100-EXIT                   CG020821
                                       UNTIL END-OF-JCL.                CG020821
                                                                        CG020821
       3000-EXIT.                                                       CG020821
           EXIT.                                                        CG020821
                                                                        CG020821
      ******************************************************************CG020821
      * OBTAIN JCL FROM TEXT-LINE TO BE SUBMITTED TO THE INTERNAL JCL  *CG020821
      ******************************************************************CG020821
       3100-GET-TEXTLINE.                                               CG020821
                                                                        CG020821
           OBTAIN NEXT TEXT-LINE WITHIN TEXT-DETAIL                     CG020821
           ON DB-END-OF-SET                                             CG020821
              MOVE 'Y'                 TO WS-END-OF-JCL                 CG020821
              GO TO 3100-EXIT                                           CG020821
           END-IF.                                                      CG020821
                                                                        CG020821
           MOVE SPACES                 TO WS-JCL-LINE.                  CG020821
           MOVE TEXT-DETAIL-LINE-952   TO WS-JCL-LINE.                  CG020821
                                                                        CG020821
           IF WS-JCL-LINE = '/*EOF'                                     CG020821
              MOVE 'Y'                 TO WS-END-OF-JCL                 CG020821
              WRITE PRINTER ENDRPT FROM WS-JCL-LINE                     CG030312
                    LENGTH 80 CLASS 50                                  CG030312
              GO TO 3100-EXIT                                           CG020821
           END-IF.                                                      CG020821
                                                                        CG020821
           WRITE PRINTER FROM WS-JCL-LINE LENGTH 80 CLASS 50.           CG020821
                                                                        CG020821
       3100-EXIT.                                                       CG020821
           EXIT.                                                        CG020821
                                                                        CG050602
       4000-CHECK-CURRENCY.                                             CG050602
           MOVE 'USD' TO CURRENCY-CODE-4770.                            CG050602
           FIND CALC CURRENCY-CONV.                                     CG050602
           IF DB-REC-NOT-FOUND                                          CG050602
              GO TO 4000-EXIT                                           CG050602
           END-IF.                                                      CG050602
                                                                        CG050602
           MOVE FUNCTION CURRENT-DATE (1:8) TO EFF-DATE-4771.           CG050602
           MOVE '01'                        TO EFF-DATE-4771 (7:2).     CG050602
                                                                        CG050602
           OBTAIN CURRENCY-FACTOR WITHIN CURRCODE-FACTOR                CG050602
            USING EFF-DATE-4771.                                        CG050602
           IF DB-REC-NOT-FOUND                                          CG050602
              GO TO 4000-EXIT                                           CG050602
           END-IF.                                                      CG050602
                                                                        CG050602
           MOVE CURRENCY-CONV-FACTOR-4771 TO WS-CURR-FACTOR.            CG050602
           MOVE 'Y'                       TO WS-CONVERT.                CG050602
                                                                        CG050602
       4000-EXIT.                                                       CG050602
           EXIT.                                                        CG050602
                                                                        CG050602
       4500-CONVERT-AMOUNTS.                                            CG050602
           OBTAIN NEXT MISC-ITEM-CHARGE WITHIN MISC-ITM-CHARGES         CG050602
           ON DB-END-OF-SET                                             CG050602
              GO TO 4500-EXIT                                           CG050602
           END-IF.                                                      CG050602
                                                                        CG050602
           COMPUTE MISC-CHRG-RATE-8257 ROUNDED =                        CG050602
                   MISC-CHRG-RATE-8257 / WS-CURR-FACTOR.                CG050602
           COMPUTE MISC-CHRG-UNIT-FEE-8257 ROUNDED =                    CG050602
                   MISC-CHRG-UNIT-FEE-8257 / WS-CURR-FACTOR.            CG050602
                                                                        CG050602
           COMPUTE MISC-CHRG-AMT-8257  ROUNDED =                        CG050602
                   MISC-CHRG-AMT-8257  / WS-CURR-FACTOR.                CG050602
                                                                        CG050602
           MODIFY MISC-ITEM-CHARGE.                                     CG050602
                                                                        CG050622
           IF MISC-CHRG-AMT-W004(1) IS NUMERIC                          CG050622
              COMPUTE MISC-CHRG-AMT-W004(1) ROUNDED =                   CG050622
                      MISC-CHRG-AMT-W004(1) / WS-CURR-FACTOR            CG050622
           END-IF.                                                      CG050622
           IF MISC-CHRG-AMT-W004(2) IS NUMERIC                          CG050622
              COMPUTE MISC-CHRG-AMT-W004(2) ROUNDED =                   CG050622
                      MISC-CHRG-AMT-W004(2) / WS-CURR-FACTOR            CG050622
           END-IF.                                                      CG050622
           IF MISC-CHRG-AMT-W004(3) IS NUMERIC                          CG050812
              COMPUTE MISC-CHRG-AMT-W004(3) ROUNDED =                   CG050812
                      MISC-CHRG-AMT-W004(3) / WS-CURR-FACTOR            CG050812
           END-IF.                                                      CG050622
                                                                        CG050602
           GO TO 4500-CONVERT-AMOUNTS.                                  CG050602
                                                                        CG050602
       4500-EXIT.                                                       CG050602
           EXIT.                                                        CG050602
                                                                                
      ************************************************************      CG220726
      *   COLORADO DELIVERY FEES                                 *      CG220726
      ************************************************************      CG220726
       4700-DELIVERY-FEE.                                               CG220726
           IF AVP-NO-ST-TAX = 'N'                                       CG220726
           OR DO-NOT-CALC-DELIVERY-FEE                                  CG220726
              GO TO 4700-EXIT                                           CG220726
           END-IF.                                                      CG220726
           INITIALIZE AOBGW004.                                         CG220726
           INITIALIZE WASTE-TAX-RECORD.                                 CG220726
           MOVE ZEROES          TO WS-DELIVERY-FEE-LC-TAX.              CG220726
           FIND   AR-INVOICE-HDR DB-KEY IS WK3-DB-KEY (3).              CG220726
           PERFORM IDMS-STATUS THRU ISABEX                              CG220726
                                                                        CG220726
           MOVE STATE-CODE-NBR-8318 TO STATE-CODE-NBR-W004.             CG220726
           IF AVP-ST-CODE = 'CN'                                        CG220726
               MOVE WK-TAXABLE-PROV-CODE TO STATE-CODE-W004             CG220726
           ELSE                                                         CG220726
               MOVE AVP-ST-CODE TO STATE-CODE-W004                      CG220726
           END-IF.                                                      CG220726
           MOVE 'DELIVERFEE'              TO TABLE-KEY-8016.            CG220726
           OBTAIN CALC TABLE-HDR                                        CG220726
           ON DB-REC-NOT-FOUND                                          CG220726
              GO TO 4700-EXIT                                           CG220726
           END-IF                                                       CG220726
           IF DB-STATUS-OK                                              CG220726
               MOVE STATE-CODE-W004       TO ENTRY-CODE-8017            CG220726
              OBTAIN TABLE-DETAIL WITHIN HDR-DETAIL USING               CG220726
                                       ENTRY-CODE-8017                  CG220726
              ON DB-REC-NOT-FOUND                                       CG220726
                 GO TO 4700-EXIT                                        CG220726
              END-IF                                                    CG220726
           END-IF.                                                      CG220726
                                                                        CG220726
           IF SLS-TAX-USING-FLAG-8243 = '2'                             CG220726
           AND NORMAL-TRANSACTION                                       CG220726
                 GO TO 4700-EXIT                                        CG220726
           END-IF.                                                      CG220726
                                                                        CG220726
           MOVE 'N'                 TO SALES-TAX-EXMPTN-FLAG-W004(1)    CG220726
                                       SALES-TAX-EXMPTN-FLAG-W004(2)    CG220726
                                       SALES-TAX-EXMPTN-FLAG-W004(3).   CG220726
           MOVE AVP-INV-DATE           TO INVOICE-DATE-W004.            CG220726
           IF CANADIAN-CUSTOMER AND WK-TAXABLE-PROV-CODE = 'QC'         CG220726
              MOVE WS-QC-WASTE-TAX-DATE TO INVOICE-DATE-W004            CG220726
           END-IF.                                                      CG220726
           MOVE WK-CUST-CODE-GROUP     TO CUST-CODE-GROUP-W004.         CG220726
           MOVE WK-DB-KEY              TO DB-KEY-W004.                  CG220726
                                                                        CG220726
           MOVE 'D'                    TO STORE-TYPE-W004.              CG220726
                                                                        CG220726
      *    FOR PCV6 PROMOTIONS SABGP011 SHOULD BE EXECUTED.             CG220726
      *    FOR TCV8/CCV5 DEVELOPMENT DICTIONARIES SABGX011 SHOULD BE    CG220726
      *    EXECUTED.                                                    CG220726
                                                                        CG220726
           TRANSFER 'SABGP011' LINK USING  SUBSCHEMA-CTRL               CG220726
                                           COE-DEFINITION               CG220726
                                           CUSTOMER                     CG220726
                                           MKT-PART                     CG220726
                                           TAX-EXEMPTION                CG220726
                                           AOBGW004                     CG220726
                                           WASTE-TAX-RECORD             CG220726
                                           MISC-ITEM-CHARGE             CG220726
                                           TABLE-HDR                    CG220726
                                           TABLE-DETAIL.                CG220726
                                                                        CG220726
           IF MISC-CHRG-AMT-W004(1) = ZEROES                            CG220726
              GO TO 4700-EXIT                                           CG220726
           END-IF.                                                      CG220726
                                                                        CG220726
      **REQUIREMENT HERE WAS TO CHARGE FIXED FEE HENCE NO RATE          CG220726
      **OR TAX RATE ADDED.                                              CG220726
           INITIALIZE MISC-HDR-CHARGE.                                  CG220726
           MOVE MARKETING-PART-ID-W004   TO                             CG220726
                                MARKETING-PART-ID-8256                  CG220726
           MOVE MISC-CHRG-AMT-W004(1)    TO MISC-CHRG-AMT-8256          CG220726
           IF WS-CONVERT = 'Y'                                          CG220726
              COMPUTE MISC-CHRG-AMT-8256 ROUNDED =                      CG220726
                   MISC-CHRG-AMT-8256  / WS-CURR-FACTOR                 CG220726
           END-IF.                                                      CG220726
           MOVE 'DELIVERY FEE'           TO TAX-NAME-8256               CG220726
                                                                        CG220726
                                                                        CG220726
           MOVE 'W' TO MISC-CHRG-TYPE-FLAG-8256.                        CG220726
           IF CLAIMS-TYPE-3510 = 'X' OR 'W' OR 'F'                      CG220726
              MOVE RECEIVABLE-ITEM-TYPE-2712                            CG220726
                TO DEBIT-CREDIT-IND-8256.                               CG220726
                                                                        CG220726
           MOVE ZEROES                      TO MISC-XREF-LINE-NBR-8256. CG220726
           STORE MISC-HDR-CHARGE.                                       CG220726
           PERFORM IDMS-STATUS THRU ISABEX.                             CG220726
           ADD MISC-CHRG-AMT-8256           TO WK-MISC-CHRG-AMT.        CG220726
                                                                        CG220726
           MOVE SPACES TO TABLE-HDR.                                    CG220726
           MOVE 'DELIVERST'  TO TABLE-KEY-8016.                         CG220726
           OBTAIN CALC TABLE-HDR                                        CG220726
           ON DB-REC-NOT-FOUND                                          CG220726
              GO TO 4700-EXIT                                           CG220726
           END-IF.                                                      CG220726
           OBTAIN FIRST TABLE-DETAIL WITHIN HDR-DETAIL                  CG220726
           ON DB-END-OF-SET                                             CG220726
              GO TO 4700-EXIT                                           CG220726
           END-IF.                                                      CG220726
           IF DB-STATUS-OK                                              CG220726
              PERFORM UNTIL DB-END-OF-SET                               CG220726
                         OR (TABLE-DETAIL-DATA-8017(1:20) =             CG220726
                             AVP-LOCAL-NAME)                            CG220726
                 OBTAIN NEXT TABLE-DETAIL WITHIN HDR-DETAIL             CG220726
                 ON DB-END-OF-SET                                       CG220726
                    CONTINUE                                            CG220726
                 END-IF                                                 CG220726
              END-PERFORM                                               CG220726
           END-IF.                                                      CG220726
           IF DB-END-OF-SET                                             CG220726
                 GO TO 4700-EXIT                                        CG220726
           END-IF.                                                      CG220726
           MOVE ZEROES                TO AVP-STATE-TAX-RATE.            CG220726
           MOVE ZEROES                TO AVP-LOCAL-TAX-RATE.            CG220726
           MOVE ZEROES                TO AVP-COUNTY-TAX-RATE.           CG220726
           MOVE ZEROES                TO AVP-SEC-LC-TAX-RATE.           CG220726
           MOVE ZEROES                TO AVP-SEC-CN-TAX-RATE.           CG220726
           MOVE ZEROES                TO AVP-ST-TAX-AMT.                CG220726
           MOVE ZEROES                TO AVP-LC-TAX-AMT.                CG220726
           MOVE ZEROES                TO AVP-CN-TAX-AMT.                CG220726
           MOVE ZEROES                TO AVP-SEC-LC-TAX-AMT.            CG220726
           MOVE ZEROES                TO AVP-SEC-CN-TAX-AMT.            CG220726
           MOVE ' '                   TO AVP-NO-TAX-IND.                CG220726
           MOVE ' '                   TO AVP-NO-ST-TAX.                 CG220726
           MOVE ' '                   TO AVP-NO-CN-TAX.                 CG220726
           MOVE ' '                   TO AVP-NO-LC-TAX.                 CG220726
                                                                        CG220726
           MOVE ZEROES        TO AVP-EXEMPT-AMT.                        CG220726
                                                                        CG220726
                                                                        CG220726
           MOVE MISC-CHRG-AMT-8256          TO AVP-GROSS-AMT.           CG220726
                                                                        CG220726
           IF (ORDER-TYPE-3510 = 'C'                                    CG220726
           AND (CLAIMS-TYPE-3510 NOT = 'W'                              CG220726
           AND CLAIMS-TYPE-3510 NOT = 'X'                               CG220726
           AND CLAIMS-TYPE-3510 NOT = 'F'))                             CG220726
               COMPUTE AVP-GROSS-AMT = AVP-GROSS-AMT * -1.              CG220726
                                                                        CG220726
           IF (CLAIMS-TYPE-3510 = 'W'                                   CG220726
           OR CLAIMS-TYPE-3510 = 'X'                                    CG220726
           OR CLAIMS-TYPE-3510 = 'F')                                   CG220726
           AND DEBIT-CREDIT-IND-3503 = 'C'                              CG220726
               COMPUTE AVP-GROSS-AMT = AVP-GROSS-AMT * -1.              CG220726
                                                                        CG220726
           MOVE '  ' TO AVP-ERROR-CODE.                                 CG220726
                                                                        CG220726
           IF AVP-RETREAD-TAX-FLAG = 'Y' AND                            CG220726
              FORM-DATE-8243 NOT = SPACES                               CG220726
              MOVE FORM-DATE-8243 (3:6) TO AVP-INV-DATE                 CG220726
           END-IF.                                                      CG220726
                                                                        CG220726
      *    FOR PCV6 PROMOTIONS SABGP310 SHOULD BE EXECUTED.             CG220726
      *    FOR TCV8/CCV5 DEVELOPMENT DICTIONARIES SABGX310 SHOULD BE    CG220726
      *    EXECUTED.                                                    CG220726
                                                                        CG220726
           MOVE SPACES            TO AVP-SEC-COUNTY-CODE.               CG220726
           TRANSFER 'SABGP310' LINK USING                               CG220726
                                    SUBSCHEMA-CTRL                      CG220726
                                    TAX                                 CG220726
                                    TAX-AUDIT                           CG220726
                                    PRODUCT-CODE                        CG220726
                                    ADSO-APPLICATION-GLOBAL-RECORD      CG220726
                                    AVP-TAX-RECORD                      CG220726
                                    AVP-TAXSEL-PARAMETERS               CG220726
                                    AVP-TAXJURIS-PARAMETERS             CG220726
                                    APPLICATION-REFERENCE-RECORD        CG220726
                                    TABLE-HDR                           CG220726
                                    TABLE-DETAIL.                       CG220726
                                                                        CG220726
           MOVE 'SABGP380' TO PROGRAM-NAME.                             CG220726
                                                                        CG220726
           IF ORDER-TYPE-3510 = 'C'                                     CG220726
               COMPUTE AVP-LC-TAX-AMT = AVP-LC-TAX-AMT * -1             CG220726
           END-IF.                                                      CG220726
                                                                        CG220726
           COMPUTE WS-DELIVERY-FEE-LC-TAX ROUNDED =                     CG220726
                       AVP-LC-TAX-AMT * 1.                              CG220726
                                                                        CG220726
       4700-EXIT.                                                       CG220726
             EXIT.                                                      CG220726
                                                                        CG220726
       4800-CHECK-SPCL-PRICE.                                           CG240531
             MOVE 'SPCLDSCNT'         TO TABLE-KEY-8016                 CG240531
             FIND CALC TABLE-HDR                                        CG240531
             ON DB-REC-NOT-FOUND                                        CG240531
                GO TO 4800-EXIT                                         CG240531
             END-IF                                                     CG240531
             MOVE ZEROES              TO WK-SPCL-COUNT                  CG240531
             PERFORM VARYING WK-SPCL-COUNT FROM 1 BY 1 UNTIL            CG240531
                             WK-SPCL-COUNT > 3                          CG240531
                IF DISCOUNT-CODE-2712 (WK-SPCL-COUNT) NOT = SPACES      CG240531
                   INITIALIZE DISCOUNT                                  CG240531
                   MOVE DISCOUNT-CODE-2712 (WK-SPCL-COUNT)              CG240531
                                      TO DISCOUNT-CODE-3540             CG240531
                   OBTAIN CALC DISCOUNT                                 CG240531
                   ON DB-REC-NOT-FOUND                                  CG240531
                      CONTINUE                                          CG240531
                   END-IF                                               CG240531
                   IF DB-STATUS-OK                                      CG240531
                      MOVE SPACES      TO ENTRY-CODE-8017               CG240531
                      MOVE MSPN-NBR-3540                                CG240531
                                      TO ENTRY-CODE-8017                CG240531
                      FIND TABLE-DETAIL WITHIN HDR-DETAIL               CG240531
                                      USING ENTRY-CODE-8017             CG240531
                      ON DB-REC-NOT-FOUND                               CG240531
                         CONTINUE                                       CG240531
                      END-IF                                            CG240531
                      IF DB-STATUS-OK                                   CG240531
                         MOVE SPACES      TO                            CG240531
                              DISCOUNT-CODE-2712 (WK-SPCL-COUNT)        CG240531
                      END-IF                                            CG240531
                   END-IF                                               CG240531
                END-IF                                                  CG240531
             END-PERFORM.                                               CG240531
       4800-EXIT.                                                       CG240531
             EXIT.                                                      CG240531
       4850-CHECK-SPCL-PRICE.                                           CG240531
             MOVE 'SPCLDSCNT'         TO TABLE-KEY-8016                 CG240531
             FIND CALC TABLE-HDR                                        CG240531
             ON DB-REC-NOT-FOUND                                        CG240531
                GO TO 4850-EXIT                                         CG240531
             END-IF                                                     CG240531
             MOVE ZEROES              TO WK-SPCL-COUNT                  CG240531
             PERFORM VARYING WK-SPCL-COUNT FROM 1 BY 1 UNTIL            CG240531
                             WK-SPCL-COUNT > 3                          CG240531
                IF DISCOUNT-CODE-2714 (WK-SPCL-COUNT) NOT = SPACES      CG240531
                   INITIALIZE DISCOUNT                                  CG240531
                   MOVE DISCOUNT-CODE-2714 (WK-SPCL-COUNT)              CG240531
                                      TO DISCOUNT-CODE-3540             CG240531
                   OBTAIN CALC DISCOUNT                                 CG240531
                   ON DB-REC-NOT-FOUND                                  CG240531
                      CONTINUE                                          CG240531
                   END-IF                                               CG240531
                   IF DB-STATUS-OK                                      CG240531
                      MOVE SPACES      TO ENTRY-CODE-8017               CG240531
                      MOVE MSPN-NBR-3540                                CG240531
                                      TO ENTRY-CODE-8017                CG240531
                      FIND TABLE-DETAIL WITHIN HDR-DETAIL               CG240531
                                      USING ENTRY-CODE-8017             CG240531
                      ON DB-REC-NOT-FOUND                               CG240531
                         CONTINUE                                       CG240531
                      END-IF                                            CG240531
                      IF DB-STATUS-OK                                   CG240531
                         MOVE SPACES      TO                            CG240531
                              DISCOUNT-CODE-2714 (WK-SPCL-COUNT)        CG240531
                      END-IF                                            CG240531
                   END-IF                                               CG240531
                END-IF                                                  CG240531
             END-PERFORM.                                               CG240531
       4850-EXIT.                                                       CG240531
             EXIT.                                                      CG240531
      ****************************************************              CG170907
      *  TO LOAD WHEEL POSITION DETAIL IN SOLEXT                        CG170907
      ****************************************************              CG170907
       8000-GET-WP-DETAIL.                                              CG170907
                                                                        CG170907
           FIND CURRENT SALES-ORDER-LINE.                               CG170907
           OBTAIN NEXT SOLEXT WITHIN SO-LINE-EXT                        CG170907
             ON DB-END-OF-SET                                           CG170907
               GO TO 8000-EXIT.                                         CG170907
                                                                        CG170907
           MOVE DR-WHEEL-POSTN-CODE-8244                                CG170907
                                       TO DR-WHEEL-POSTN-CODE-2714.     CG170907
           MOVE DR-REMOVAL-RSN-CODE-8244                                CG170907
                                       TO DR-REMOVAL-RSN-CODE-2714.     CG170907
           MOVE TIRE-DISPOSITION-CODE-8244                              CG170907
                                       TO TIRE-DISPOSITION-CODE-2714.   CG170907
           MOVE TREAD-DEPTH-REMAIN-32-8244                              CG170907
                                       TO TREAD-DEPTH-REMAIN-32-2714.   CG170907
                                                                        CG170907
       8000-EXIT.                                                       CG170907
            EXIT.                                                       CG170907
       LNKUOM90           SECTION.                                              
                                                                                
       COPY IDMS MODULE CASPUOM0-CALL.                                          
                                                                                
           MOVE 'SABGP380' TO PROGRAM-NAME.                                     
                                                                                
       LNKUOM90-EXIT.                                                           
           EXIT.                                                                
                                                                        04780000
       ARRERR95           SECTION.                                              
      ***********************************************************************   
      * THIS ROUTINE ABORTS THE PROGRAM WHEN A BAD ERROR STATUS IS          *   
      * PASSED BACK FROM CARPRIDB                                           *   
      ***********************************************************************   
                                                                                
           MOVE CWK3-ERROR-STATUS-CODE TO WK-ERROR-STATUS(2:).          C00889  
           MOVE ARR-RECORD-NAME TO WK-ERROR-REC(2:).                    C00889  
           MOVE ARR-AREA-NAME TO WK-ERROR-AREA(2:).                     C00889  
           MOVE ARR-ERROR-SET-NAME TO WK-ERROR-SET-NAME(2:).            C00889  
           MOVE ARR-ERROR-RECORD-NAME TO WK-ERROR-REC-NAME(2:).         C00889  
           MOVE ARR-ERROR-AREA-NAME TO WK-ERROR-AREA-NAME(2:).          C00889  
           MOVE 'SABGP380 ADARP900' TO WK-ERROR-PGM-NAME(2:).           C01619  
           MOVE ARR-DML-SEQUENCE TO WK-ERROR-DML-SEQ(2:).               C00889  
           MOVE 'A/R ABEND' TO WK-ERROR-DB-NAME(2:).                    C00889  
           WRITE LOG MESSAGE ID 7999990                                 C00889  
                 PARMS FROM WK-ERROR-STATUS LENGTH 5                    C00889  
                       FROM WK-ERROR-REC LENGTH 17                      C00889  
                       FROM WK-ERROR-AREA LENGTH 17                     C00889  
                       FROM WK-ERROR-SET-NAME LENGTH 17                 C00889  
                       FROM WK-ERROR-REC-NAME LENGTH 17                 C00889  
                       FROM WK-ERROR-AREA-NAME LENGTH 17                C00889  
                       FROM WK-ERROR-PGM-NAME LENGTH 18                 C00889  
                       FROM WK-ERROR-DML-SEQ LENGTH 5                   C00889  
                       FROM WK-ERROR-DB-NAME LENGTH 10.                 C00889  
                                                                                
       ARRERR95-EXIT.                                                           
           EXIT.                                                                
                                                                                
       EJECT                                                                    
       COPY IDMS MODULE IDMS-STATUS.                                            
                                                                                
       IDMS-ABORT.                                                              
       IDMS-ABORT-EXIT.                                                         
           EXIT.                                                                
